[
    {
        "title": "NAVAC Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/913505/navac-inc",
        "url": "https://www.navacvacuum.com/",
        "linkedin": "https://www.linkedin.com/company/navac-inc/",
        "description": "NAVAC, VACUUM SOLUTIONS FOR EVERY INDUSTRIAL CHALLENGE\n\n⦿ DESIGNED & BUILT TO WITHSTAND THE TOUGHEST INDUSTRIAL PROCESSES ⦿\nNAVAC is a global manufacturer that has dedicated over 30 years to the R&D and manufacturing of Industrial Vacuum solutions and HVAC/R tools.\nNAVAC draws upon its commitment to technical innovation, strong customer service, and robust R&D to deliver solutions offering unsurpassed efficiency, accuracy, and durability. Offering a full product line of industrial vacuum pumps, accessories, and customized solutions. NAVAC’s product portfolio is designed with three focuses in mind: Performance, Reliability, and Service. With NAVAC, we empower our customers to drive innovation for the future while helping them NAVIGATE advanced vacuum technology challenges and choices.\n\n⦿ APPLICATION FOR AN EXTENSIVE RANGE OF KEY INDUSTRIES ⦿\nNAVAC is comprised of vacuum technology experts who understand the sector’s ever-evolving landscape and the challenges it presents. Our vacuum pump solutions cater to a wide, extensive range of applications. Discover how NAVAC can empower you with Performance, Reliability, and Service.\n\n⦿ PERFORMANCE. RELIABILITY. SERVICE. DRIVEN BY YOUR SUCCESS ⦿"
    },
    {
        "title": "BizReps 420",
        "internal_link": "https://www.mjbizdirectory.com/company/926364/bizreps-420",
        "url": "https://bizreps420.com/",
        "linkedin": null,
        "description": "Welcome to BizReps 420! We are a team of Engineers & Cannabis Sales Professionals specializing in delivering U.S. Made, cutting-edge LED Grow Lights, Power Outage Mitigation, and Cannabis Homogenizers for the cannabis growing industry. We are on a mission to transform the cannabis industry with solutions that enhance productivity and sustainability while being cost-effective.\n\nOur Mission at BizReps 420 is to provide sales outsourcing services to legal cannabis growers and processors by offering the highest quality LED Grow Lights, Cannabis Homogenizers/Mixers, and Off the Grid Power Solutions. We are a manufacturing representative for several U.S. made products focused on improving the growing and processing operations in the legal cannabis industry. We represent some of the top manufacturing companies in the U.S. and work with our clients to understand their needs, assist them in selecting and selling the right equipment at a competitive price to improve their business."
    },
    {
        "title": "KIMTRON Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/351073/kimtron-inc",
        "url": "https://www.kimtron.com/cannabis-irradiators",
        "linkedin": "https://www.linkedin.com/company/kimtron-inc-cannabis-sterilization-division",
        "description": "Kimtron, Inc., founded in 1991, excels as an industry leader in delivering superior industrial X-ray products and services across a vast array of sectors, including medical, biological research, cannabis, aerospace, metal casting, defense, and homeland security. As an ISO 9001:2015-certified engineering and manufacturing firm, we pride ourselves on our history of strong customer partnerships, reliably delivering high-performance, advanced X-ray solutions to over 500 clients worldwide. Our best-in-class, patented X-ray technologies combined with our commitment to quality and precision reflect in our comprehensive offerings ranging from biological irradiators and X-ray generators to custom high-voltage power supplies. Our responsive field service, performance excellence, and repair center capabilities ensure we meet customer needs swiftly and effectively, underscoring our dedication to innovation and service. Kimtron's devotion to pushing the boundaries of X-ray technology, along with our robust responsiveness to market demands, we focus on rapid technology deployment, responsive service, and creating value to enhance your competitiveness in your respective fields. We Grow with You."
    },
    {
        "title": "Silverson Machines Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/120465/silverson-machines-inc",
        "url": "https://www.silverson.com/",
        "linkedin": "https://www.linkedin.com/company/silverson-machines/",
        "description": "For 75 years, Silverson has specialized in the manufacture of quality high shear mixers for processing and manufacturing industries worldwide. With customers in over 150 countries, and serving industries as diverse as food, pharmaceuticals, cosmetics, lube oils and petrochemicals, Silverson has become the world leader in the field of high shear mixing. Time after time, companies specify Silverson mixers as the “standard” equipment for their manufacturing process.\n\nThe key to this success is based on the professionalism and commitment Silverson shows to each of its customer’s needs. Whether supplying machines from its standard range of mixers or designing equipment specifically to meet an individual customer's requirements, quality is guaranteed.\n\nWith a customer base that includes many of the world’s largest companies, Silverson is constantly at the forefront of new technologies. Developing and applying new high shear mixing techniques to meet these needs, Silverson has the experience, knowledge and commitment to both quality and service to solve today’s mixing needs and those of the future.\n\nA truly international company, Silverson is represented by a network of associated companies, distributors and agents in over 50 countries, serving North America, Europe, Asia, Australasia, South America and Africa."
    },
    {
        "title": "SeedMasters.com",
        "internal_link": "https://www.mjbizdirectory.com/company/921222/seedmasters-com",
        "url": "https://seedmasters.com/",
        "linkedin": null,
        "description": "Here at SeedMasters.com, we specialize in offering a diverse range of high-quality souvenir cannabis seeds by collaborating with numerous reputable seed banks to ensure discreet, secure, and reliable sourcing for our customers. Our user-friendly online platform is designed to help businesses efficiently search and refine product selections based on specific needs such as feminized or auto-flowering seeds. We are committed to customer satisfaction, providing detailed information from trusted sources and continuously expanding our inventory with seeds from the world’s top producers. We serve customers throughout the UK and Europe, providing a reliable service backed by credible information.\n\nOur personalized customer support ensures that if a specific product is not listed on our website, businesses can reach out to us directly for tailored assistance and precise product details. We hope you find exactly what you are looking for here at SeedMasters.com! However, if you can’t find what you need on the website, that doesn’t mean we can’t get it!"
    },
    {
        "title": "FSOil LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/932116/fsoil-llc",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "G&D Chillers, Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/913131/g-d-chillers-inc",
        "url": null,
        "linkedin": null,
        "description": "G&D CHILLERS UNDERSTANDS THE NEEDS OF THE LOW TEMP EXTRACTION INDUSTRY WITH A TEAM OF DEDICATED ENGINEERS WHO KNOW YOUR INDUSTRY. WE DESIGN RELIABLE LARGE-SCALE INDUSTRIAL CHILLING EQUIPMENT SPECIFICALLY DESIGNED FOR THE CANNABIS AND HEMP EXTRACTION INDUSTRY.\n\nOur new LSX Ultra-Low Temp for Large Scale eXtraction, is designed for high volume production facilities by a company that knows what on the line each and every day. Each LSX package chiller contains the highest quality components; high efficiency semi-hermetic two stage economized compressors, baffled stainless steel reservoirs, specially selected low temperature process pumps, and brazed plate evaporators, all assembled with the same pride and commitment to cold that has been the hallmark of our company for 30 years."
    },
    {
        "title": "Molded Fiber Glass Tray Co.",
        "internal_link": "https://www.mjbizdirectory.com/company/127669/molded-fiber-glass-tray-co",
        "url": null,
        "linkedin": null,
        "description": "Molded Fiber Glass Tray, MFG Tray, is a leading manufacturer of high-strength, glass-reinforced composite containers, trays, boxes, flats and totes for material handling in the metalworking, plastics and electronics assembly industries, as well as in food service, confectionery, medical/laboratories and pharmaceutical processing. The company continually develops customized solutions for specific material-handling challenges and applications."
    },
    {
        "title": "Floreo Botanicals",
        "internal_link": "https://www.mjbizdirectory.com/company/930881/floreo-botanicals",
        "url": null,
        "linkedin": null,
        "description": "We are an Irish manufacturer producing cold-pressed CBD oil that redefines what CBD products can offer in today’s market. Our production method preserves all the hemp plant's properties: over 480 natural compounds including cannabinoids, terpenes, flavonoids, and essential nutrients -delivering the true entourage effect (in contrast with existing CBD-oils on the market). We retain the plant’s integrity, resulting in a superior product that addresses key trends in the CBD market.\n\nOur CBD-oil contains 5% CBD and >0.0003% THC, with no additives or carrier oils."
    },
    {
        "title": "Credence Engineering Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/913311/credence-engineering-inc",
        "url": null,
        "linkedin": null,
        "description": "With over 25 years of experience, Credence Filling Systems offers innovative cartridge cappers and filling systems for the vaping community. We build systems that meet the highest standards for streamlining any filling and capping process. We got our start engineering medical equipment, so we’re intimately familiar with building equipment to a superior standard.\n\nOur filling and capping equipment has been specially designed for the unique requirements of the vaping industry. Choosing the right hardware that matches your formulation is essential for successful vape products. Filling your cartridges in-house with the correct equipment will ensure your process and hardware work flawlessly together for you to guarantee a quality product to your customers.\n\nAs a customer-focused company, we are known for our immediate personal assistance and creative solutions to unique problems. We will provide customized solutions to meet your specifications, including custom machine modification, custom nests, and software upgrades for applications that require variable filling solutions.\n\nOur innovative team designs and manufactures efficient cartridge filling and capping systems at our facility in Tempe, Arizona. Our user-friendly machines optimize production and lead the way in Short Path Systems for the vaping community. Our cartridge filling machines provide throughput ranging from 600-2000 devices per hour, with a 99% fill accuracy rate. Our full inventory of machines and parts means less production downtime if replacement parts are needed.\n\nOur team is dedicated to consumer safety and quality equipment. Machines from Credence follow extensive quality control inspections and testing for reliability, safety, and high MTBF"
    },
    {
        "title": "CNC Packaging INC",
        "internal_link": "https://www.mjbizdirectory.com/company/912941/cnc-packaging-inc",
        "url": null,
        "linkedin": null,
        "description": "CNC Packaging Inc. specializes in providing advanced semi-automatic and automated vape cartridge filling and capping solutions designed to optimize efficiency and productivity. Our flagship products, including the C-SOLO semi-automatic machine and the C900 Series automated systems, are tailored to accommodate various cartridge and pod systems with features that ensure minimal product waste and intuitive user interfaces. Made in the USA, our equipment incorporates internally integrated heating and low-maintenance designs to handle high viscosity oils with ease. We are dedicated to supporting your profitable vape cartridge manufacturing operations with reliable machines and comprehensive training and support services. Choose CNC Packaging Inc. for innovative solutions that elevate your production capabilities."
    },
    {
        "title": "CannVerify",
        "internal_link": "https://www.mjbizdirectory.com/company/912850/cannverify",
        "url": null,
        "linkedin": null,
        "description": "Leaders in anti-counterfeit and information delivery for the cannabis and hemp industry. Patented technology. Founded in 2017. CannVerify offers a leading anti-counterfeit and brand protection platform specifically designed for the cannabis and hemp industry. Our comprehensive system increases customer trust and enhances brand transparency by providing accurate product information and real-time lab results through our innovative LiveLabel technology. Companies of all sizes, from startups to multi-state operators, use our robust solutions to safeguard their products and connect directly with their customers, while also offering loyalty rewards to enhance customer engagement. With seamless integrations with world-class software like Confident Cannabis, Shopify, and Flourish Seed-to-Sale, CannVerify ensures automated workflows and efficient information delivery. Our mission is to protect brands and provide consumers with safe, verified cannabis and hemp products through a secure and user-friendly platform."
    },
    {
        "title": "Hardware Factory Store",
        "internal_link": "https://www.mjbizdirectory.com/company/912693/hardware-factory-store",
        "url": null,
        "linkedin": null,
        "description": "Hardware Factory Store (HFS) is your one-stop shop for high-quality laboratory and industrial equipment, designed to meet the needs of professionals across various sectors. We specialize in an extensive range of products including vacuum ovens, extraction systems, glassware, and more, all meticulously engineered for reliability and performance. Our commitment to customer satisfaction is reflected in our competitive pricing, speedy delivery, and exceptional after-sales support. At HFS, we continually strive to innovate and provide advanced solutions that push the boundaries of what’s possible in your work. Explore our vast catalog and experience the superior quality and service that sets us apart in the industry."
    },
    {
        "title": "Egan Food Technologies",
        "internal_link": "https://www.mjbizdirectory.com/company/850675/egan-food-technologies",
        "url": null,
        "linkedin": null,
        "description": "Egan Food Technologies is a premier manufacturer of custom food processing equipment, specializing in providing innovative solutions tailored to the needs of the food industry. Our comprehensive range of offerings includes machine systems, auxiliary equipment, change parts, and a full suite of service and support options such as field and phone support, spare parts, and advanced controls. We pride ourselves on our commitment to excellence, partnering with clients to deliver cutting-edge technology that enhances efficiency and productivity. Our team of dedicated professionals leverages years of expertise to design and implement systems that meet the highest standards of quality and compliance. As a part of the Egan family of companies, we are dedicated to continuous improvement, innovation, and customer satisfaction."
    },
    {
        "title": "Thomas Scientific",
        "internal_link": "https://www.mjbizdirectory.com/company/120400/thomas-scientific",
        "url": null,
        "linkedin": null,
        "description": "It is our mission to be the most trusted partner in science for our customers, suppliers, and associates.\nLaboratory supplies - Diagnostic solutions - Cleanroom solutions - Biological manufacturing - Forensic products - Industrial Cannabis equipment - Clinical products - Measurement Instruments\nFor 120+ years, Thomas Scientific has provided the latest in equipment and supplies to the science community. In accordance with the tradition of the original founders, Thomas Scientific provides individualized customer service, innovative scientific equipment, and a comprehensive portfolio offering a wide selection of product listings at a great deal."
    },
    {
        "title": "Amoretti",
        "internal_link": "https://www.mjbizdirectory.com/company/913401/amoretti",
        "url": null,
        "linkedin": null,
        "description": "We make the ultimate flavorings and ingredients for your pastry, savory and beverage creations. Perfect for home, bar and restaurant use. Made in California."
    },
    {
        "title": "Sunburn Cannabis",
        "internal_link": "https://www.mjbizdirectory.com/company/929334/sunburn-cannabis",
        "url": null,
        "linkedin": null,
        "description": "Sunburn Cannabis is a vertically-integrated cannabis operator with 14 retail locations in Florida, including Fort Lauderdale, Miami Beach, and West Palm Beach - Celebrating America's rebellious, rock-n-roll, free spirit by growing the highest quality cannabis in Florida."
    },
    {
        "title": "California Extraction Supply",
        "internal_link": "https://www.mjbizdirectory.com/company/929094/california-extraction-supply",
        "url": null,
        "linkedin": null,
        "description": "California Extraction Supply is a specialized retailer located in Concord, California, focusing on equipment and supplies for hydrocarbon extraction and CRC (Color Remediation Column) processes. Established in late 2021, the store offers a wide range of products including closed-loop extractors, absorbents, stainless steel components, vacuum ovens, and various other accessories needed for extraction processes. The store is staffed by a knowledgeable team with extensive experience in the field, dating back to 2012.\n\nCalifornia Extraction Supply is known for its dedication to safety and efficiency, providing high-quality equipment and personalized consulting services. They cater to both commercial and individual clients, ensuring that all extraction needs are met. The store operates Monday through Friday from 10:00 AM to 6:00 PM Offering delivery as well as instore pickup and shopping."
    },
    {
        "title": "RollPros",
        "internal_link": "https://www.mjbizdirectory.com/company/913460/rollpros",
        "url": null,
        "linkedin": null,
        "description": "RollPros revolutionizes the cannabis industry with the Blackbird, the only automated pre-roll machine that rolls joints, not stuff cones. Designed to fit through a standard doorway, the Blackbird empowers producers to generate 5000 high-quality joints per shift, significantly reducing costs and accelerating business growth. Our patented technology ensures top-tier product differentiation, making RollPros a trusted partner across North America. Beyond our cutting-edge machinery, we offer exceptional support and valuable resources, from live demos to comprehensive market reports. At RollPros, your success is our mission, underscored by a dedication to innovation, collaboration, and community elevation."
    },
    {
        "title": "Rain Science Grow Bags",
        "internal_link": "https://www.mjbizdirectory.com/company/920123/rain-science-grow-bags",
        "url": null,
        "linkedin": null,
        "description": "One of a kind Mesh growbags. That eliminate problems and increase yields. Rain Science Grow Bags revolutionize your gardening experience with their innovative, durable, and breathable grow bags, designed to optimize plant health and growth. Our unique fabric allows for superior air and water circulation, ensuring robust root development and preventing common problems like root circling. Perfect for hobbyists and commercial growers alike, Rain Science Grow Bags provide a healthy environment for a variety of plants, from vegetables to cannabis. Committed to sustainability and quality, our grow bags are made to last season after season. Choose Rain Science Grow Bags for an unparalleled gardening solution that supports thriving, resilient plants."
    },
    {
        "title": "HendRx",
        "internal_link": "https://www.mjbizdirectory.com/company/919815/hendrx",
        "url": null,
        "linkedin": null,
        "description": "Rooted in the rich, dynamic cannabis cultivation region of northern Humboldt County, HendRx Farm specializes in providing elite cannabis genetics to both hobbyists and licensed commercial growers. With a deep passion for sharing genetics and a commitment to the cultural legacy of Humboldt, our team excels in breeding and identifying premier cannabis cultivars. Our comprehensive nursery services include premium quality pest and pathogen management, verified genetics, and rigorous commercial compliance, ensuring your plants thrive. At HendRx, we are dedicated to innovative research and development, including groundbreaking trials on microbial inoculation to enhance harvest quality. Choose HendRx for award-winning genetics and expert support that fuels your cannabis cultivation success."
    },
    {
        "title": "Sustainable Aquafarms",
        "internal_link": "https://www.mjbizdirectory.com/company/918321/sustainable-aquafarms",
        "url": null,
        "linkedin": null,
        "description": "Sustainable Aquafarms is a high-tech, deep-water culture hydroponic greenhouse dedicated to producing top-quality hemp for CBD cultivation and premium varieties of lettuce with unique flavors and hardiness. With state-of-the-art facilities spanning 325 acres under the roof, including germination rooms and cold storage, we maintain strict biosecurity protocols and rigorous quality standards. Our commitment to excellence is reflected in our USDA Good Agricultural Practices (GAP) certified operations and our dedication to achieve Safe Quality Foods (SQF) certification. Licensed under NYS Agriculture and Markets, we boast a robust capacity of over 3 million hemp plants and seedlings, ensuring our customers receive the best quality for their planting needs. At Sustainable Aquafarms, we combine generations of greenhouse growing expertise with innovative practices to deliver produce that stands out in taste and quality."
    },
    {
        "title": "EspriGas",
        "internal_link": "https://www.mjbizdirectory.com/company/915451/esprigas",
        "url": null,
        "linkedin": null,
        "description": "EspriGas simplifies your gas supply needs by offering a comprehensive range of high-quality gases tailored for beverage, medical, industrial, and commercial applications. Our wide selection includes essential gases like Carbon Dioxide, Nitrogen, Oxygen, Acetylene, Argon, Helium, and Nitrous Oxide, ensuring precise solutions for every industry. With a focus on convenience and reliability, we provide seamless access to the gases you need, exactly when you need them. Our national operations, supported by a dedicated team and innovative logistics, enable us to deliver unparalleled service across the United States. Choose EspriGas for a streamlined and efficient gas supply experience, backed by decades of expertise and commitment to customer satisfaction."
    },
    {
        "title": "Biosan",
        "internal_link": "https://www.mjbizdirectory.com/company/915305/biosan",
        "url": null,
        "linkedin": null,
        "description": "Biosan is a trusted American family-owned chemical company, offering advanced peracetic acid solutions designed to enhance agricultural and horticultural practices. Our EPA-registered products, such as OXYSAN 15 and OXYSAN 25, provide effective treatment for agricultural and irrigation water systems, drip irrigation, greenhouses, and soil applications. We specialize in improving the quality and safety of water systems, animal housing facilities, and even reverse osmosis systems, ensuring a more sustainable and productive farming environment. From sanitizing livestock water systems to preventing citrus canker, our comprehensive range of solutions supports the diverse needs of modern agriculture. Partner with Biosan to optimize your agricultural processes with innovative, eco-friendly chemical treatments."
    },
    {
        "title": "Access Rosin",
        "internal_link": "https://www.mjbizdirectory.com/company/913539/access-rosin",
        "url": null,
        "linkedin": null,
        "description": "Access Rosin leads the way in solvent-less extraction technology, providing innovative and automated solutions specifically designed for efficiency and precision. Our cutting-edge Smart Agitation Water Extraction systems, advanced rosin presses, and high-quality freeze dryers ensure consistent, high-yield results every time. We offer complete facility development services, including custom floor plans, direct training, and consultations, to optimize your extraction processes. Our patented flow control technology and flexible financing options empower businesses to achieve top-tier performance without compromising financial stability. Partner with Access Rosin to elevate your extraction processes and join thousands of satisfied customers who trust us for their solvent-less manufacturing needs."
    },
    {
        "title": "Twister Trimmer by Keirton Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/913512/twister-trimmer-by-keirton-inc",
        "url": null,
        "linkedin": null,
        "description": "Twister Trimmer leads the industry in providing innovative and efficient post-harvest solutions for cannabis, marijuana, and hemp producers. Our advanced trimming machines, including the Twister T2, T4, and the industrial-grade T-Zero, are designed to maximize productivity and ensure top-quality output while preserving the natural beauty of the flower. With our cutting-edge SoftTumble technology and robust design, our machines reduce labor costs and downtime, allowing producers to scale their operations efficiently. Twister also offers a comprehensive range of products such as the BatchOne Pro and Marvel AI Sorter to meet varying production needs, from small batches to large commercial operations. Trust Twister Trimmer for exceptional engineering, outstanding design, and unparalleled performance in every trimming and sorting solution we offer."
    },
    {
        "title": "ExtractCraft",
        "internal_link": "https://www.mjbizdirectory.com/company/913503/extractcraft",
        "url": null,
        "linkedin": null,
        "description": "With ExtractCraft oil extraction machines, enjoy the full benefits of your botanicals and make your own essential oils at home. ExtractCraft offers innovative, user-friendly botanical extraction appliances that allow you to create high-potency concentrates and essential oils from the comfort of your home or small business. Our flagship products, the Source Turbo and EtOH Pro, use a safe, closed-loop ethanol vacuum process to deliver pure, full-spectrum oils with high terpene and flavonoid retention. Perfect for DIY enthusiasts, health advocates, and small-scale producers, our machines simplify the creation of RSO, FECO, edibles, topicals, and more, all while saving you money compared to retail purchases. We are committed to quality, efficiency, and sustainability, with our devices reclaiming up to 98% of ethanol for re-use. Join our vibrant community of makers and take control of your health and wellness with ExtractCraft."
    },
    {
        "title": "AiroClean420",
        "internal_link": "https://www.mjbizdirectory.com/company/913459/airoclean420",
        "url": null,
        "linkedin": null,
        "description": "AiroClean420, developed by Sterilumen, revolutionizes air purification in cannabis cultivation by using patented Photocatalytic Oxidation (PCO) technology to eliminate powdery mildew, mold, bacteria, and other airborne pathogens. Unlike traditional HEPA filters, our systems destroy contaminants completely, ensuring a safer and cleaner grow environment without re-circulating harmful particles. Our flagship products, the AiroClean420 Max and AiroClean420 XL, offer zero emissions, no ozone, and require no chemicals for operation, making them the optimal choice for maintaining the purity of your crops. Trusted by industry leaders, our technology has even been utilized on NASA's International Space Station, proving its unparalleled efficacy and reliability. Choose AiroClean420 for a hassle-free, plug-and-play solution to protect and improve your cannabis yield."
    },
    {
        "title": "Athena Ag",
        "internal_link": "https://www.mjbizdirectory.com/company/913456/athena-ag",
        "url": null,
        "linkedin": null,
        "description": "Athena Inc, is a vertically integrated formulator, manufacturer of liquid and dry fertilizer blends designed for commercial cannabis cultivators. Athena exists to support the modern grower, no matter the scale. Our core principle is to develop products that improve quality, reduce costs and drive consistency. Athena was born in the grow rooms of Los Angeles, California, where we are always in pursuit of the perfect run. As the weight of being a cultivator increases, we exist to make the complex simple.Athena is not a nutrient line, it is a program."
    },
    {
        "title": "Custom Cones USA",
        "internal_link": "https://www.mjbizdirectory.com/company/913445/custom-cones-usa",
        "url": null,
        "linkedin": null,
        "description": "Custom Cones USA is your one-stop shop for all pre-roll needs, specializing in everything from pre-rolled cones and blunts to state-of-the-art pre-roll machines and packaging solutions. We offer the widest selection of pre-rolled cones, including refined white, natural brown, organic hemp, and hemp blunt options, all designed for an exceptional, clean burn. As the foremost experts in the industry, we ensure compliance and quality across all our products to help your brand stand out on dispensary shelves. Our custom design services and innovative packaging options, like biodegradable and compostable materials, ensure your pre-roll products are not only appealing but also eco-friendly. Trust Custom Cones USA to scale your pre-roll business with premium products and unparalleled expertise."
    },
    {
        "title": "Futurola USA LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/913410/futurola-usa-llc",
        "url": null,
        "linkedin": null,
        "description": "Futurola is a pioneering brand in the world of smoking accessories, delivering high-quality rolling papers, pre-rolled cones, and state-of-the-art machinery to enthusiasts globally. Our commitment to innovation and craftsmanship is evident in every product, creating a superior smoking experience that meets both personal and commercial needs. From our iconic Dutch Brown Papers to cutting-edge cone-filling machines, Futurola combines tradition with technology to perfect the art of rolling. We pride ourselves on offering a seamless blend of convenience, quality, and style, making us a trusted name among discerning smokers. Explore our extensive range and discover how Futurola can elevate your smoking ritual to new heights."
    },
    {
        "title": "Hemper",
        "internal_link": "https://www.mjbizdirectory.com/company/913393/hemper",
        "url": null,
        "linkedin": null,
        "description": "Hemper is your go-to destination for premium smoking accessories and monthly subscription boxes that elevate the smoking experience. Our carefully curated boxes feature exclusive, high-quality glass pieces, smoking essentials, and unique items that cater to both novice and seasoned enthusiasts. With a commitment to innovation, each Hemper box is designed to surprise and delight, arriving at your door with the latest and greatest in smoking gear. Beyond our subscription service, we offer a wide range of products, from rolling papers and grinders to cleaning supplies, ensuring you have everything you need for the ultimate session. At Hemper, we aim to enhance your lifestyle with convenience, quality, and a community-driven spirit."
    },
    {
        "title": "Royal Gold",
        "internal_link": "https://www.mjbizdirectory.com/company/913378/royal-gold",
        "url": null,
        "linkedin": null,
        "description": "Royal Gold is a pioneering company specializing in premium coco fiber-based soil products, setting the industry standard for nearly two decades. Located in Humboldt County, California, we leverage extensive research and a rigorous testing process to deliver unparalleled quality and consistency in our soil mediums. By utilizing sustainable alternatives and locally sourced materials, we create environmentally friendly products that cater to both commercial cultivators and hobbyist gardeners. Our diverse product lineup, including our renowned Kings Mix and Tupur, ensures optimal soil structure and texture, supporting healthy plant growth across various gardening practices. Committed to innovation, Royal Gold continually develops new solutions to help gardeners of all scales achieve exceptional results."
    },
    {
        "title": "Hydra Unlimited",
        "internal_link": "https://www.mjbizdirectory.com/company/913355/hydra-unlimited",
        "url": null,
        "linkedin": null,
        "description": "Hydra Unlimited specializes in innovative, high-performance hydroponic grow systems designed to maximize your yield efficiently and sustainably. With over 40 years of expertise, our HydraMax product line caters to home, professional, and commercial growers, offering advanced recirculating deep water culture (RDWC) technology. Our patented Root Halo media-less netpot ensures superior root growth and stability, eliminating the need for traditional grow media and reducing the risks of pathogens. We pride ourselves on providing eco-friendly, American-made solutions that enhance cultivation through optimal nutrient distribution and reduced maintenance needs. Experience unparalleled growth and operational support with Hydra Unlimited's top-tier hydroponic systems."
    },
    {
        "title": "AdeptAg",
        "internal_link": "https://www.mjbizdirectory.com/company/913353/adeptag",
        "url": null,
        "linkedin": null,
        "description": "AdeptAg is North America's leading provider of controlled environment production solutions, specializing in automation, irrigation, and integrated control systems. Formed in 2022 from the merger of industry leaders AgriNomix, Bellpark Automation, Plantech Control Solutions, and Zwart Irrigation Solutions, our mission is to maximize yields and productivity for growers. Our advanced solutions include automation systems, irrigation technologies, and comprehensive control mechanisms that ensure optimal greenhouse climate and water management. We prioritize efficiency, sustainability, and customer support, offering a full range of services from installation to continuous technical assistance. AdeptAg is your trusted partner in achieving superior growth and operational excellence in controlled-environment horticulture."
    },
    {
        "title": "Current Culture H2O",
        "internal_link": "https://www.mjbizdirectory.com/company/913345/current-culture-h2o",
        "url": null,
        "linkedin": null,
        "description": "For the last 15 years, Current Culture H2O (CCH2O) has been a market leader and innovator in hydroponic cultivation solutions for professional growers worldwide. Our Proven Production Approach includes high-performance hydroponics systems, premium hydroponic nutrients, and expert support.\n\nOur solutions are used in a wide variety of modern agricultural applications in both greenhouses and controlled environments."
    },
    {
        "title": "Viscon Medicinal Crops.",
        "internal_link": "https://www.mjbizdirectory.com/company/913273/viscon-medicinal-crops",
        "url": null,
        "linkedin": null,
        "description": "Passionate about Agro and Food processes and the limitless possibilities technology has to offer. Our machinery, software and integrated solutions enable the world to produce, distribute and enjoy healthy fresh food, flowers and plants.We provide machine automation, software and integrated solutions to make agricultural processes more sustainably profitable, scalable and easy.\nAs a system integrator, we build machines but moreover we build integrations. Our software enables full control and management of your production facility, seamlessly integrating all automation equipment."
    },
    {
        "title": "Vostermans Ventilation Multifan",
        "internal_link": "https://www.mjbizdirectory.com/company/913272/vostermans-ventilation-multifan",
        "url": null,
        "linkedin": null,
        "description": "Echelon Supply and Service, with nearly 50 years of expertise, is North America’s premier provider of industrial and hydraulic hose solutions. Our extensive product line, including the high-performance FORSAFLEX system, meets the rigorous demands of both commercial and defense markets. Headquartered in Liverpool, New York, with 14 fabrication and distribution centers across the US and Canada, we ensure swift and reliable supply to our diverse clientele. We are committed to a customer-first approach, delivering quality products, exceptional support, and tailored solutions that make our customers' lives easier. Echelon is dedicated to empowering our clients' success through advanced technology and unparalleled service."
    },
    {
        "title": "Harvest Supply Canada Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/913255/harvest-supply-canada-inc",
        "url": null,
        "linkedin": null,
        "description": "Harvest Supply Canada Inc. is a custom fabricator and manufacturer that specializes in producing Stainless Steel Drying Racks, Drying Trays, Hanging Racks, Heavy Duty Harvesting/Bucking Machines, and Custom Conveyor Systems. Operating out of a fully equipped manufacturing facility, we focus our attention on unparalleled quality and service. Contact Harvest Supply to discuss engineering solutions for all your harvesting needs."
    },
    {
        "title": "MTA-USA, LLC.",
        "internal_link": "https://www.mjbizdirectory.com/company/913076/mta-usa-llc",
        "url": null,
        "linkedin": null,
        "description": "MTA-USA is an established leader in the design and manufacture of automated equipment for various industries, including automotive, electronics, and general manufacturing. Our innovative technology solutions streamline and enhance production processes, ensuring high quality and efficiency for our clients. With a commitment to excellence and customer-focused solutions, MTA-USA has built a reputation for reliability and innovation. Our product range includes assembly lines, robotic systems, and specialized tooling, all engineered to meet the specific needs of our clients. Discover how MTA-USA can revolutionize your manufacturing process with state-of-the-art automation."
    },
    {
        "title": "Chem-Tainer Industries",
        "internal_link": "https://www.mjbizdirectory.com/company/145834/chem-tainer-industries",
        "url": null,
        "linkedin": null,
        "description": "For over 50 years, Chemtainer Industries has been a trusted leader in providing environmentally safe storage and handling solutions across various sectors. Our extensive product line includes water tanks, bulk storage solutions, chemical storage, spill containment, and septic tanks, designed to meet the rigorous demands of water treatment, pharmaceuticals, hydroponics, and beyond. With a network of 9 manufacturing facilities and 25 nationwide shipping locations, we ensure timely and economical delivery of high-quality products tailored to your specific needs. Our commitment to innovation and customer-focused service has fueled our success and continues to drive us forward. At Chemtainer Industries, we don't just offer products; we offer reliable solutions to support your business's growth and sustainability."
    },
    {
        "title": "Agrify",
        "internal_link": "https://www.mjbizdirectory.com/company/913053/agrify",
        "url": null,
        "linkedin": null,
        "description": "Agrify is a leading provider of innovative cultivation and extraction solutions for the cannabis industry, bringing data, science, and technology to the forefront of the market. Our proprietary micro-environment-controlled Vertical Farming Units (VFUs) enable cultivators to produce the highest quality products with unmatched consistency, yield, and ROI at scale. Our comprehensive extraction product line, which includes hydrocarbon, ethanol, solventless, post-processing, and lab equipment, empowers producers to maximize the quantity and quality of extract required for premium concentrates."
    },
    {
        "title": "Speedee Trim",
        "internal_link": "https://www.mjbizdirectory.com/company/913001/speedee-trim",
        "url": null,
        "linkedin": null,
        "description": "Speedee trim is the best and fastest marijuana bud trimmer in the world. Trim 420 buds without damage."
    },
    {
        "title": "Breeza Industrial",
        "internal_link": "https://www.mjbizdirectory.com/company/912993/breeza-industrial",
        "url": null,
        "linkedin": null,
        "description": "Fans. Machining. Fabrication. We do it all. We can manufacture the piece, part, or structure you need to complete the job. Breeza Industrial, established in 1990, specializes in manufacturing high-quality axial industrial fans, machining parts, and custom fabrication solutions. Located in Utica, Nebraska, we pride ourselves on exceptional service, rapid delivery, and our ability to cater to both small and large orders with the same dedication. At Breeza, we understand the importance of precision and reliability, whether it's for replacement engine fans for brands like CAT, Cummins, and John Deere, or custom-machined spacers, bushings, and pulleys. Our state-of-the-art facilities, including water jets, press brakes, and welders, enable us to meet the evolving needs of our customers. We are committed to small-town values and solutions, solving complex problems with a personal touch."
    },
    {
        "title": "Willow Industries",
        "internal_link": "https://www.mjbizdirectory.com/company/912980/willow-industries",
        "url": null,
        "linkedin": null,
        "description": "Willow Industries is built on one simple principle: cannabis businesses should have the resources they need to provide patients and consumers consistently clean products. Our technology is an organic, ozone-based system that safely cleans cannabis flower, hemp and trim without compromising quality, flavor or effect. In fact, this is the only protective technology taken from agriculture and perfected specifically for cannabis. Our systems mitigate surprises during the testing process and inspections as well as ensures the highest quality product reaches the end consumer. The WillowPure system was designed to prevent and decontaminate mold, mildew, yeast, E. Coli, Salmonella, and Aspergillus. The relationship with our cultivators goes beyond our WillowPure systems - it is a continuous partnership that supports the core of our industry. Our clean cannabis team works carefully with each cultivator, providing microbial assessments, regulatory knowledge, expert cannabis solutions, and a tailored approach to each grow."
    },
    {
        "title": "EZ Trim Harvesting and Consulting",
        "internal_link": "https://www.mjbizdirectory.com/company/912974/ez-trim-harvesting-and-consulting",
        "url": null,
        "linkedin": null,
        "description": "EZTRIM - Your one stop shop for your post harvest needs. We provide excellent customer service with all our products manufactured right here in Denver Colorado. Cannabis trimmers are an essential piece of hemp trimming equipment. You must follow the proper trimming steps to ensure the plant isn't damaged – SAVE HALF YOUR HARVESTING TIME, USING HALF THE STAFF, WHILE MAINTAINING THE QUALITY OF YOUR PRODUCT."
    },
    {
        "title": "DASERCO CANN",
        "internal_link": "https://www.mjbizdirectory.com/company/912973/daserco-cann",
        "url": null,
        "linkedin": null,
        "description": "Dade Service Corporation (DASERCO) is a 4th generation family business, established in 1954, specializing in the construction of ripening and cold storage solutions for the produce industry. With over 70 years of proven expertise, we design and build energy-efficient, low-maintenance ripening rooms, including banana and multi-fruit ripening options. Our advanced DASERCO Controls provide custom solutions, ensuring optimal ripening conditions tailored to each unique room. Beyond ripening rooms, we offer rapid cool rooms, produce coolers, distribution center construction, and processing and fresh cut facilities. At DASERCO, exceptional service is our cornerstone, and we are dedicated to working together to achieve greatness for our clients."
    },
    {
        "title": "Schwazze",
        "internal_link": "https://www.mjbizdirectory.com/company/912972/schwazze",
        "url": null,
        "linkedin": null,
        "description": "Schwazze is a pioneering vertically integrated cannabis operator with a strong presence in Colorado and New Mexico, dedicated to transcending the human condition through cannabis. Our diverse family of brands, including Star Buds, Emerald Fields, and R.Greenleaf, offers premium retail experiences and a wide selection of high-quality cannabis products for both recreational and medical use. At Schwazze, we embrace a data-driven approach to innovation, utilizing advanced cultivation techniques and technologies to maximize growth and enhance product quality. Our commitment to exceptional customer service and community engagement sets us apart, ensuring personalized and informative experiences at every point of contact. With our vibrant ecosystem of cultivators, manufacturers, and retailers, Schwazze is reimagining the future of wellness through the power of cannabis."
    },
    {
        "title": "Sanuvox Technologies",
        "internal_link": "https://www.mjbizdirectory.com/company/912923/sanuvox-technologies",
        "url": null,
        "linkedin": null,
        "description": "Sanuvox Technologies Inc. is a global leader in ultraviolet (UV) air purification, offering cutting-edge solutions designed to enhance indoor air quality across residential, commercial, medical, and agricultural environments. Our advanced UV air purifiers and coil cleaning systems utilize patented technology to maximize exposure time, delivering unmatched purification rates and energy efficiency. Trusted by businesses, institutions, and homeowners, Sanuvox systems naturally eliminate airborne biological contaminants, helping to reduce the risk of spreading viruses and alleviate symptoms of building-related illnesses. Our innovative products, such as the Bio-Wall™ and the compact R1r, are designed to meet the needs of any HVAC system, ensuring cleaner, healthier air for all. Partnering with industry leaders like Terra Universal, we are committed to setting the global standard for clean, pure air through continuous innovation and dedication to quality."
    },
    {
        "title": "KannaMill",
        "internal_link": "https://www.mjbizdirectory.com/company/912858/kannamill",
        "url": null,
        "linkedin": null,
        "description": "KannaMill specializes in customized cannabis and hemp grinding equipment designed to meet the specific needs of the industry. Our hammer mills are engineered to handle various plant materials, from flowers to stalks, ensuring consistent particle sizes ideal for extraction processes, pre-rolls, and industrial hemp applications. With features like custom configurations, fresh-frozen milling capabilities, anti-resin assemblies, and enhanced extraction yields, KannaMill ensures efficiency and scalability for operations of all sizes. Our mills offer easy operation and maintenance, delivering uniform particle size for high-quality end products. Elevate your cannabis processing with KannaMill’s robust and reliable grinding solutions."
    },
    {
        "title": "HYGROZYME",
        "internal_link": "https://www.mjbizdirectory.com/company/912772/hygrozyme",
        "url": null,
        "linkedin": null,
        "description": "Hygrozyme, a pioneer in responsible growing since 1974, offers an extensive range of natural plant solutions designed toenhance crop yield and health. Our revolutionary products, including Hygrozyme, Hygroben, Hyclean, Hyshield, and the latest addition—Hygropunch, are developed to provide optimal crop enhancement, protection, and nutrient management. Manufactured in our ISO 9001 certified facility, we ensure the highest standards of quality and performance. With an easy-to-use feed calculator and comprehensive technical resources, we empower growers to achieve their best harvests. At Hygrozyme, we are committed to sustainable practices and delivering superior results for all your cultivation needs."
    },
    {
        "title": "King Kone",
        "internal_link": "https://www.mjbizdirectory.com/company/912771/king-kone",
        "url": null,
        "linkedin": null,
        "description": "King Kone USA specializes in state-of-the-art pre-roll cone filling machines designed to drastically increase production efficiency for cannabis businesses. Our flagship product, the King Kone Pre-Roll Machine, allows for rapid and consistent filling, saving you valuable time and boosting output. We also offer customizable modular trays that can be tailored to any size and girth, ensuring a perfect fit for your production needs. Committed to innovation and customer satisfaction, we provide comprehensive support, including product demos and warranty registration. As industry leaders, we continuously strive to bring you the best in pre-roll technology and exclusive offers—helping you stay ahead in the competitive market."
    },
    {
        "title": "Feel Good Flavors",
        "internal_link": "https://www.mjbizdirectory.com/company/912684/feel-good-flavors",
        "url": null,
        "linkedin": null,
        "description": "High quality accessories for herb connoisseurs and casual cannabis smokers alike. Established in 2019, Feel Good Flavors emerged from the desire to discreetly travel with our legal medicine, without the possibility of the smell making those around us uncomfortable. This led to the development of our first smell proof bags, which we sold in our local community and a few surrounding cities. As support grew for the brand, we decided to expand our range of product offerings to include stash boxes, rolling papers, grinders, trays etc."
    },
    {
        "title": "Apogee Instruments, Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/861108/apogee-instruments-inc",
        "url": null,
        "linkedin": null,
        "description": "At Apogee Instruments, our mission is to help you make better measurements. This means more than just creating and selling research-grade sensors at an excellent price. It involves understanding your needs, supplying solutions, and providing the world-class support you need to succeed no matter the size of your project."
    },
    {
        "title": "Biomist",
        "internal_link": "https://www.mjbizdirectory.com/company/750555/biomist",
        "url": null,
        "linkedin": null,
        "description": "Sanitation is critical to the success of any cannabis operation. Uncontrolled pathogens in growing and processing facilities can lead to outbreaks that require the eradication of entire crops, costing time and money.\n\nBiomist Formula D2 is a solvent that can be used to clean waxy, oily or sticky resins and botanical residues from surfaces. Processing equipment must be cleaned and sanitized between uses to prevent cross-contamination from one batch to the next. Biomist is non-corrosive and perfect for disinfecting electronics and water-sensitive equipment found in packaging areas, extraction rooms and laboratories."
    },
    {
        "title": "Genplant",
        "internal_link": "https://www.mjbizdirectory.com/company/913100/genplant",
        "url": null,
        "linkedin": null,
        "description": "Genplant is revolutionizing the way businesses take control of their energy costs. Our modular energy plants and indoor cultivation facilities save money and improve power reliability while helping businesses reduce their carbon footprint.Our proprietary modular designs are manufactured and pre-tested in a controlled environment, then assembled more quickly than traditional methods, saving our clients time and as much as 30-60 percent on their energy costs."
    },
    {
        "title": "Greenfield Global",
        "internal_link": "https://www.mjbizdirectory.com/company/928702/greenfield-global",
        "url": null,
        "linkedin": null,
        "description": "Greenfield Global has been a pioneering force in providing high-purity alcohols, specialty solvents, custom-blended solutions, and fuel ethanol to a worldwide clientele since 1989. We cater to diverse markets including renewable fuels, beverage alcohols, life sciences, food, flavor and fragrance, personal care, and industrial sectors, ensuring quick delivery through our extensive global supply chain. Our operations include five alcohol distilleries, five blending and packaging facilities, and eight warehouses, supported by innovative projects like one of North America's largest anaerobic digestion facilities to produce renewable natural gas. Dedicated to sustainability, Greenfield Global is committed to reducing carbon intensity and transitioning to renewable energy sources such as green hydrogen, green methanol, and sustainable aviation fuel. Headquartered in Toronto, Canada, and family-owned, we pride ourselves on our platinum-level designation as one of Canada’s Best Managed Companies since 2015."
    },
    {
        "title": "Averix Bio",
        "internal_link": "https://www.mjbizdirectory.com/company/928701/averix-bio",
        "url": null,
        "linkedin": null,
        "description": "Averix Bio stands at the forefront of pharmaceutical-grade cannabinoid innovation, delivering the highest quality products to meet diverse health and wellness needs. Rooted in transparency, precision, and scientific integrity, we utilize cutting-edge extraction techniques to ensure consistent, pure, and compliant cannabinoids. Our commitment to rigorous research and development allows us to offer a range of tailored solutions that address specific therapeutic applications. Partnering with leading healthcare providers and researchers, Averix Bio continues to drive advancements in cannabinoid science. Trust in Averix Bio for unparalleled excellence and a steadfast dedication to enhancing patient outcomes."
    },
    {
        "title": "Growpacker",
        "internal_link": "https://www.mjbizdirectory.com/company/928610/growpacker",
        "url": null,
        "linkedin": null,
        "description": "Growpacker is a leading co-manufacturer and co-packer for the cannabis industry, providing a full range of services from formulation to distribution. We specialize in delivering consistent, high-quality cannabis-infused products, leveraging our advanced facilities and expert team. Our comprehensive suite of services includes bottling, canning, pouching, and more, tailored to meet the specific needs of cannabis brands. We are committed to ensuring regulatory compliance and maintaining the highest standards in product safety and quality. Partner with Growpacker to streamline your production process and bring your unique cannabis products to market efficiently and effectively."
    },
    {
        "title": "Wonderbrett",
        "internal_link": "https://www.mjbizdirectory.com/company/928700/wonderbrett",
        "url": null,
        "linkedin": null,
        "description": "Wonderbrett transcends the ordinary through an unwavering dedication to cultivating ultra-premium cannabis. Rooted in decades of elite experience and rare genetics, our unique strain selection and rich terpene profiles create unmatched flavors that keep customers returning. Located in Long Beach, California, our state-of-the-art facility expertly combines traditional techniques with advanced technology to produce small-batch, craft-style cannabis at scale. Our legacy traces back to the legendary summer of '97, where our founder's original OG Kush became a staple among the top musicians in Los Angeles. Today, Wonderbrett continues to lead California's cannabis market with a fresh cultural appeal and a commitment to quality."
    },
    {
        "title": "Sartorius Chromatography Equipment",
        "internal_link": "https://www.mjbizdirectory.com/company/913319/sartorius-chromatography-equipment",
        "url": null,
        "linkedin": null,
        "description": "Novasep Equipment Solutions Is Now Sartorius Chromatography Equipment (SCE)\n\nFrom development through to industrial scaling, we provide a complementary range of cGMP equipment and services for purification. Modular and customizable, they can integrate seamlessly into three key processes: THC remediation, CBD isolation and rare cannabinoid isolation.\n\nHigh-purity production\nUp to 99% of CBD or rare cannabinoid purity.\n\nScalability and yield\nProduce anything from just a few grams to hundreds of kilos. The same process method remains rigorously applied at any production scale.\n\nCompetitive production costs\nReliability and robustness minimize maintenance costs. Our solvent recycling solution reduces operating costs when scaling up production."
    },
    {
        "title": "Terpene Warehouse",
        "internal_link": "https://www.mjbizdirectory.com/company/912901/terpene-warehouse",
        "url": null,
        "linkedin": null,
        "description": "Terpene Warehouse is a premier online destination for high-quality terpene products and essential oils. With a strong focus on purity and authenticity, Terpene Warehouse offers a carefully curated selection of premium terpene blends, sourced from the finest botanicals and designed to enhance your sensory experiences. Whether you're a professional in the cannabis industry or simply seeking to elevate your aromatherapy practice, Terpene Warehouse provides a user-friendly platform where you can explore a diverse range of terpene profiles, access detailed information, and discover the perfect aromatic companion for your needs. Unleash the power of nature's aromas with Terpene Warehouse and unlock a world of scintillating fragrances."
    },
    {
        "title": "Franklin Miller Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/195565/franklin-miller-inc",
        "url": null,
        "linkedin": null,
        "description": "Franklin Miller manufactures size reduction processors — crushers, shredders, grinders and screens. Our equipment is suitable for wet or dry industrial applications, wastewater grinding, and screening as well as solid waste reduction and wastewater shredders. Franklin Miller machines are making a difference in plant operations worldwide in applications such as: reducing solids to keep pumps and system running smoothly, reducing lumps and solids, improving product consistency and quality as well as in the shredding of bulk solids and documents."
    },
    {
        "title": "Kaeser Compressors",
        "internal_link": "https://www.mjbizdirectory.com/company/187353/kaeser-compressors",
        "url": null,
        "linkedin": null,
        "description": "Kaeser is one of the largest providers of compressed air systems and compressed air consulting services, with over 7000 employees worldwide. Our goal is to provide exceptional customer service coupled with innovative products and progressive system solutions. Our engineers continue to refine manufacturing techniques and take full advantage of the latest machining innovations. Extensive commitment to research and development keeps our products on the leading edge of technology to benefit our customers. Prompt and dependable customer service, ISO 9001:2008 quality assurance and ISO 14001:2004 environmental systems, training, and engineering support all contribute to the value our customers have come to expect."
    },
    {
        "title": "Trilogene Seeds",
        "internal_link": "https://www.mjbizdirectory.com/company/913061/trilogene-seeds",
        "url": null,
        "linkedin": null,
        "description": "Buy Top-Grade Hemp Seeds Online. Trilogene seeds offer high-quality feminized hemp seeds. We deliver reliable feminized low THC CBD Seeds with industry-leading quality. Find the best quality auto flower genetics, hemp clones, and CBD seeds. Shop today!"
    },
    {
        "title": "Tin Canna",
        "internal_link": "https://www.mjbizdirectory.com/company/928454/tin-canna",
        "url": null,
        "linkedin": null,
        "description": "Tin Canna offers the world's most sustainable, child-resistant, and senior-friendly packaging solutions for the cannabis industry. Made from the highest quality FDA-certified food-grade tin, our products are 100% recyclable and free of plastic, ensuring easy disposal through any blue bin or curbside recycling program. Our customizable packaging options feature full-color offset-lithography printing, with available gloss, matte, and spot finishes, as well as custom embossing for a premium tactile feel. Patented and ASTM certified, Tin Canna's locking mechanism guarantees compliance with Poison Prevention Packaging Standards while delivering top-notch security. Choose Tin Canna to lead your brand toward a sustainable and innovative future in cannabis packaging."
    },
    {
        "title": "Geosphere Packaging",
        "internal_link": "https://www.mjbizdirectory.com/company/928451/geosphere-packaging",
        "url": null,
        "linkedin": null,
        "description": "Better for All offers certified home compostable party cups that are both reusable and renewable, perfect for large venues, small events, and outdoor festivals. Our cups are made from Green Planet PHBH, a unique biobased material that ensures stability, toughness, and maximum compostability without any environmentally harmful additives. We are committed to providing non-toxic products, free of phthalates, bisphenols, PFAs, dioxins, and titanium dioxide, all while supporting a global shift towards sustainable resources. Our products seamlessly integrate with existing beverage stations and help businesses build consumer trust by offering genuinely eco-friendly alternatives to plastic cups. Join us in revolutionizing the way we celebrate and disposing of plastic waste by choosing Better for All for your next event."
    },
    {
        "title": "Quality Extraction Group",
        "internal_link": "https://www.mjbizdirectory.com/company/928450/quality-extraction-group",
        "url": null,
        "linkedin": null,
        "description": "Quality Extractions Group specializes in distributing high-purity hydrocarbons, offering N-Butane, Iso-Butane, and Propane either in pure form or custom blends for optimal extraction processes. Our USA-made, sulfur-free solvents, delivered via low-pressure cylinders with eductor tubes, ensure the highest standards of safety and quality. Serving both the United States and Canada, we guarantee fast and secure delivery straight to your doorstep, no matter the size of your order. Our rigorous quality assurance process includes thorough cleaning and drying of each cylinder to exceed 90% particulate removal, ensuring top-notch material condition. Choose Quality Extractions Group for superior extraction solutions and trustworthy service."
    },
    {
        "title": "Precision Extraction Solutions",
        "internal_link": "https://www.mjbizdirectory.com/company/913183/precision-extraction-solutions",
        "url": null,
        "linkedin": null,
        "description": "Precision Extraction Solutions, a division of Agrify, is the industry leader in cannabis and hemp extraction equipment, technology, lab design and site planning, compliance, training, and consulting. Precision offers cutting-edge solutions for cannabis and hemp processors at every growth stage. With unparalleled tech support and customer service, Precision helps its customers thrive in the extraction industry through innovation, safety, and service while providing unique industry-specific technology, experience, and knowledge. More award-winning concentrates are made with Precision than any other brand."
    },
    {
        "title": "MedXtractor",
        "internal_link": "https://www.mjbizdirectory.com/company/928449/medxtractor",
        "url": null,
        "linkedin": null,
        "description": "MedXtractor is at the forefront of the rapidly expanding oils and concentrates market, delivering high-purity, high-potency extraction solutions. Our advanced CO2 extraction technology maximizes crop value, providing a substantial \"value-bump\" in the seed-to-sale chain. Ideal for creating diverse products such as tinctures, topicals, ingestables, sprays, and suppositories, our systems ensure flexibility and quality at every stage. Browse our range of products to stay ahead of the curve in this lucrative and dynamic industry. Choose MedXtractor to elevate your extraction process and deliver superior cannabis-derived products."
    },
    {
        "title": "PolyScience",
        "internal_link": "https://www.mjbizdirectory.com/company/144519/polyscience",
        "url": null,
        "linkedin": null,
        "description": "Chillers and Coolers\n\nPolyScience Chillers and Coolers have proven, over several decades and hundreds of thousands of installations, that they are the most reliable in the industry — and an exceptionally smart choice for end-user and OEM applications ranging from lasers and analytical equipment to reactors and manufacturing equipment."
    },
    {
        "title": "Essential Extracts",
        "internal_link": "https://www.mjbizdirectory.com/company/928448/essential-extracts",
        "url": null,
        "linkedin": null,
        "description": "Essential Extracts stands at the forefront of cannabis extraction and innovation, proudly offering top-tier solventless extraction services. Founded by Nick Tanem, a visionary educator and multi-time Cannabis Cup winner, our company has pioneered the first licensed non-solvent extraction facility in the United States. We provide comprehensive consulting services to help clients maximize their extraction processes, and our wholesale offerings include award-winning products such as Strawberry Banana Rosin and Chem Diagonal Rosin Batter. Essential Extracts continues to be recognized in the industry, boasting numerous accolades for the best non-solvent hash. With a firm commitment to quality and compliance, we support businesses from cultivation to dispensary, ensuring excellence at every step."
    },
    {
        "title": "CAT Scientific",
        "internal_link": "https://www.mjbizdirectory.com/company/700929/cat-scientific",
        "url": null,
        "linkedin": null,
        "description": "CAT Scientific revolutionizes the botanical post-processing industry with high-quality laboratory-grade equipment designed for precision and reliability. Our advanced homogenizers, magnetic hotplate stirrers, and diverse range of other laboratory instruments ensure consistent, superior products like tinctures, e-juices, concentrates, and topical creams. As industry leaders, we are committed to supporting businesses by offering versatile solutions that streamline production and adapt to current trends. By integrating cutting-edge technology with deep-level research, we help manufacturers eliminate costly processing glitches, delivering uniformity and excellence in every batch. Connect with CAT Scientific to elevate your botanical processing capabilities and maintain a competitive edge in this rapidly evolving market."
    },
    {
        "title": "Summit Research",
        "internal_link": "https://www.mjbizdirectory.com/company/912876/summit-research",
        "url": null,
        "linkedin": null,
        "description": "Summit Research specializes in short path distillation equipment, laboratory equipment, chemicals, pumps, filtration/media, chillers, consultations, technical support, and technological process innovations. We are, at heart, a small family that engages in industrial equipment sales and acquisition. We offer a range of assistance to our customers through media presentations, social outings, conventions and consultations which include on-site technical support. As a growing family business, we strive not only to have the best quality equipment, but also exceptional customer service. Summit understands the importance of your hard work, research and the emphasis of getting you what you need for your hard earned dollars. Therefore, we are constantly listening to our partners and work with our manufacturers to deliver innovations with the highest quality products in the industry."
    },
    {
        "title": "extractX",
        "internal_link": "https://www.mjbizdirectory.com/company/915555/extractx",
        "url": null,
        "linkedin": null,
        "description": "extractX specializes in turnkey mobile extraction labs, facilitating rapid deployment for commercial and industrial-scale biomass extraction. Our self-contained labs are delivered on-site, ready to operate, and supported by our team of experts to ensure seamless integration and high output production. We focus on ethanol extraction processes, ensuring the highest quality distillate for both recreational and medical product manufacturers. Our services are designed to minimize capital expenditure, offering a partnership model with comprehensive support over 3-year contract periods. With capabilities that meet GPP, cGMP, and EU GMP certifications, extractX helps businesses comply with regulations and expand their market reach."
    },
    {
        "title": "Subzero Scientific",
        "internal_link": "https://www.mjbizdirectory.com/company/928446/subzero-scientific",
        "url": null,
        "linkedin": null,
        "description": "Subzero Scientific specializes in high-quality stainless steel recovery and extraction equipment, perfect for efficient and reliable operations. We pride ourselves on our precision engineering and commitment to quality, ensuring our clients achieve optimal performance in their extraction processes. Beyond supplying top-tier equipment, we offer expert repair and rebuild services, extending the lifecycle of your assets and maximizing your investment. Partner with us for tailored fabrication solutions that meet the unique demands of your manufacturing business. At Subzero Scientific, innovation and excellence drive us to deliver unmatched service and products in the extraction industry."
    },
    {
        "title": "Green Dot Labs",
        "internal_link": "https://www.mjbizdirectory.com/company/928445/green-dot-labs",
        "url": null,
        "linkedin": null,
        "description": "Green Dot Labs stands at the forefront of cannabis cultivation and extraction, dedicated to producing the highest-quality cannabis concentrates and flower in Colorado. Our Black Label line sets the industry standard with its exclusive small-batch offerings, meticulously crafted from our own genetic library. We leverage cutting-edge extraction techniques to provide unparalleled purity and potency, ensuring a premium experience for both recreational and medical consumers. Committed to innovation and sustainability, Green Dot Labs cultivates each strain under precise conditions, preserving terpenes and cannabinoids to deliver exceptional flavor and effects. Explore the pinnacle of cannabis craftsmanship with Green Dot Labs, where quality and innovation meet."
    },
    {
        "title": "Medropharm LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/928444/medropharm-llc",
        "url": null,
        "linkedin": null,
        "description": "Medropharm AG is a leader in the extraction, production, and marketing of high-quality cannabinoid and plant-based healthcare products. Our dedicated research focuses on unlocking the therapeutic potential of medicinal plants, driving innovation and excellence in health and wellness. With state-of-the-art facilities for short-path distillation and extraction, Medropharm ensures superior productivity and value creation for our clients' processes and products. From market analysis to scale-up, we provide comprehensive support to transition from lab-scale concepts to commercial production while maintaining regulatory compliance. Embrace pure and potent plant power with Medropharm, committed to enhancing the quality of life for people and animals through groundbreaking health science advancements."
    },
    {
        "title": "Tamisium Extractors Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/928443/tamisium-extractors-inc",
        "url": null,
        "linkedin": null,
        "description": "Tamisium Extractors revolutionizes the botanical extraction industry with its patented Closed Passive Chemical Oil Extractors (CPE PLRV). Our innovative systems prioritize safety, efficiency, and precision, eliminating the need for electrical pumps and ensuring all processes remain within a closed, rated system. Designed from the ground up, our extractors provide unparalleled control over crucial extraction variables, supporting high-quality, repeatable, and standardized results. By leveraging larger solvent tanks, our systems optimize extraction speed and product consistency, making them ideal for industries like cannabis where precision and safety are paramount. Experience the future of extraction with Tamisium's advanced technology and proven reliability."
    },
    {
        "title": "H&H Extractions",
        "internal_link": "https://www.mjbizdirectory.com/company/928442/h-h-extractions",
        "url": null,
        "linkedin": null,
        "description": "HH Extraction Solutions is a trusted provider of state-of-the-art cannabis extraction equipment and comprehensive support services tailored to meet the needs of the cannabis and hemp industries. Our dynamic team of engineers, designers, and extraction experts delivers end-to-end solutions, from facility design to process consulting, ensuring our clients achieve superior quality and regulatory compliance. We specialize in hydrocarbon and ethanol extraction systems, offering innovative technology that enhances the purity and potency of cannabis extracts. With extensive hands-on support and industry-leading service, HH Extraction Solutions is committed to empowering businesses to produce top-quality extracts at scale. Experience the HH difference with custom-engineered solutions that drive efficiency and excellence in cannabis extraction."
    },
    {
        "title": "Cat Pumps",
        "internal_link": "https://www.mjbizdirectory.com/company/272591/cat-pumps",
        "url": null,
        "linkedin": null,
        "description": "For over 50 years, Cat Pumps has been the world’s most trusted source for high-pressure pumps, providing unparalleled reliability and performance. Our diverse range of high-pressure reciprocating triplex plunger and piston pumps are meticulously designed to meet the highest standards for quality and longevity, making them the go-to choice for industrial and commercial applications. We offer a wide variety of custom pumping systems, tailored to meet specific customer needs, ensuring robust solutions for industries such as automotive, oil and gas, manufacturing, and beyond. Backed by industry-leading customer service and a global network of highly qualified distributors, Cat Pumps ensures that our products and parts are readily available to keep operations running smoothly. With a focus on innovation and dependability, Cat Pumps is committed to delivering the performance and quality that our customers have come to rely on."
    },
    {
        "title": "BVV",
        "internal_link": "https://www.mjbizdirectory.com/company/928439/bvv",
        "url": null,
        "linkedin": null,
        "description": "BVV (Best Value Vacs) is a leading supplier of professional extraction systems, laboratory equipment, and essential accessories, serving the needs of various industries including botanical extraction and chemical research. Our commitment to quality and customer satisfaction is demonstrated through our BVV Loyalty Rewards program, offering exclusive discounts, free shipping, and other amazing benefits to our valued customers. We pride ourselves on being a reliable partner for businesses, providing not only top-tier products but also exceptional customer support via phone and chat. With a diverse range of products from extractors to filtration media, BVV ensures that businesses have access to the most advanced and reliable tools on the market. Our Price Match Guarantee further underscores our dedication to delivering the best value for your investment."
    },
    {
        "title": "Hudson Valley Lyomac",
        "internal_link": "https://www.mjbizdirectory.com/company/766805/hudson-valley-lyomac",
        "url": null,
        "linkedin": null,
        "description": "Hudson Valley/Lyomac offers the highest quality freeze drying technology. Our freeze drying systems featuring longer service life, resistance corrosion, sturdy construction and efficiency.\n\nHudson Valley/Lyomac freeze drying equipment is designed for superior stability in a wide range of industries including:\n\n•Laboratory - remove water from delicate biological products without damaging their chemical structure.\n•Pilot Laboratory – operated via a PC control system parameters are monitored and stored during freeze drying to provide full documentation.\n•Pharmaceutical – increase the shelf life of vaccines and antibodies, antibiotics, proteins, enzymes, hormones, viruses and bacteria, pathological samples and cultures\n•Food Preservation – a superior preservation method for a variety of foods such as fruits, vegetables, fish, culinary herbs, coffee, dairy products, instant noodles and soups\n•Industrial – large capacity for high volume of products including those for the aerospace industry"
    },
    {
        "title": "Arcadia Brands",
        "internal_link": "https://www.mjbizdirectory.com/company/928434/arcadia-brands",
        "url": null,
        "linkedin": null,
        "description": "Arcadia Brands is Oklahoma's premier solventless extraction company, dedicated to crafting high-quality medicinal edibles and products using nature's purest forms. Rooted in the peaceful and simplistic ideals of Arcadia, our full-spectrum extraction process ensures a pesticide-free, balanced, and effective medicine by utilizing only heat, cold, and pressure, avoiding harmful chemicals or gases. Proudly veteran-owned and founded in Arcadia, Oklahoma, we partner with local growers and ensure rigorous testing for quality and accuracy with every batch. Look for the Arcadia solventless gold seal, a mark of premium excellence, indicating our commitment to superior cannabis extracts. Experience the healing power of nature with Arcadia Brands—crafted with care, precision, and purity."
    },
    {
        "title": "Kush Masters",
        "internal_link": "https://www.mjbizdirectory.com/company/928433/kush-masters",
        "url": null,
        "linkedin": null,
        "description": "Kush Masters, a leading Colorado cannabis extraction company nestled in a log cabin next to Boulder’s Flatiron Mountains. Since 2014, we have been at the forefront of the cannabis industry, pioneering innovative extraction methods to deliver connoisseur-quality extracts. Our premium products, including shatter, wax, live rosin batter, and live diamonds, are meticulously crafted to enhance potency, flavor, texture, and quality. Kush Masters is committed to competitive pricing without compromising on excellence, making our high-quality extracts accessible across Colorado. Discover the art of cannabis extraction with Kush Masters and elevate your experience to a whole new level."
    },
    {
        "title": "SHO Products",
        "internal_link": "https://www.mjbizdirectory.com/company/928432/sho-products",
        "url": null,
        "linkedin": null,
        "description": "Sho Companies is a pioneer in delivering comprehensive solutions tailored to meet the unique needs of our diverse clientele. Our unwavering commitment to excellence and innovative approach ensures that we provide top-tier products and services across various industries. At Sho Companies, we pride ourselves on our ability to understand and anticipate our clients’ needs, enabling us to deliver customized solutions that drive success. Our experienced team works collaboratively with clients to turn their visions into reality, fostering lasting partnerships built on trust and excellence. Experience the Sho Companies difference, where dedication and expertise transform challenges into opportunities."
    },
    {
        "title": "Bubble Bags",
        "internal_link": "https://www.mjbizdirectory.com/company/928431/bubble-bags",
        "url": null,
        "linkedin": null,
        "description": "BubbleBag specializes in top-tier extraction equipment, offering three distinct options in our BUBBLE BAGS product line. Our professional-quality, heavy-duty bags are designed with industry-leading durability, featuring a three-quarter bag side wall of mesh screen for superior filtration. Trusted by professionals for their robustness and reliability, our BubbleBags ensure efficient and effective extraction every time. Proudly serving both individual enthusiasts and commercial operators, we are committed to delivering the highest standard of products. Discover the difference with BubbleBag – where quality meets precision."
    },
    {
        "title": "Bhang Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/928356/bhang-inc",
        "url": null,
        "linkedin": null,
        "description": "Bhang is known for the #1, best-selling, master-chef-created chocolate cannabis edibles in North America, and has been providing consumers around the world with an award-winning portfolio of premium brands for over a decade. Born in California, our Company continues to grow as a global consumer packaged goods company dedicated to providing products that enhance everyday life through sensory experiences that complement our consumers' lifestyles, happiness, and well-being. Contact us for wholesale information."
    },
    {
        "title": "Melt-to-Make Gummies",
        "internal_link": "https://www.mjbizdirectory.com/company/912909/melt-to-make-gummies",
        "url": null,
        "linkedin": null,
        "description": "Infused Gummies Simplified! We've done all the heavy lifting to formulate a tasty, all-natural gummy. Melt-to-Make‚ Gummies offers our base gummy formula in 100 gram pucks in a variety of delicious flavors. All you need to do is melt them down and infuse your preferred additive. We also provide a dosing calculator to ensure your finished gummies have the exact dose you desire."
    },
    {
        "title": "The Cannabist Company",
        "internal_link": "https://www.mjbizdirectory.com/company/928354/the-cannabist-company",
        "url": null,
        "linkedin": null,
        "description": "The Cannabist Company (formerly Columbia Care) is one of the largest and most experienced cultivators, manufacturers and retailers of cannabis products and related services in the U.S. Columbia Care was one of the original providers of medical cannabis in the United States, and continues to deliver an industry-leading, patient-centered medicinal cannabis operation that has quickly expanded into the adult use market as a premier operator. The company currently offers products spanning flower, edibles, oils, and tablets, and manufactures popular brands including Classix, Seed & Strain, and Hedy."
    },
    {
        "title": "Newt Brothers",
        "internal_link": "https://www.mjbizdirectory.com/company/928353/newt-brothers",
        "url": null,
        "linkedin": null,
        "description": "Newt Brothers Artisanal began as the vision of two brothers and their mother in 2012, after having spent more than 6 years working in the Colorado cannabis industry. We thought “We can do better”… for the plants, for the environment, for our employees and for our customers.\nNewt Brothers has developed a line of handcrafted chocolates, concentrates and caviar for the cannabis connoisseur. We start by growing only hand-picked strains of the highest-grade cannabis in our state-of-the-art facility. Once ready for harvest, our flower is dried and cured to perfection with our patented drying hooks. After the drying and curing are complete, the flower is released to our hand trimmers so as not to lose any of the product’s integrity. When the trimmers have worked their magic, the product is moved to our ultramodern extraction lab where our extraction specialists begin their artistry to make our amazing concentrates.\nOur Professional Cannabis Consultants can assist your company in streamlining and elevating your processes. Reach out to let us know what you need assistance with, we are happy to work with you."
    },
    {
        "title": "Khush Kush",
        "internal_link": "https://www.mjbizdirectory.com/company/915302/khush-kush",
        "url": null,
        "linkedin": null,
        "description": "A MEDICALLY ENDORSED, FAMILY-OWNED AND OPERATED CANNABIS FARM LOCATED IN WASHINGTON STATE\nWhen the Saini Family started their cannabis farm, integrity, sustainability, and innovation were at the forefront of their mind. So they set out to create top-shelf, clean, products keeping the process as simple as possible. Khush Kush has a hydroponic grow system with rolling greenhouse tables, a complex drip irrigation system, and they use coco coir as a growing medium. Resulting in Khush Kush’s terpene-rich flavor profiles and award-winning flowers."
    },
    {
        "title": "Trulieve",
        "internal_link": "https://www.mjbizdirectory.com/company/928216/trulieve",
        "url": null,
        "linkedin": null,
        "description": "Trulieve delivers optimal customer experiences and increases access to cannabis, helping patients and customers to live without limits. By delivering strong financial discipline, building a recognized brand through optimal customer experiences, and executing on our hub model strategy, we have become an industry-leading MSO and the largest operating retail, cultivation, and production footprint in the country. The Trulieve Supplier Diversity Program provides education, development, and creates mutually beneficial business relationships. Trulieve formed national level partnerships, sponsored events such as expungements and licensing bootcamps in a number of states, and have worked with and directly mentored economic empowerment candidates to assure social equity."
    },
    {
        "title": "Jazz Pharmaceuticals",
        "internal_link": "https://www.mjbizdirectory.com/company/928209/jazz-pharmaceuticals",
        "url": null,
        "linkedin": null,
        "description": "Jazz Pharmaceuticals plc (Nasdaq: JAZZ), is a global biopharmaceutical company whose purpose is to innovate to transform the lives of patients and their families. Working together, we are proud to support patients, innovate and bring new medicines to patients with critical unmet needs. Jazz Pharma purchased GW Pharma in a move to focus on a scientific platform around cannabinoid medicines to specifically support manufacture of Jazz and GW’s two approved cannabis-based medicines."
    },
    {
        "title": "GrowGeneration Corp.",
        "internal_link": "https://www.mjbizdirectory.com/company/913501/growgeneration-corp",
        "url": null,
        "linkedin": null,
        "description": "GrowGeneration is the nation's largest hydroponic store and organic garden center supplier selling hydroponic supplies, commercial grow lights and more. We carry and sell thousands of products, such as organic nutrients and soils, advanced lighting technology and state of the art hydroponics equipment used by commercial and home growers. We have strategic partnerships with the biggest brand names in the industry and offer a direct to farm delivery service along with equipment financing. Our Commercial Team is armed with industry leading professional consultants that are here to help fully manage any size project."
    },
    {
        "title": "Cresco Labs",
        "internal_link": "https://www.mjbizdirectory.com/company/928207/cresco-labs",
        "url": null,
        "linkedin": null,
        "description": "Cresco Labs is one of the largest vertically integrated, multi-state operators in the U.S., with a mission to normalize & professionalize the cannabis industry. Employing a CPG approach to scaling its business, Cresco Labs is the largest wholesaler of branded cannabis products in the country. We’re involved at every point in the seed-to-sale process. Our cultivation and manufacturing facilities are powered by world-class agronomists, extraction and R&D experts, and state-of-the-art agricultural equipment—all of which drive our commitment to quality, purity and consistency. We package, ship and distribute our products to cannabis retailers nationwide, including our Sunnyside stores."
    },
    {
        "title": "Green Thumb Industries Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/928206/green-thumb-industries-inc",
        "url": null,
        "linkedin": null,
        "description": "Green Thumb has 18 manufacturing facilities, over 90 open retail locations and operations across 15 U.S. markets. Established in 2014, Green Thumb employs approximately 4,000 people and serves millions of patients and customers each year. As a national cannabis consumer packaged goods company and retailer, promotes well-being through the power of cannabis while giving back to the communities in which it serves. Green Thumb manufactures and distributes a portfolio of branded cannabis products including Beboe, Dogwalkers, Doctor Solomon's, Good Green, incredibles and RYTHM. The company also owns and operates rapidly growing national retail cannabis stores called RISE."
    },
    {
        "title": "RZA Legal",
        "internal_link": "https://www.mjbizdirectory.com/company/928173/rza-legal",
        "url": null,
        "linkedin": null,
        "description": "At RZA Legal, we pride ourselves on being the respected authority in delivering comprehensive legal solutions catered specifically to small businesses and those operating within regulated industries like cannabis, liquor, and psychedelics. Serving a diverse clientele across Colorado, Florida, New Jersey, and New York, our experienced team, led by Rachael Z. Ardanuy, Esq., stays ahead of the rapid pace of laws, regulations, and industry trends to provide our clients with peace of mind and clear guidance. Whether it's navigating the intricacies of cannabis legal services, diving into the emerging field of psychedelic legal services, handling municipal, commercial real estate, or estate planning issues, our firm offers tailored services designed to grow your business and protect your legacy. Our holistic approach includes education and advocacy, distinguishing us as more than just your attorneys but as dedicated partners committed to your success. At RZA Legal, we remove the stress of legal navigation, allowing you to focus on what you do best: driving your business forward and safeguarding your achievements."
    },
    {
        "title": "Pittman Legal",
        "internal_link": "https://www.mjbizdirectory.com/company/928171/pittman-legal",
        "url": null,
        "linkedin": null,
        "description": "At Pittman Legal, we are dedicated to serving as the pioneering legal force within the cannabis industry in Texas and throughout the South, led by the nationally acclaimed Texas business attorney, Lisa L. Pittman Esq. With over 25 years of traditional trial, regulatory, and corporate experience, complemented by a decade focused on the emerging cannabis sector, our firm provides unparalleled expertise in navigating the complex landscape of multi-state cannabis regulation. Our representation spans across marijuana and hemp cultivators, manufacturers, distributors, dispensaries, ancillary service businesses, and investors, ensuring comprehensive support from licensing and regulatory compliance to litigation and corporate structuring. Recognizing the intricate balance between state and federal laws, Pittman Legal excels in risk management and mitigation, advising clients on effectively scaling their operations amidst evolving legal frameworks. Our deep commitment to advocacy and education places us at the forefront of the push towards a balanced, thriving, and legally compliant cannabis industry in Texas and the broader Southern United States."
    },
    {
        "title": "CannaEx Trades",
        "internal_link": "https://www.mjbizdirectory.com/company/928030/cannaex-trades",
        "url": null,
        "linkedin": null,
        "description": "CannaEx Trades specializes in the distribution and legalization of genetic cannabis products. Since establishing the company in 2019, we have steadily become the go-to partner for businesses seeking expert guidance in importing and exporting top-tier cannabis seeds, flowers, and extracts. Utilizing our all-encompassing government licenses and deep-rooted connections with prominent industry figures, we streamline the complexities of the international cannabis trade, ensuring full compliance and exceptional service. Through CannaEx Trades, clients gain unique access to an expansive range of strains, coupled with unparalleled consultancy on GMP certification, phytosanitary requirements, and logistical intricacies. We are committed to advancing the industry's standards by providing a robust platform for secure, efficient, and successful cannabis transactions worldwide."
    },
    {
        "title": "Green Leaf Lab",
        "internal_link": "https://www.mjbizdirectory.com/company/928017/green-leaf-lab",
        "url": null,
        "linkedin": null,
        "description": "Green Leaf Lab, nationally acclaimed since 2011, sets the gold standard in cannabis and hemp testing, being the first laboratory licensed and accredited by a state agency. Our laboratories, located in Oregon and California, are ISO 17025 Accredited, offering a robust suite of analyses including potency, pesticides, solvents, terpenes, heavy metals, and more. We pride ourselves on precise, dependable analytical testing services, coupled with an unparalleled commitment to our client's success across all stages of production and distribution. Our expertise extends beyond compliance into product development, helping clients gain a competitive edge in the market with reliable, accurate data. At Green Leaf Lab, our dedication to real science, real testing, and real results not only supports the current industry's robust regulatory environment but also fosters innovation and safety, ensuring only the best products reach consumers."
    },
    {
        "title": "Confident Cannabis",
        "internal_link": "https://www.mjbizdirectory.com/company/928016/confident-cannabis",
        "url": null,
        "linkedin": null,
        "description": "Manage your orders, notify clients and analyze your results over time, all through a centralized dashboard.\nAt Confident Cannabis, we are proud to lead the way in cannabis lab testing with our revolutionary software platform that supports over 60% of the industry. Our bespoke LIMS (Laboratory Information Management System) is meticulously tailored to meet the unique demands of cannabis testing, offering labs a centralized dashboard to manage orders, notify clients, and analyze results efficiently. As the preferred choice for numerous laboratories nationwide, we provide software solutions that simplify the complexities of cannabis testing and enhance the service labs can offer to their clients. Our mission is to streamline the trade and testing of legal cannabis, fostering transparency and trust throughout the supply chain. Embracing innovation and client feedback, we've evolved into Confient LIMS, expanding our commitment to deliver state-of-the-art laboratory information management tools designed for the rapidly growing cannabis industry."
    },
    {
        "title": "Santé Laboratories",
        "internal_link": "https://www.mjbizdirectory.com/company/928015/sant-laboratories",
        "url": null,
        "linkedin": null,
        "description": "At Sante Laboratories, we are pioneers in pharmaceutical and nutraceutical innovation, with a strong focus on developing cutting-edge drug delivery technologies. Our unique lipid-based nanoparticle formulation platform enhances the solubility, room-temperature stability, and bioavailability of drugs, meeting critical market needs. Our state-of-the-art cGMP facility and ISO/IEC 17025:2017 accredited testing lab underline our commitment to quality and regulatory excellence, pushing the boundaries of both mainstream and pharmaceutical product development. We provide comprehensive services from formulation to commercialization, leveraging our advanced technology to ensure optimal ingredient absorption and efficacy. Passionate about scientific excellence and problem-solving, we continue to thrive by turning complex challenges into actionable, customer-focused solutions that advance health and improve lives."
    },
    {
        "title": "IRON Laboratories",
        "internal_link": "https://www.mjbizdirectory.com/company/927998/iron-laboratories",
        "url": null,
        "linkedin": null,
        "description": "At IRON Laboratories, our mission is to empower patients, caregivers, and producers with the knowledge they need to ensure the safety and efficacy of their medical and recreational cannabis products. As a leading cannabis testing facility, we are proud to be ISO/IEC 17025:2017 accredited, a testament to our unwavering commitment to providing accurate, consistent, and reliable testing services. Through years of dedicated research and expertise, we've positioned ourselves as the nation's premier medicinal and recreational testing laboratory, continually evolving to meet and exceed the expectations of our community. Our comprehensive suite of testing services, including chromatography and bio/microbial analysis, is designed to ensure that all cannabis products meet the highest quality standards free of impurities. At IRON Laboratories, we're more than a testing facility - we're a dependable resource committed to fostering a safer cannabis industry for everyone."
    },
    {
        "title": "Sigma Analytical Services",
        "internal_link": "https://www.mjbizdirectory.com/company/927988/sigma-analytical-services",
        "url": null,
        "linkedin": null,
        "description": "At Sigma Analytical Services, we empower industries with GMP-certified, meticulous chemical and microbiology testing services, enveloping sectors like pharmaceuticals, food, natural health, nutraceuticals, personal care, psychedelics, and cannabis/hemp. We pride ourselves on delivering not only reliable and timely results but also a superior customer experience, underpinning the quality and compliance of your products. Our laboratory, equipped with state-of-the-art instrumentation and led by a team of esteemed scientists and QA professionals, is driven to support you in the safe market introduction of your innovative products. Upholding a Health Canada License, along with notable international credentials, we are a beacon of trust and excellence in analytical testing and quality assurance. We offer an extensive array of services including method development, stability studies, and bespoke R&D, training, and consulting services, all designed to cater to your evolving needs in product quality and safety."
    },
    {
        "title": "ProBrew",
        "internal_link": "https://www.mjbizdirectory.com/company/927869/probrew",
        "url": null,
        "linkedin": null,
        "description": "At ProBrew, we're driven by innovation, efficiency, and quality, offering turnkey brewery and beverage processing solutions that elevate the craft beverage industry. Our flagship products, including the Alchemator for non-alcoholic beer and seltzer production, and our state-of-the-art ProCarb and ProFill systems, embody our commitment to advancing beverage processing technology. Designed to optimize every step of the beverage production process, our equipment ensures that brewers and beverage producers can achieve unparalleled precision, efficiency, and flavor in every batch. From fermentation and brite tanks designed to match your output, to advanced pasteurization for the burgeoning ready-to-drink market, our solutions are tailored to meet the specific needs of our clients. Partnering with ProBrew means joining over 5000 vessels worldwide in achieving the best in beverage production, backed by a team that’s passionate about quality, innovation, and service."
    },
    {
        "title": "Portland Kettle Works",
        "internal_link": "https://www.mjbizdirectory.com/company/927868/portland-kettle-works",
        "url": null,
        "linkedin": null,
        "description": "At Portland Kettle Works (PKW), we're at the forefront of delivering stainless steel vessels and processing systems tailored for a wide range of industries, from beverage to life sciences, ensuring your project's success from the ground up. Since 2011, we've been the architects of liquid innovation, engineering over 5000 vessels worldwide that testify to our commitment to quality, efficiency, and flexibility. Our mission is directly aligned with your success; we delve deep into your operational needs to craft custom solutions that optimize operations, minimize labor, and maximize throughput, all while ensuring seamless scalability for future innovations. Whether you're in the market for high-performance beverage equipment or precision-controlled systems for the life sciences, our premium quality, corrosion-resistant stainless steel, Hastelloy, and other metal vessels are designed to meet the most stringent application requirements. As your innovation partner, we promise to transform your concepts into reality, offering complimentary whiteboard sessions to refine and actualize your vision with industry-leading expertise."
    },
    {
        "title": "LĒVO",
        "internal_link": "https://www.mjbizdirectory.com/company/927866/l-vo",
        "url": null,
        "linkedin": null,
        "description": "At LEVO, we revolutionize the art of infusion, offering the world’s first automated infuser that simplifies turning your favorite herbs into enriched oils, butter, honey, and more, right from the comfort of your home. Our focus is empowering enthusiasts to create potent and delicious infusions without the mess, odor, or guesswork typically associated with traditional methods. With our easy-to-use machines, free from the hassle of manual labor and cleanup thanks to dishwasher-safe components, you can control the potency and flavor of every batch. From personal to professional culinary uses, our range of infusers, including the LVO C, LVO II, and LVO Lux, are designed to meet varying needs, promising precise temperature control for consistent results. Join over 300,000 happy customers in elevating your infusion game, whether you're experimenting with new flavors or crafting homemade wellness products."
    },
    {
        "title": "Green Vault Systems",
        "internal_link": "https://www.mjbizdirectory.com/company/913303/green-vault-systems",
        "url": null,
        "linkedin": null,
        "description": "Green Vault Systems is the preferred supplier of industrial grade processing and weighing equipment for dried flower processing. We offer professionally engineered solutions which reduce labor costs, increase yields, and improve overall product quality. Our modular approach to packaging is built for efficiency and designed specifically for the cannabis industry. We work with you to create a solution that meets your needs. Start with the basics and add over time. Mix and match components. It up to you."
    },
    {
        "title": "Disruption Labs",
        "internal_link": "https://www.mjbizdirectory.com/company/927814/disruption-labs",
        "url": null,
        "linkedin": null,
        "description": "At Disruption Labs, we stand as the nexus of innovation for consumer packaged goods (CPG) innovators determined to craft next-generation products that truly resonate with today's discerning consumers. Our patented plant-derived delivery technology is the revolutionary pulse behind enhancing ingredient potency and consumer satisfaction, tackling the prevalent challenges of solubility, stability, sensory attributes, and bioavailability. From our Austin, TX base, a multi-strategy contract development and manufacturing organization powers our swift, market-oriented product development and manufacturing capabilities. Our globally recognized analytical lab plays a pivotal role in affirming our technology's broad applications, which are validated by leaders in the expansive $630 billion nutraceutical domain and extend to medical foods, animal nutrition, and skincare. At Disruption Labs, 'disruption' isn't just in our name—it's our foundational philosophy pushing the boundaries of the possible, creating opportunities for our partners to lead and excel in their industries."
    },
    {
        "title": "Natoli Engineering Company, Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/120423/natoli-engineering-company-inc",
        "url": null,
        "linkedin": null,
        "description": "Natoli Engineering Company, long recognized as the global leader in tablet compression tooling manufacturing, was founded on the uncompromising principle to provide the highest quality tablet compression tooling, presses, and replacement parts at a fair price with exceptional customer service. Fulfilling that promise, Natoli has been at the forefront of the tablet compression industry for more than 40 years. Natoli has recently introduced the AIM™ software platform for research and development tablet presses. And, through its Carlisle Precision Encapsulation Parts subsidiary, Natoli now manufactures encapsulation tooling and replacement parts for many brands of encapsulation machines.\n\nMajor Products/Services\n\nTablet Compression Tooling\nTablet Presses\nTablet Press Replacement Parts\nTablet Compression Accessories\nTechnical Training\nTablet & Tooling Design\nAIM Software R&D tablet presses\nFormulation Testing & Analysis\nEncapsulation Tooling & Replacement Parts\nSupport & Troubleshooting"
    },
    {
        "title": "Charles Ross & Son Co",
        "internal_link": "https://www.mjbizdirectory.com/company/120837/charles-ross-son-co",
        "url": null,
        "linkedin": null,
        "description": "Ross serves the requirements of the sanitary process industries, in virtually every industrialized country around the world. We have the experience and production capacity that no other manufacturer of specialty mixing and blending equipment can match."
    },
    {
        "title": "Statco DSI",
        "internal_link": "https://www.mjbizdirectory.com/company/128234/statco-dsi",
        "url": null,
        "linkedin": null,
        "description": "Statco-DSI offers complete design, installation, start up assistance, specialty components and spare parts for: Raw ingredient receiving and storage systems, batch and blend systems, continuous blending systems, brewing process units, automated control systems, thermal process (pasteurization) systems, surge and storage tank systems for both standard and aseptic systems, fillers and cappers for standard, hot fill, ESL, and aseptic processing systems. We have 11 offices nationwide, for contact info see http://www.statco-dsi.com/Locations.html"
    },
    {
        "title": "Circona Labs",
        "internal_link": "https://www.mjbizdirectory.com/company/927812/circona-labs",
        "url": null,
        "linkedin": null,
        "description": "At Cirona Labs, we're pioneers in the field, crafting water-soluble cannabinoid ingredients tailor-made for integration into a diverse array of products, including beverages, tinctures, topicals, and edibles. Our foundation is deeply rooted in nature, yet our processes and products are meticulously refined through the cutting-edge application of science. With a legacy built on over 100 years of collective experience in product development for major CPG and cannabis entities, our cGMP-certified lab, nestled in the heart of upstate New York at Cornell University's Technology Farm, stands as a testament to our commitment to excellence. Leveraging a strategic formulation approach, our R\\&D capabilities stretch across an impressive library of over 900 ingredients, ensuring a holistic, data-driven match between our premium bulk water-soluble liquids, emulsions, spray-dried powders, and the unique needs of your product. At Cirona Labs, we're not just raising the bar for functional ingredients; we're redefining it, ensuring every partner benefits from a seamless blend of innovation, quality, and market-leading expertise."
    },
    {
        "title": "Tundra Restaurant Supply",
        "internal_link": "https://www.mjbizdirectory.com/company/811789/tundra-restaurant-supply",
        "url": null,
        "linkedin": null,
        "description": "At Tundra Restaurant Supply, we're your ultimate one-stop shop for all supplies, equipment, parts, and smallwares, catering to the diverse needs of the bustling retail and restaurant industry. Our extensive inventory ensures you have access to a wide range of high-quality products, all available at competitive wholesale prices. With our commitment to fast shipping, we guarantee that your essential tools and supplies will arrive when you need them, keeping your operations running smoothly without a hitch. From the front of the house to the back, our selection covers every aspect of your needs."
    },
    {
        "title": "TechniBlend Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/927810/techniblend-inc",
        "url": null,
        "linkedin": null,
        "description": "At TechniBlend, we engineer cutting-edge liquid blending and beverage processing technologies designed to meet the exacting needs of the modern beverage, liquid food, personal care, home consumer, and chemical facility industries. Our expertise spans a comprehensive range of services, from turnkey integration and retro-fit projects to production line design and advanced control panel systems, ensuring each client's project benefits from a seamless end-to-end process. Our innovative solutions include the revolutionary ProCarb Inline Carbonation Systems and ProFill can filling systems, specifically developed to enhance production efficiency, product quality, and operational reliability. Through our state-of-the-art deaeration, pasteurization, and Clean-In-Place (CIP) systems, we're committed to optimizing production workflows while reducing costs and minimizing environmental impact. As leaders in beverage processing technology, our goal is to help beverage producers around the world serve their markets with unparalleled precision, efficiency, and quality."
    },
    {
        "title": "Action PAC Scales & Automation",
        "internal_link": "https://www.mjbizdirectory.com/company/927804/action-pac-scales-automation",
        "url": null,
        "linkedin": null,
        "description": "At ActionPac Scales & Automation, we've harnessed over 45 years of expertise to engineer the world's most efficient automated packaging equipment right here in the USA. As a second-generation, family-owned enterprise, we have a deep commitment to innovation, crafting custom solutions for industries ranging from cannabis to coffee, food, and more. Our turnkey solutions and modular systems are designed to seamlessly integrate into existing operations, supported by a lifetime of free consulting services to ensure optimal performance. We're not just about selling machines; we're about starting conversations, learning about your goals, and tailoring our technology to free your operations from limitations. Our responsive, field-engineered service ensures that, from installation to lifelong support, we're here to elevate your production and profits while lowering headaches."
    },
    {
        "title": "tna solutions",
        "internal_link": "https://www.mjbizdirectory.com/company/776579/tna-solutions",
        "url": null,
        "linkedin": null,
        "description": "tna is a leading global supplier of integrated food processing and packaging solutions with over 14,000 systems installed across more than 120 countries. The company provides a comprehensive range of products including materials handling, processing, cooling and freezing, coating, distribution, seasoning, weighing, packaging, inserting and labelling, metal detection and verification solutions. tna also offers a variety of production line controls integration & SCADA reporting options, project management and training. tna’s unique combination of innovative technologies, extensive project management experience and 24/7 global support ensures customers achieve faster, more reliable and flexible food products at the lowest cost of ownership."
    },
    {
        "title": "SMB Machinery Systems, LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/565288/smb-machinery-systems-llc",
        "url": null,
        "linkedin": null,
        "description": "SMB Machinery saves manufactures time & money with proven equipment & best-in-class automation and service solutions.\n\nServices and Capabilities:\nMachinery rebuilding, refurbishment, overhaul, modifications, upgrades, change parts.\nElectrical upgrades and modifications, UL listed panels.\nEquipment removal, installation, storage and relocation.\nCertified appraisal services for plants and equipment.\nPlant liquidation, dismantling, demolition and remediation.\n\nWe look forward to earning your business!!"
    },
    {
        "title": "EndFlex",
        "internal_link": "https://www.mjbizdirectory.com/company/927802/endflex",
        "url": null,
        "linkedin": null,
        "description": "At EndFlex, we are proud pioneers in providing versatile and robust end-of-line packaging solutions that adapt to our diverse clientele's needs. With more than 20 years of innovation, our portfolio boasts a full spectrum of machinery, including case erecting, tray forming, case packing, and robotic palletizing technologies. Each piece of equipment we design and manufacture is constructed with the end-user in mind, ensuring ease of use, reliability, and long-term serviceability. Leveraging our expertise, we have revolutionized packaging lines across various industries, delivering over 6,000 successful installations worldwide. Join us at EndFlex, where your packaging challenges are met with our cutting-edge automation and dedicated support, solidifying your company's future in efficient and effective end-of-line packaging."
    },
    {
        "title": "Nitrotin",
        "internal_link": "https://www.mjbizdirectory.com/company/927801/nitrotin",
        "url": null,
        "linkedin": null,
        "description": "At Nitrotin, we elevate cannabis packaging to an art form, focusing on preserving the freshness and quality of cannabis naturally over time. By implementing the science of nitrogen packaging, borrowed from the food industry, we ensure that oxygen is pushed out and precious cannabis remains sealed in premium-grade cans. Our fully automated, CSA-approved production line is not just about efficiency; it's designed to uphold product integrity, making every can we produce a testament to sustainability with 100% recyclable materials. When you choose Nitrotin, you're not just packaging your product; you're guaranteeing an unmatched experience for your consumers, where every opening is a fresh encounter with your brand. Dedicated to both preservation and environmental sustainability, we're setting new standards in cannabis packaging, ensuring your products are stored and transported safely, with a shelf life extended from months to years, ready to meet the market with confidence."
    },
    {
        "title": "Paxiom Group",
        "internal_link": "https://www.mjbizdirectory.com/company/927799/paxiom-group",
        "url": null,
        "linkedin": null,
        "description": "At Paxiom Group, we take pride in revolutionizing the automated packaging machine industry by offering turn-key solutions that cater to a diverse range of sectors, including food, pharmaceuticals, and cannabis. Our passion lies in engineering state-of-the-art machinery for filling, bagging, wrapping, cartoning, and palletizing designed to elevate efficiency and productivity in our clients' operations. With over 30 years in the business, our unwavering dedication to innovation and quality has positioned us as a leading provider of packaging machinery worldwide. Our Vegas Xperience Center showcases the latest industry advancements, providing clients with an immersive look into the potential of our automated systems. We're not just about machines; we're about crafting tailor-made packaging experiences that empower businesses to achieve their full potential."
    },
    {
        "title": "Rocky Mountain Extraction Services",
        "internal_link": "https://www.mjbizdirectory.com/company/927790/rocky-mountain-extraction-services",
        "url": null,
        "linkedin": null,
        "description": "At Rocky Mountain Extraction Services LLC, we are defined by our unwavering commitment to quality, safety, and environmental responsibility in the production of premium CBD extracts, distillates, and isolates. Nestled in the heart of Northern Colorado, our state-of-the-art facility operates under the highest standards, utilizing solvent-free CO2 extraction methods and meticulous process controls to deliver products that meet the rigorous demands of ISO 9001, cGMP, and organic processing. With a full suite of extraction and finishing services, we cater to B2B customers, offering full traceability and transparency—from farm to final product—to ensure the utmost confidence in our bulk ingredients and blended products. Our expertise in process control and manufacturing is complemented by a CO2 extraction process that’s not only eco-friendly but also ensures the highest purity and potency for our CBD oil and distillates. At RMES, our passion is to empower industry innovators by providing an integrated supply chain solution that encompasses extraction, formulation, and even packaging services, all while prioritizing the health and safety of our customers and the environment."
    },
    {
        "title": "Helderpad",
        "internal_link": "https://www.mjbizdirectory.com/company/927788/helderpad",
        "url": null,
        "linkedin": null,
        "description": "At Helderpad, we pride ourselves on being at the cutting edge of continuous extraction, solvent recovery, and short path distillation equipment, catering to both laboratory and industrial-scale botanical and chemical processing. Our focus is on the design, manufacturing, and distribution of high-quality equipment that meets the specific demands of our clients, ensuring efficiency and reliability in every process. From ethanol extraction and solvent recovery to the pinnacle of purity achieved through short path distillation, our solutions are engineered for excellence. Our team is ready to assist you in reaching your processing goals, offering expert advice and support that is just a call away. Join the Helderpad community and elevate your botanical and chemical processing capabilities to the next level."
    },
    {
        "title": "B/R Instrument",
        "internal_link": "https://www.mjbizdirectory.com/company/927787/b-r-instrument",
        "url": null,
        "linkedin": null,
        "description": "At BR Instrument, we've been at the forefront of lab-scale distillation technology since 1966, specializing in high-efficiency fractional distillation equipment for a diverse range of applications, from solvent recycling to the precision art of creating THC and CBD distillate from crude cannabis extract. Our equipment is engineered for laboratories aiming to achieve unparalleled purity levels in their products, whether that's through the distillation of cannabis oil at impressive rates of 6-8 liters per hour or the meticulous refining of crude oil and petroleum products. Recognizing the growing need for efficient solvent recycling, our solutions help laboratories across sectors, including histology and chromatography, significantly cut down on solvent purchase and disposal costs. Our product lineup, including fully automatic, semi-automatic, and manually operated models, is designed to cater to the specific requirements of our clients, ensuring every distillation process is as productive as it can be. It’s this dedication to innovation, efficiency, and client support that makes BR Instrument a trusted partner in laboratory distillation, constantly expanding the possibilities of what our high-efficiency fractional distillation equipment can achieve."
    },
    {
        "title": "Eden Labs",
        "internal_link": "https://www.mjbizdirectory.com/company/927786/eden-labs",
        "url": null,
        "linkedin": null,
        "description": "At Eden Labs, we've dedicated over 25 years to pioneering extraction technology, ensuring our partners in the botanicals sector thrive through innovation and market-leading product development. Our mastery in CO2 and Cold Ethanol Extraction Systems isn't just about the technology; it's about building a sustainable future and fostering the success of our clients' visions, from concept to market. Grounded in a culture of R\\&D, we empower our clients with the efficiency of our systems—designed for fast runs and high yields—and the expertise of our team, able to aid in everything from Proof of Concept to Toll Processing. Our clients, ranging from industry startups to seasoned operators, value our equipment for its ability to produce the cleanest, safest extracts, pivotal for creating superior medicinal and cosmetic products. At Eden Labs, your vision for new products, ingredients, or processes becomes a successful reality, thanks to our unmatched service, reliability, and commitment to clean extraction for the health of the world."
    },
    {
        "title": "High Purity Extractions & Equipment",
        "internal_link": "https://www.mjbizdirectory.com/company/927785/high-purity-extractions-equipment",
        "url": null,
        "linkedin": null,
        "description": "At High Purity Extractions, we serve as the beacon of expertise and innovation for the hemp and cannabis industry, providing comprehensive consulting, equipment sales, and contract extraction services. Our years of operational experience equip us with the unique ability to scale your business efficiently, helping you navigate through the complexities of lab design, operations, and product development without falling into common costly pitfalls. We pride ourselves on our state-of-the-art facility where we deliver a plethora of biomass extraction processes, tailored to meet your specific project goals and quality expectations. Recognizing the dynamic needs of extraction laboratories, we offer specialized temporary staffing services, ensuring your lab's productivity never skips a beat by supplementing your team with our experienced and proficient professionals. With our commitment to excellence, High Purity Extractions is your trusted partner, dedicated to propelling your cannabis and hemp operations to new heights with our unparalleled consulting insights, cutting-edge equipment, and unwavering support."
    },
    {
        "title": "BioXtra Labs Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/927784/bioxtra-labs-inc",
        "url": null,
        "linkedin": null,
        "description": "At BioXtra Labs, we specialize in delivering top-tier cannabis processing solutions, ranging from extraction to distillation, tailored for both laboratory and industrial scale producers. Founded by a group of dedicated specialists in Canada, we pride ourselves on our expertise and rich hands-on experience in the botanical field, offering end-to-end processing technologies that ensure the highest quality oil from plant-based biomass. Our commitment extends beyond sales, aiming to provide unparalleled technical support and customer service, including professional advice on system design, on-site equipment installation, and comprehensive training on extraction methods. With our manufacturing site in Shanghai specializing in the design and fabrication of professional wipe film molecular distillation equipment, we're recognized for our capability to offer cost-effective and high-quality tools to our clients. As we look forward to introducing softgel and capsule machines in 2024, BioXtra Labs continues to be a pioneer in innovative processing solutions, dedicated to supporting our growing client base in North America and beyond."
    },
    {
        "title": "Zoom Technologies",
        "internal_link": "https://www.mjbizdirectory.com/company/913253/zoom-technologies",
        "url": null,
        "linkedin": null,
        "description": "In 2012 we launched Zoom Technologies and were the first double barrel cannabis trimmer on the market. Our focus is delivering high performance, high quality trimming machines to reduce labor cost for the large-scale growers and processors.\n\nOver the years, we have invested in research & development and taken our customers suggestions into our newest design. That is how we came up with our most recent model of the Zoom Pro trimming machine.\n\nIn 2020, we brought our manufacturing back to the states. We design, test, and build our equipment proudly in the USA with the highest quality components and workmanship. This allows us to respond to parts and services requests quickly.\n\nAt Zoom Technologies, we believe automation can be a friend and being efficient is important for improving productivity and reducing cost. We will remain true to our dedication in providing the best products and the best services as we expand our reach for commercial growers."
    },
    {
        "title": "Apeks Supercritical",
        "internal_link": "https://www.mjbizdirectory.com/company/927713/apeks-supercritical",
        "url": null,
        "linkedin": null,
        "description": "Hemp Processing Machine & Equipment\nThe Fleet®\nApeks Supercritical manufactures systems to suit the start-up entrepreneurs, to those in the full swing of production at a large scale facility. Our systems can process anywhere from 10 pounds of dried botanical material per day, to 200 pounds per day with the Force®. You can even expand to 600 pounds using our Fleet® platform!"
    },
    {
        "title": "Coyote Cannabis",
        "internal_link": "https://www.mjbizdirectory.com/company/927712/coyote-cannabis",
        "url": null,
        "linkedin": null,
        "description": "Tier 1 Cultivation and Product Manufacturing specializing in Hash Rosin. Our mission is to operate an adult-use cannabis cultivation and manufacturing business that creates the highest quality solventless cannabis concentrates while serving as a model to regulatory authorities and a trusted employer within Uxbridge, MA. Our craft hash rosin is processed with respect for the cannabis plant and its benefits without over-purifying through solvents or other chemical processes."
    },
    {
        "title": "Valedna Vape",
        "internal_link": "https://www.mjbizdirectory.com/company/927640/valedna-vape",
        "url": null,
        "linkedin": null,
        "description": "Shenzhen Qianying Technology Co., Ltd. is a Chinese vape manufacturer, and Valedna is our newly developed natural tobacco-extracted vape. We manufacture electronic cigarettes and Cannabis CBD/THC vape devices. Products include disposable and refillable E-cigarettes, disposable Cannabis CBD/THC devices, and cartridge vapes. Our Vape is disposable and rechargeable."
    },
    {
        "title": "Liquid Filling Solutions",
        "internal_link": "https://www.mjbizdirectory.com/company/927639/liquid-filling-solutions",
        "url": null,
        "linkedin": null,
        "description": "Liquid Filling Solutions offers a wide range of filling options for almost any type of liquid product including dedicated division for the production of E-liquids. Our team can offer full turnkey solutions or customized toll packaging to suit your project. In addition, we can assist in formulation development, packaging decisions and label creation. Our goal is to leverage our experience and resources to help you bring your product to market with the greatest success."
    },
    {
        "title": "Daily Manufacturing",
        "internal_link": "https://www.mjbizdirectory.com/company/927638/daily-manufacturing",
        "url": null,
        "linkedin": null,
        "description": "Partner with an Experienced White Label E-Liquid & Contract Manufacturer. With more than 20 years of industry experience and go to market expertise, Daily Manufacturing has set itself apart as a leader in helping businesses develop, create, and package products in the personal care, cosmetic, and health & wellness space. Our passionate team is committed to creating and delivering the highest-grade products possible without compromising on ingredients, packaging, or production techniques. We are an FDA-registered business with a state-of-the-art processing facility adhering to Good Manufacturing Practices and ISO 9001:2015."
    },
    {
        "title": "Fiftyshot Unite Vapeware",
        "internal_link": "https://www.mjbizdirectory.com/company/913529/fiftyshot-unite-vapeware",
        "url": null,
        "linkedin": null,
        "description": "FiftyShot, specializes in innovative cannabis vape cartridge filling solutions, known for their accuracy, efficiency, and reliability. FiftyShot has partnered with AVEO Vapor Devices as the master distributor. This partnership, along with our local print shop, amplifies our capacity to serve a diverse market, from small-scale artisans to large-scale producers, underpinning our commitment to quality and customer service. AVEO leads in cannabis innovation and technology, continuously seeking to improve industry standards. Our team's approach is solution-oriented, addressing customer frustrations in the vape cartridge market. AVEO's devices are designed for efficiency, durability, and environmental sustainability, setting new benchmarks in low-impact technology."
    },
    {
        "title": "Budtank Vape",
        "internal_link": "https://www.mjbizdirectory.com/company/918375/budtank-vape",
        "url": null,
        "linkedin": null,
        "description": "Budtank vape pen manufacturer strong foundation starts with research & development originating in California, United States along with oversee production centers. Our vertically integrated manufacturing and engineering allow us to be the leading force behind the vape industry through strong partnerships with our licensed professional brands. Buddy has highest-standard production facilities (ISO13485, GMP certificates), a RoHS lab was founded by Buddy. All products conform to heavy metal tests standard, certificated and highly recommended by US authoritative laboratories.\n\nBuddy is the inventor ofthe first CBD/THC cartridge with the cumulative shipments over two billion pieces.\nBuddy holds 47 Domestic and International Patents for Invention, and over 400 Patents for Utility Models and and Appearance Design."
    },
    {
        "title": "Kingdom Vapor Wholesale",
        "internal_link": "https://www.mjbizdirectory.com/company/927637/kingdom-vapor-wholesale",
        "url": null,
        "linkedin": null,
        "description": "Kingdom Vapor Wholesale supplies the hottest vaping products on the market including E Cigarette, Mods, E-Liquid and other vape supplies. Join the Kingdom Vapor Family today, whether you are interested in opening a vapor shop or you’re looking for a stateside electronic cigarette wholesale supplier, we’re the right one for you."
    },
    {
        "title": "Pulsar Vaporizers",
        "internal_link": "https://www.mjbizdirectory.com/company/915457/pulsar-vaporizers",
        "url": null,
        "linkedin": null,
        "description": "Pulsar® has always been at the forefront of the vaping industry. We’ve designed and developed many quality products for the modern day smoker to #EnjoyHigherCulture in their everyday life. We now house over 1000 different products at our facilities in the vibrant and creative city of Asheville, NC. Though we are most recognized and respected for our APX Family line of vapes, we also offer other vaporizers, water pipes, rolling trays, e-nails, dabbers, bubblers, silicone products. If you are a wholesaler or retailer, please get in touch with us to find out more about our wholesale rates."
    },
    {
        "title": "Cloud V",
        "internal_link": "https://www.mjbizdirectory.com/company/927635/cloud-v",
        "url": null,
        "linkedin": null,
        "description": "Since 2012, CloudV has continued to innovate and change its product line to offer the best electronic diffusers on the planet. We hold a number of issued patents as well as number of pending patents on our products. Our diffusers could work with essential oils, vitamins and more! None of the products are preloaded. Explore our wholesale purchasing program."
    },
    {
        "title": "Storz & Bickel",
        "internal_link": "https://www.mjbizdirectory.com/company/927634/storz-bickel",
        "url": null,
        "linkedin": null,
        "description": "STORZ & BICKEL is the worldwide unattained leading brand for certified Vaporizers for a combustion free inhalation of dry herbs. With our commitment to quality, innovation, and compliance, we build outstanding functionality based on cutting-edge technology – Made in Germany."
    },
    {
        "title": "Prizecor",
        "internal_link": "https://www.mjbizdirectory.com/company/915362/prizecor",
        "url": null,
        "linkedin": null,
        "description": "Prizecor Wholesale distributes smoking accessories for smoke shops, dispensaries, headshops, vape stores, gas stations, and convenience stores. We offer vaporizers, smoking paper, water pipes, bongs, and more."
    },
    {
        "title": "MJ Wholesale",
        "internal_link": "https://www.mjbizdirectory.com/company/927633/mj-wholesale",
        "url": null,
        "linkedin": null,
        "description": "We are a full-turnkey marijuana dispensary packaging fulfillment company on the national level. We also offer secondary contract packaging, contract filling, double blind drop shipping and fulfillment services for vape shops, head shops and medical marijuana dispensaries. Having a national footprint of packaging facilities, MJ Wholesale has built a reputation for managing all dispensary needs from the root to the fruit! With over 25 years of business experience and handling over tens of thousands of clients, we have been known to be the primary source for packaging or custom dispensary needs."
    },
    {
        "title": "True Wholesale",
        "internal_link": "https://www.mjbizdirectory.com/company/927632/true-wholesale",
        "url": null,
        "linkedin": null,
        "description": "True Wholesale is a wholesale distributor of different variants of vaporizers, grinders, vaporizers parts, and accessories. We also offer the provision of dispensary wholesale and believe that vaping shouldn’t be an exorbitant affair. Hence, we provide the best vaping products at cost-effective prices. We strive to provide an online store that is well-equipped with authentic and original vaporizers from reputed brands.\n\nTrue Wholesale distributes products from PAX, Arizer, Storz & Bickel, HoneyStick, KandyPens, Santa Cruz Shredder, and many more. Our online list of products comprises of not only vapes but also vape parts, inclusive of cartridge vapes & batteries, atomizers, along with other relevant accessories such as silicone pipes, cleaners, rolling papers, grinders, Beakers, and E-Rig & E-Nail.\n\nTrue Wholesale also offers drop shipping services. We are committed to providing vape wholesales to our customers. All this and more makes us a one-stop shop that strives to provide everything you expect from your vape shop."
    },
    {
        "title": "The Kind Pen",
        "internal_link": "https://www.mjbizdirectory.com/company/927631/the-kind-pen",
        "url": null,
        "linkedin": null,
        "description": "The Kind Pen is a New Jersey-based company that has quickly become one of the worlds most trusted brands in the vaporizer industry. Kind Pen vaporizers are innovative and offer an effective, cutting edge, delivery system. Explore our vaporizers, parts, and accessories."
    },
    {
        "title": "CCELL",
        "internal_link": "https://www.mjbizdirectory.com/company/912731/ccell",
        "url": null,
        "linkedin": null,
        "description": "CCELL is a global innovator and pioneer in the vaporizer space that is dedicated to advancing R&D resources, strengthening production capability and designing a reliable quality control system. Having successfully upgraded the industrial standard of vaporizing technology, CCELL has become a byword for the safest and best vaporizers in the market."
    },
    {
        "title": "3WIN CORP",
        "internal_link": "https://www.mjbizdirectory.com/company/913351/3win-corp",
        "url": null,
        "linkedin": null,
        "description": "We provide brands, research labs, and extraction facilities with high-quality CCELL vaping products, customized vaping products, and customized packaging.For years, the cannabis industry has been overrun with cheap vaping products, which results in poor user experience and costly performance issues for many companies. 3Win Corp has redefined the cannabis and CBD industry with the highest quality and performance of vape products to date. 3Win Corp is an official wholesale distributor of CCELL, which is the leading vape technology company with patented ceramic formulas, a special manufacturing process of high-temperature sintering, and quality vaporizer products. Authentic CCELL ceramic heating elements are designed to deliver pure flavor, high vaporizing efficiency, even heat distribution, consistency, and large vapor volume with powerful potency."
    },
    {
        "title": "Vape Wholesale USA",
        "internal_link": "https://www.mjbizdirectory.com/company/927629/vape-wholesale-usa",
        "url": null,
        "linkedin": null,
        "description": "Our vast selection of wholesale vape supplies include top-quality vape devices such as disposable vapes and electronic cigarettes, e-liquids, nicotine salts, coils, tanks, batteries, and accessories from the most popular brands in the industry. We pride ourselves on our extensive product knowledge and our ability to provide exceptional customer service to our clients. Feel free to easily reach one of our wonderful reps with your questions and inquiries through our newly integrated online live chat support system."
    },
    {
        "title": "Coastal Vape Co",
        "internal_link": "https://www.mjbizdirectory.com/company/912765/coastal-vape-co",
        "url": null,
        "linkedin": null,
        "description": "Coastal Vape Co (CVC) makes the best custom thc and cbd distillate hardware and packaging in the cannabis market today. We do OEM and ODM projects for all brands. Our carts have less than 1% fail rate and our prices are better than CCELL. Our carts have amazing taste and make big vape clouds."
    },
    {
        "title": "Encore Labs",
        "internal_link": "https://www.mjbizdirectory.com/company/927614/encore-labs",
        "url": null,
        "linkedin": null,
        "description": "Encore Labs is a state-of-the-art testing laboratory that delivers quality laboratory cannabis testing to ensure accurate potency and safe product driven analysis from our Southern California compliant testing facility. We offer comprehensive analysis to assist cultivators, infused product manufacturers, providers and dispensaries not only for regulatory purposes but also to characterize the unique aspects of cannabis. Encore Labs Seeks to provide quality testing, service and analysis while educating the marketplace; helping people one test at a time."
    },
    {
        "title": "Prodigy Processing Solutions",
        "internal_link": "https://www.mjbizdirectory.com/company/921938/prodigy-processing-solutions",
        "url": null,
        "linkedin": null,
        "description": "Prodigy Processing Solutions engineers and manufactures the world's most advanced cannabis extraction equipment with proprietary technology. Headquartered in Florida with manufacturing in Ohio, Prodigy continues to push the boundaries of innovation in the industry. For more information, visit our website or give us a call"
    },
    {
        "title": "Grow Higher",
        "internal_link": "https://www.mjbizdirectory.com/company/924890/grow-higher",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "GVS Life Sciences",
        "internal_link": "https://www.mjbizdirectory.com/company/805827/gvs-life-sciences",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Pope Scientific Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/119161/pope-scientific-inc",
        "url": null,
        "linkedin": null,
        "description": "Equipment and technology for distillation equipment, wiped film short path molecular stills and evaporators, batch and continuous fractional stills. reactors, vessels, turnkey processing systems nutsche filter dryers. Offering contract toll processing, pilot scale process development and lab feasibility services for distillation"
    },
    {
        "title": "HEMCO Corporation",
        "internal_link": "https://www.mjbizdirectory.com/company/351032/hemco-corporation",
        "url": null,
        "linkedin": null,
        "description": "HEMCO is the leading manufacturer of innovative laboratory equipment serving the Sciences and R&D Technology Industries since 1958. Located in Independence, Missouri, the heart of America, and the crossroads of North America a major center for transportation, communication, distribution, and manufacturing industries worldwide.\nMost extensive line of Laboratory Fume Hoods in the industry. SE AirStream, LE, CE, Walk-In, Dual Entry, Auxiliary Aire, Perchloric Acid, PVC Acid Digestion, Trace Metals, Radioisotope, UniMax, EnviroMax, Canopy hoods, Modular Clean Labs, Casework, Work surfaces, Safety Showers, Eye/face wash, safety equipment, ventilation equipment, Lab Planning Solutions."
    },
    {
        "title": "GrowGreen Machines LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/924453/growgreen-machines-llc",
        "url": null,
        "linkedin": null,
        "description": "GrowGreen Machines is an online retailer of cannabis processing equipment, offering equipment needed in seed to sale operations. GrowGreen Machines carries grow lights, hydroponic systems, trimmers, pre-roll machines, THC potency testing machines, rosin presses, environmental controls, extraction equipment and more. We cater to cultivators, dispensaries, cannabis entrepreneurs, laboratories, and commercial facilities.\n\nGrowGreen Machines was founded in 2023 and is based out of central Ohio."
    },
    {
        "title": "Verder Scientific Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/913188/verder-scientific-inc",
        "url": null,
        "linkedin": null,
        "description": "As the cannabis industry continues to grow, laws & regulations continue to evolve in order to ensure the quality of the product meets the standards for safety & labeling. Drying, grinding & particle size analysis are all an important part of the cannabis testing processes and Verder Scientific offers high quality, efficient solutions for your laboratory.\n\nAdvanced products need a competent partner in the background. Verder Scientific with its 5 brands is just this partner for countless laboratories, manufacturers and scientific research institutions worldwide. For decades, our manufacturing companies have been providing solutions for individual customer requirements by developing sophisticated, precise, and reliable laboratory equipment for sample preparation, heat treatment and analysis in quality and process control.\n\nThese solutions enable our customers to make progress. We provide them with the means to effectively and reliably design their processes, products, and services to become safer, more efficient, and more sustainable. Together, we make the world a healthier and safer place."
    },
    {
        "title": "HiJolly Manufacturing",
        "internal_link": "https://www.mjbizdirectory.com/company/922993/hijolly-manufacturing",
        "url": null,
        "linkedin": null,
        "description": "HiJolly Manufacturing is Arizona’s largest cannabis manufacturing facility located in the heart of the Southwest.\n\nHiJolly.com\n\nOur state-of-the-art facility offers turn-key solutions, blending culinary artistry with cutting-edge automation to create an exquisite range of cannabis-infused goods, from gourmet chocolates to savory snacks. Whether it’s creating a new product from scratch or expanding your brand with our in-house automation line, our team is dedicated to crafting delicious and innovative results tailored to your needs.\n\nServices offered:\n-Gummy production (pectin, sugar-free, and gelatin)\n-Chocolate (bars & enrobed goods)\n-Preroll production (.25g - 1.0g, standard and infused)\n-Automated flower packing (jars & bags)\n-Delivery & logistics\n-Formulation"
    },
    {
        "title": "Growvera",
        "internal_link": "https://www.mjbizdirectory.com/company/913330/growvera",
        "url": null,
        "linkedin": null,
        "description": "Growing good cannabis isn’t enough if you lose your hard work in the dry. The drying process brings immense risks that warrant exhaustive attention. Mold, reduced yield, and loss of aromatic and flavor qualities can ruin your product and destroy your profits. Good cannabis becomes great through drying done right.\n\nEnter Growvera. Through the remote measurement of moisture via our exclusive, patent-pending on-plant sensor technology, we offer actionable drying insights to help you understand your dries like never before. Don’t let your cannabis fall short at the finish line. Connect with Growvera today to discuss how we can optimize your operation and help you ensure your cannabis is a cut above the rest."
    },
    {
        "title": "Australis Capital",
        "internal_link": "https://www.mjbizdirectory.com/company/913118/australis-capital",
        "url": null,
        "linkedin": null,
        "description": "AUSA Corp. is building American cannabis brands across North America. Find out how you can invest in our cannabis brands."
    },
    {
        "title": "Schold Manufacturing",
        "internal_link": "https://www.mjbizdirectory.com/company/915519/schold-manufacturing",
        "url": null,
        "linkedin": null,
        "description": "Schold offers laboratory and bench-top dispersers, mixers, and mills that are the ideal for cannabis manufacturers and researchers. Whether you're blending precise formulations for concentrates, refining extraction processes, or creating consistent and homogeneous mixtures for edibles and topicals, our equipment delivers unmatched precision and reliability.\n\nIn an industry where product consistency and quality are paramount, Schold's solutions empower you to achieve the exacting standards your customers demand. Our state-of-the-art technology ensures that every batch is perfectly homogenized, thoroughly mixed, and finely dispersed, allowing you to maximize the potential of your cannabis extracts and products.\n\nChoose Schold to elevate your cannabis production to new heights, ensuring the highest quality, potency, and reliability in your products.\n\n1-800-4MIXERS\nschold@schold.com\nschold.com"
    },
    {
        "title": "Imbucanna Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/912935/imbucanna-inc",
        "url": null,
        "linkedin": null,
        "description": "Imbucanna Inc. stands at the forefront of cannabis and dietary supplements manufacturing, specializing in solid dose products like mints, tablets, and powders. Founded in 2019, our commitment to quality and innovation drives us to offer custom formulations and white label products within our FDA-registered, GMP-certified facility. We cater to businesses seeking economical yet premium ingredients, ensuring precise dosing and consumer safety through rigorous in-house testing and patent-pending granulation processes. By providing raw materials and full-scale manufacturing solutions, we empower companies to expand their product lines and meet market demands with confidence. Partner with Imbucanna to elevate your brand with top-tier hemp-derived and cannabinoid products."
    },
    {
        "title": "Circul-Aire Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/770449/circul-aire-inc",
        "url": null,
        "linkedin": null,
        "description": "Circul-Aire's MULTI-MIX gas-phase chemical filter media and integrated air handling systems are used to reduce the odor and corrosion potential of commercial, institutional, sewage treatment and industrial environments. Circul-aire systems are engineered and manufactured to withstand the most severe industrial environments, including those containing corrosive gases. Applications are custom designed according to each client's unique requirements."
    },
    {
        "title": "Cannapresso",
        "internal_link": "https://www.mjbizdirectory.com/company/922107/cannapresso",
        "url": null,
        "linkedin": null,
        "description": "Founded in California in 2017, Cannapresso brings its disruptive AiMesh@ atomization technology to the cannabis CBD vaping industry, which adheres to Current Good Manufacturing Practices(cGMP), to ensure the final products are safe, reliable, and of top quality.\nCannapresso offers end-to-end delta 8 solution which contains design, filling, and co-packing. With advanced R&D resources, strong production capability, and reliable quality control systems, Cannapresso can meet the different needs in the cannabis industry."
    },
    {
        "title": "VAC-U-MAX",
        "internal_link": "https://www.mjbizdirectory.com/company/282839/vac-u-max",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Detroit Dispensing Solutions",
        "internal_link": "https://www.mjbizdirectory.com/company/912855/detroit-dispensing-solutions",
        "url": null,
        "linkedin": null,
        "description": "Today’s technological innovation is powered by engineering progress and transformative creativity, but it is defined by something far simpler…to make life easier. At Detroit Dispensing Solutions, we strive to create a more efficient, streamlined, and convenient dispensing solution for our clients. We understand the importance of quality and ease of use and we apply that knowledge to the development of our machines.\n\nWith more than ten years of designing and engineering production equipment, Detroit Dispensing Solutions is inspired by the desire to build a better machine, through a combination of innovative products, expert advice, and customer feedback."
    },
    {
        "title": "Azuca",
        "internal_link": "https://www.mjbizdirectory.com/company/912963/azuca",
        "url": null,
        "linkedin": null,
        "description": "AZUCA'S TiME INFUSION® changes everything you thought you knew about edibles.\n\nTraditional oil-based edibles are processed by the liver, making it impossible, due to variabilities in liver function, to have a predictable experience. TiME INFUSION® creates a unique thermodynamic matrix of individually encapsulated cannabinoid molecules, resulting in a hydrophilic, or water-friendly ingredient. This hydrophilic technology bypasses that lengthy trip through the liver, and instead absorbs directly into the soft tissues of the mouth, esophagus, and stomach to reach your endocannabinoid receptors quickly and efficiently. This allows these high-quality cannabinoids to take effect in a groundbreaking, consistent, and predictable five to fifteen minutes."
    },
    {
        "title": "Leybold USA Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/913016/leybold-usa-inc",
        "url": null,
        "linkedin": null,
        "description": "For over 170 years Leybold designs and manufactures pumps and complete systems, both standardized or tailor-made: as you need! We also carry all related accessories and will support you with services when necessary."
    },
    {
        "title": "Cann Drying Systems LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/913520/cann-drying-systems-llc",
        "url": null,
        "linkedin": null,
        "description": "Cann Drying Systems was founded specifically to develop drying and curing equipment for the legal Cannabis and Hemp industries. Designed for the largest in the world to relatively small grows, we specialize in providing our customers with all of the necessary equipment to optimize their existing drying rooms or equip a new facility from scratch.\n\nWe are a subsidiary of Nyle Systems, a U.S. manufacturing company in Brewer, Maine, with a 40+ year track record of building drying equipment focused on three core markets; Lumber Drying, Food Drying, and Heat Pump Water Heating. At its core is a deep understanding of Heat Pumps and Dehumidifiers, which has been translated into a distinctive leadership position for Cann Drying Systems in the Cannabis and Hemp markets.\n\nOur headquarters are located in a 56,000 sq ft facility in Brewer, Maine, that houses our sales and marketing teams, engineering staff, and manufacturing space. All our equipment is made right here in the USA. Cann Systems applies innovative design and lean manufacturing principles to remain at the forefront of industrial drying solutions."
    },
    {
        "title": "Linnea Cannabinoids",
        "internal_link": "https://www.mjbizdirectory.com/company/921143/linnea-cannabinoids",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Industrial Sonomechanics, LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/763599/industrial-sonomechanics-llc",
        "url": null,
        "linkedin": null,
        "description": "Make your own water-soluble powders and liquids with Industrial Sonomechanics (ISM) ultrasonic technology, which includes:\n- Barbell Horn-based ultrasonic liquid processors, and\n- NanoStabilizer products.\n\nISM turn-key solution makes it possible for both the novice and professional to easily produce water-soluble nanoemulsions from any hydrophobic bioactive extracts (full- and broad-spectrum oils, distillates, isolates, vitamins, essential oils, terpenes, nutraceuticals, pharmaceuticals).\n\nWe offer manuals, guides, SOPs, and videos, as well as reliable and timely technical support.\n\nNo need to develop formulations or be a scientist!"
    },
    {
        "title": "JULABO USA",
        "internal_link": "https://www.mjbizdirectory.com/company/120963/julabo-usa",
        "url": null,
        "linkedin": null,
        "description": "JULABO USA offers liquid temperature control solutions for science, research, and industry. Our equipment assists with material testing and analysis, distillations, extractions, extrusions, cultivations, stress tests, temperature simulations and more. JULABO USA offers a variety of user-friendly, space-saving products with a temperature range from -95°C to +350°C and stability of ±.01°C, including refrigerated and heating circulators, temperature control systems, recirculating chillers, industrial chillers, water baths, immersion coolers, viscometer baths and complementary accessories."
    },
    {
        "title": "Sequoya Biotechnologies",
        "internal_link": "https://www.mjbizdirectory.com/company/920709/sequoya-biotechnologies",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Yes Cannabis",
        "internal_link": "https://www.mjbizdirectory.com/company/915345/yes-cannabis",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "ClearSource",
        "internal_link": "https://www.mjbizdirectory.com/company/915951/clearsource",
        "url": null,
        "linkedin": null,
        "description": "ClearSource is a premier supplier of high-purity alcohol products, specializing in pharmaceutical, industrial, and beverage grade (grain neutral spirits)."
    },
    {
        "title": "Maratek",
        "internal_link": "https://www.mjbizdirectory.com/company/913124/maratek",
        "url": null,
        "linkedin": null,
        "description": "Looking for world-class solvent recovery & recycling or Cannabis Hemp extraction equipment but can't find a solution that fits your needs? Try Maratek"
    },
    {
        "title": "Canna Brand Solutions",
        "internal_link": "https://www.mjbizdirectory.com/company/913446/canna-brand-solutions",
        "url": null,
        "linkedin": null,
        "description": "Canna Brand Solutions is an innovative custom packaging supplier and an Official CCELL Distributor. We are a wholesale cartridge, battery..."
    },
    {
        "title": "AVD - Advanced Vapor Devices",
        "internal_link": "https://www.mjbizdirectory.com/company/913298/avd-advanced-vapor-devices",
        "url": null,
        "linkedin": null,
        "description": "Advanced Vapor Devices (AVD) is a vape hardware manufacturer that specializes in building reliable cartridges, disposables, and batteries specifically designed for cannabis oils."
    },
    {
        "title": "Aptia Engineering",
        "internal_link": "https://www.mjbizdirectory.com/company/913328/aptia-engineering",
        "url": null,
        "linkedin": null,
        "description": "Aptia Engineering is a specialized engineering & manufacturing firm delivering process equipment to hemp and other industries that is powerful, efficient, and dependable. Aptia unique More than Metal‚ philosophy ensures that our clients receive application specific engineering and innovation, top quality project execution, and the best pre-sale and post-sale technical services and support in the industry. Manufacturing success is built upon more than hardware. Our industry leading processes include Butane Extraction, Solvent Recovery, Winterization, Wiped Film Distillation, as well as custom solutions."
    },
    {
        "title": "Amalgamated Research",
        "internal_link": "https://www.mjbizdirectory.com/company/912956/amalgamated-research",
        "url": null,
        "linkedin": null,
        "description": "Amalgamated Research (ARi) develops and installs industrial separation systems, specializing in chromatography and ion exchange. ARi offers efficient chromatographic solutions for THC remediation and cannabinoid purification with scale-up capabilities to match any production rate.\nOngoing technical support is provided, including process optimization, onsite training, and technical audits. ARi cannabinoid purification technology has been refined in collaboration with the hemp industry, and a working demonstration system is available to view up on request."
    },
    {
        "title": "Across International",
        "internal_link": "https://www.mjbizdirectory.com/company/805968/across-international",
        "url": null,
        "linkedin": null,
        "description": "Founded and based in New Jersey, United States, Across International supplies laboratory equipment, in the areas of heat treatment and material processing for universities, research facilities and labs. We have more than 20 years of industrial manufacturing experience with induction heaters, drying ovens, ball mills, lab furnaces and pellet presses.\n\nOur goal is to build up business partnerships with friends around the world. We provide quantity discounts and will reply to your requests within the same business day. 100% customer satisfaction is always our first priority."
    },
    {
        "title": "Ousia Labs",
        "internal_link": "https://www.mjbizdirectory.com/company/915954/ousia-labs",
        "url": null,
        "linkedin": null,
        "description": "Ousia Labs manufactures a tabletop CO2 extraction machine that is Safe, Portable, Affordable and Easy to Use!"
    },
    {
        "title": "HempRise",
        "internal_link": "https://www.mjbizdirectory.com/company/915515/hemprise",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "RollPros",
        "internal_link": "https://www.mjbizdirectory.com/company/920181/rollpros",
        "url": null,
        "linkedin": null,
        "description": "RollPros is the manufacturer of the Blackbird, the only automated joint machine that makes joints the same way you do: rolled, not stuffed. Brands across the US and Canada use the Blackbird to create unique, value-added products that are preferred by 4/5 consumers over pre-rolls made with cones. RollPros is dedicated to helping our customers build successful, profitable brands through continuous innovation, exceptional customer support, and category expertise."
    },
    {
        "title": "Huber USA Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/806047/huber-usa-inc",
        "url": null,
        "linkedin": null,
        "description": "Huber USA is the technology leader for high precision thermoregulation in research and industry. Our products ensure precise temperature control in laboratories, pilot plants and production processes."
    },
    {
        "title": "Yamada America Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/206617/yamada-america-inc",
        "url": null,
        "linkedin": null,
        "description": "A leading producer of industrial equipment and of fluid handling products. A pioneer of pumping technology, Yamada is known in many industries worldwide for its innovative products, superior quality, and unmatched reliability. Yamada air-powered double diaphragm pumps are available in ¼” through 3” port sizes (flows to 214 GPM) and incorporated a wide variety of materials of construction to meet your most demanding fluid transfer needs. The Proof’s in the Pump."
    },
    {
        "title": "Bulk Seeds",
        "internal_link": "https://www.mjbizdirectory.com/company/918796/bulk-seeds",
        "url": null,
        "linkedin": null,
        "description": "Whether you want to buy wholesale cannabis seeds to resell or are after bulk quantities for your personal collection, we have you covered. Anyone can place an instant order; no account or registration is needed when shopping with us.\n\nThe more cannabis seeds you buy, the cheaper it gets! Why buy in small amounts for high prices when you can get stocked up for less? We supply wholesale cannabis seeds to both online seedbanks and personal collectors. You do not need an account to place an order with us, and we offer discreet next-day delivery on all orders. We offer both auto-flowering and feminized strains in bulk quantities from 20 seeds to 20,000!"
    },
    {
        "title": "Ounce of Hope Aquaponics",
        "internal_link": "https://www.mjbizdirectory.com/company/918802/ounce-of-hope-aquaponics",
        "url": null,
        "linkedin": null,
        "description": "Ounce of Hope is a unique vertical operation with a mission of improving food sustainability, social equity, criminal justice reform and a mission to change minds in relation to past unjust laws surrounding cannabis and psychedelics.\n\nWe specialize in aquaponic (fish+plants) growing methods, solventless extractions, in-house formulations, and stellar dispensary operations. Our focus is to continue to push the limits of Organic Farming practices and fish production (aquaculture).\n\nOunce of Hope provides high-quality cannabis products grown in a completely controlled and sustainable environment right here in Memphis, Tennessee."
    },
    {
        "title": "Xenex Laboratories Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/919456/xenex-laboratories-inc",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Eagle Protect PBC",
        "internal_link": "https://www.mjbizdirectory.com/company/918926/eagle-protect-pbc",
        "url": null,
        "linkedin": null,
        "description": "Eagle Protect, a disposable glove and clothing specialist, supplies durable, tactile and chemical resistant disposable gloves that reduce ripping and skin irritation. Eagle’s proprietary Delta Zero program ensures a range of Eagle gloves adhere to the highest standards of cleanliness and durability."
    },
    {
        "title": "Factory6, Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/915414/factory6-inc",
        "url": null,
        "linkedin": null,
        "description": "What started as a successful CBD business, comprised of leading professionals and the finest organic hemp farmers, rapidly grew to us expanding our team, relationships and capabilities. We have since been servicing some of the largest nutritional supplement companies and have worked beside top manufacturers that have helped us grow to provide the level of skill and professionalism we give our clients daily.\n\nAt Factory6 we are committed to innovation and producing high quality products for our clients. With the wellness market thriving, we are focused on helping companies build their brands effectively and efficiently through a positive working relationship.\n\nDeveloping your own goods should be a gratifying experience. Our goal with co-packing is to streamline the process for our clients so it’s simple while exceeding expectations.\n\nAs a turn-key contract manufacturer with decades of executive level experience, our clients get support from start to finish when launching their new product. The Factory6 Blueprint begins with an idea that turns into a lab tested, premium product that is labeled, packaged up and ready to sell!\n\nKnowing we are being entrusted with the growth of your business, we are dedicated to being a leader in the co-packing industry."
    },
    {
        "title": "Convectium",
        "internal_link": "https://www.mjbizdirectory.com/company/918263/convectium",
        "url": null,
        "linkedin": null,
        "description": "Providing automation solutions and renowned customer service in the distillate, vape, and packaging sectors of the cannabis industry."
    },
    {
        "title": "Pressure BioSciences, Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/918240/pressure-biosciences-inc",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Ivek Corporation",
        "internal_link": "https://www.mjbizdirectory.com/company/554621/ivek-corporation",
        "url": null,
        "linkedin": null,
        "description": "IVEK Corporation specializes in the design and manufacture of small volume precision liquid metering and dispensing systems. Our products and systems are relied upon for critical applications in industries such as medical, pharmaceutical, laboratory, diagnostics, bio-tech instrumentation and others.\n\nWhen consistent, precise small volume fluidic dispensing, metering and delivery is vital, Ivek systems deliver."
    },
    {
        "title": "Industrial Source",
        "internal_link": "https://www.mjbizdirectory.com/company/913037/industrial-source",
        "url": null,
        "linkedin": null,
        "description": "Oregon's largest independent supplier of specialty, medical, research, and industrial gases."
    },
    {
        "title": "Gilson",
        "internal_link": "https://www.mjbizdirectory.com/company/915744/gilson",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Greentank",
        "internal_link": "https://www.mjbizdirectory.com/company/913147/greentank",
        "url": null,
        "linkedin": null,
        "description": "Greentank designs, develops, and manufactures premium vaporization hardware, engineered specifically for the cannabis industry. Quality and innovation are core to what we do and who we are. We work directly with licensed producers, cultivators and brands to power their extracts and provide a better vaping experience. Supported by some of the most reputable investors in the cannabis industry, Greentank has quickly become a trusted, sought after name in cannabis vaporization hardware."
    },
    {
        "title": "Molecular Forces Consulting LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/915617/molecular-forces-consulting-llc",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Somai Pharmaceutical",
        "internal_link": "https://www.mjbizdirectory.com/company/915340/somai-pharmaceutical",
        "url": null,
        "linkedin": null,
        "description": "AT SOMAÍ, WE ARE COMMITTED TO DELIVERING THE FULL THERAPEUTIC VALUE OF MEDICAL CANNABIS TO BENEFIT PATIENTS ACROSS THE WORLD.\n\nOur scientific expertise combined with an avant-garde approach creates novel treatments that truly engage the power of the plant to alleviate debilitating chronic conditions.\n\nOur team of experts formulate the most effective active ingredients to maximise bioavailability and provide rapid, targeted relief for specific conditions. Furthermore, our innovative drug delivery approaches ensure wide accessibility to our range.\n\nThrough collaboration with leading clinical experts and researchers across a variety of therapy areas, we aim to produce tailored, effective products and address currently unmet clinical needs through our forward-thinking approach."
    },
    {
        "title": "Sweetgrass Cannabis Ltd",
        "internal_link": "https://www.mjbizdirectory.com/company/915613/sweetgrass-cannabis-ltd",
        "url": null,
        "linkedin": null,
        "description": "Sweetgrass Cannabis is a licensed producer of certified organic craft cannabis flower based in the Kootenay region of BC, Canada. They're certified by the Fraser Valley Organic Producers Association and cultivate their plants in living soil, taking an old-school, hands-on approach to their entire operation. The result is a top shelf, high grade product that's earned a solid reputation across Canadian recreational and medical cannabis marketplace."
    },
    {
        "title": "United Science",
        "internal_link": "https://www.mjbizdirectory.com/company/915640/united-science",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Synergy Life Science",
        "internal_link": "https://www.mjbizdirectory.com/company/915582/synergy-life-science",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Boulder Creek Technologies",
        "internal_link": "https://www.mjbizdirectory.com/company/915388/boulder-creek-technologies",
        "url": null,
        "linkedin": null,
        "description": "Boulder Creek Technologies is leading extraction innovation in the cannabis and hemp industries with advanced Vapor-Static processing equipment that is safe, sustainable, and engineered for true commercial scale. The result of years of research as well as the founders’ passion for the environment, Boulder Creek Technologies’ patented Vapor-Static system represents a sea change in solventless cannabinoid extraction and creates high quality oil for all product categories, from concentrates and vapes to edibles and topicals. In marrying proven extraction technology with a turnkey installation model, processors and manufacturers of all sizes achieve high-efficiency production of exceptionally pure extracts while dramatically reducing operating expenditures. Models are available that can process up to 5,000 lbs of biomass per day with continuous feed operation for maximum productivity with a single operator."
    },
    {
        "title": "Mar Medika DOO",
        "internal_link": "https://www.mjbizdirectory.com/company/915436/mar-medika-doo",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "KNF Neuberger Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/736099/knf-neuberger-inc",
        "url": null,
        "linkedin": null,
        "description": "KNF Neuberger is a leader in oil-free, precision air/gas and liquid diaphragm pumps and systems. The company has solved thousands of medical device and clinical diagnostic instrument design challenges for a variety of needs, including: washing, waste handling; metering/dosing; aspiration; fluid transfer, vacuum and pneumatics; and recirculation.\nBuilt upon a foundation of engineer-to-engineer collaboration, KNF’s OEM team combines technical expertise and manufacturing leadership to meet your specs while exceeding your expectations. More often than not, this approach results in an optimized, purpose-built pump for a specific customer application. In fact, over 90% of our business involves custom-engineered pump solutions. Contact a KNF Engineer today and see why we’re more than just a pump."
    },
    {
        "title": "IZiel Healthcare LLP",
        "internal_link": "https://www.mjbizdirectory.com/company/911882/iziel-healthcare-llp",
        "url": null,
        "linkedin": null,
        "description": "Ziel specializes in innovative Radio Frequency (RF) technology for effective microbial control and cannabis mold remediation, ensuring compliance with the strictest state regulations. Our solutions maximize profitability by enhancing flower yields and maintaining product quality without the need for chemicals or special permits. With a 99.9% uptime and the highest throughput on the market, Ziel’s RFX equipment processes up to 160 lbs of product in an 8-hour shift, setting industry standards. Our hands-on approach includes comprehensive onboarding, continuous monitoring, and direct engagement to ensure seamless operations. Partnering with Ziel means integrating state-of-the-art decontamination technology that elevates operational efficiency and safeguards your brand."
    },
    {
        "title": "Federal Equipment Company",
        "internal_link": "https://www.mjbizdirectory.com/company/54163/federal-equipment-company",
        "url": null,
        "linkedin": null,
        "description": "Federal Equipment Company is a reliable resource for used processing and packaging equipment in pharmaceutical, chemical, plastics and rubber markets, with over 60 years of expertise buying and selling machines.\n\nFor companies with surplus equipment, Federal Equipment Company takes away all the headaches of asset management. We bring deep knowledge of equipment values that support accurate appraisals, and advise you on a range of options to optimize the value you recoup. We also offer cash liquidity and fast, expert removal of individual pieces to entire lines – protecting your facility.\n\nAcquisitions from reputable companies support a large, on-hand inventory of reliable equipment manufactured by leading OEMs. This enables fast turnaround, and our market knowledge ensures you buy and install exactly what you need. We also offer expert training & troubleshooting for solid dose equipment."
    },
    {
        "title": "Thermal Care, Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/142650/thermal-care-inc",
        "url": null,
        "linkedin": null,
        "description": "Whether processing for natural flavorings, fragrance, cannabis, or hemp, accurate and reliable temperature control in Extraction, Winterization and Short Path Distillation processes, maintaining precise set-point temperatures is necessary to produce high-quality essential oils."
    },
    {
        "title": "RKI Instruments Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/66689/rki-instruments-inc",
        "url": null,
        "linkedin": null,
        "description": "RKI Instruments, Inc. is an innovative gas detection company located in Union City, California. RKI is partnered with Riken Keiki Company, Ltd., the world leader in gas detection and sensor technologies. RKI is also known for our unique product developments. We have developed our own line of gas detection instruments to complement the Riken product line. Our combination of quality products and knowledgeable people gives you the ability to confidently face almost any gas monitoring application."
    },
    {
        "title": "BriskHeat Corporation",
        "internal_link": "https://www.mjbizdirectory.com/company/189425/briskheat-corporation",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Exergy, LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/119592/exergy-llc",
        "url": null,
        "linkedin": null,
        "description": "Since Exergy's inception in 1979, we have built our reputation worldwide for delivering unsurpassed quality heat exchangers through our engineering and manufacturing expertise. We utilize our extensive experience and our proprietary software to design the optimal heat exchanger"
    },
    {
        "title": "PortaFab Corporation",
        "internal_link": "https://www.mjbizdirectory.com/company/236326/portafab-corporation",
        "url": null,
        "linkedin": null,
        "description": "As a leading manufacturer of modular in-plant offices, buildings and environmental enclosures, PortaFab's modular wall systems are utilized for commercial applications in a wide-variety of markets across the globe. Our staff of in-house engineers and design consultants are an asset to architects and general contractors who lean on us to deliver, functional and cost effective solutions.\n\nPortaFab manufactures all of its products in compliance with ISO standards with a focus on continuous quality improvement and is ISO 9001:2015 certified. All suppliers are subject to extensive SPC standards and manufacturing in our U.S. based facility is monitor closely for not only the quality of the individual components, but for their ability to integrate properly and seamlessly. Our focus on quality is further supported by the number of world class manufacturers that rely on our systems."
    },
    {
        "title": "Kaplan Industries, Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/853374/kaplan-industries-inc",
        "url": null,
        "linkedin": null,
        "description": "Medical Cylinders, Hydrocarbon Gases for extraction."
    },
    {
        "title": "Macurco Gas Detection",
        "internal_link": "https://www.mjbizdirectory.com/company/278420/macurco-gas-detection",
        "url": null,
        "linkedin": null,
        "description": "Macurco Gas Detection strives to provide the highest quality gas detection, safety and security solutions to customers worldwide.\n\nThe Macurco product line offers fixed and portable gas detection equipment for residential, commercial, industrial and safety applications. There are fixed gas detection options for a number of different gases including carbon monoxide, nitrogen dioxide, hydrogen, LP, natural gas, hydrogen sulfide, ammonia, oxygen, refrigerants, carbon dioxide and more. Whether you are looking for a gas detector for your residential security system, industrial application, building automation system or HVAC system, Macurco has a gas detector to meet all of your needs."
    },
    {
        "title": "Skolnik Industries Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/173586/skolnik-industries-inc",
        "url": null,
        "linkedin": null,
        "description": "Manufacturer of Carbon Steel and Stainless Steel containers from 5 to 95 gallons."
    },
    {
        "title": "KINEMATICA INC",
        "internal_link": "https://www.mjbizdirectory.com/company/564052/kinematica-inc",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "inTEST Thermal Solutions",
        "internal_link": "https://www.mjbizdirectory.com/company/153398/intest-thermal-solutions",
        "url": null,
        "linkedin": null,
        "description": "inTEST Thermal Solutions (iTS) specializes in the design and manufacture of thermal environments for electronics temperature testing and conditioning, and industrial process cooling. Thermal equipment includes temperature forcing systems, thermal chambers and platforms, and process chillers. We are recognized for expertise in precise control of extreme thermal environments, -185 to +500C, and rapid transitions between desired temperatures.\n\nThe iTS family includes three temperature-related corporations Sigma Systems, Temptronic and Thermonics. iTS is part of inTEST Corp, Mount Laurel, NJ."
    },
    {
        "title": "JWC Environmental Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/194655/jwc-environmental-inc",
        "url": null,
        "linkedin": null,
        "description": "Monster Industrial marine sewage system grinders are used to keep your onboard wastewater system flowing freely.  They grind up all kinds of debris into small particles minimizing solids backups that require clean out.  This not only reduces maintenance costs, but also protects the health of the crew.  1-HYDRO & 3-HYDRO grinders will protect pumps from rags, hygiene products and other items that should not be flushed in the first place."
    },
    {
        "title": "Steri Technologies Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/121053/steri-technologies-inc",
        "url": null,
        "linkedin": null,
        "description": "For decades, Steri Technologies has been delivering reliable filtration equipment to every continent around the world. Superior designs of the pressure leaf type FUNDA Filter, the Nutsche filter type ZWAG Filter and the Steri CANDLE Filter technologies. A variety of industries depend on Steri filters.\n\nThere are no boundaries to the successful application of liquid-solid separation by robust Steri filters and filter systems. From mining to pharmaceutical, from nuclear energy to food processing and everywhere else that solid-liquid separation is important."
    },
    {
        "title": "Flux Pumps Corp",
        "internal_link": "https://www.mjbizdirectory.com/company/770250/flux-pumps-corp",
        "url": null,
        "linkedin": null,
        "description": "For more than 60 years FLUX represents pump technology. The invention of the electric drum pump we took the initial spark. Meanwhile, the technology has become more diverse. Innovations from FLUX have improved the work flow productivity around the filling and transfer of fluids."
    },
    {
        "title": "Milestone Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/119437/milestone-inc",
        "url": null,
        "linkedin": null,
        "description": "With over 50 patents and more than 20,000 instruments installed in laboratories around the world, Milestone has been widely recognized as the global leader in metals prep technology for the past 28 years. Committed to providing safe, reliable, and flexible platforms to enhance your lab’s productivity, customers worldwide look to Milestone for their metals digestion, organic extractions, mercury analysis and clean chemistry processing needs."
    },
    {
        "title": "Cool Clean Technologies, LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/760658/cool-clean-technologies-llc",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "ErtelAlsop",
        "internal_link": "https://www.mjbizdirectory.com/company/119870/ertelalsop",
        "url": null,
        "linkedin": null,
        "description": "ErtelAlsop offers the widest range of liquid filtration equipment in the world. This variety allows us to assist you in the complete scalability of your application, from small-batch to full production. ErtelAlsop recommends performance filterability testing to optimize your process, which can be accomplished through the purchase of an ErtelAlsop lab filter or by contacting your local authorized distributor or sales representative to schedule on-site testing. In the chemical, cosmetic, electric utility, environmental remediation, food and beverage, industrial wastewater, metals/mining, petrochemical, pharmaceutical and pulp & paper markets, ErtelAlsop can supply the filtration equipment to meet your filtration needs."
    },
    {
        "title": "So-Low Environmental Equipment Co. Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/120785/so-low-environmental-equipment-co-inc",
        "url": null,
        "linkedin": null,
        "description": "Since 1959, So-Low has manufactured\nUltra-Low Temperature Freezers for both\nthe Medical and Industrial markets. Professionals all over the world have recognized the dependability and efficiency of So-Low Ultra-Low Temperature Freezers and Refrigerators. Our goal is to provide a level of quality construction, reliability and value unequaled anywhere in the world."
    },
    {
        "title": "Gilson , Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/120836/gilson-inc",
        "url": null,
        "linkedin": null,
        "description": "Designed for purification and engineered for science, Gilson, Inc. provides high-quality, dependable purification solutions for today's demanding liquid chromatography, solid phase extraction, liquid handling and gel permeation chromatography clean-up requirements. From the legendary Gilson Pipetman® products to a full range of purification system solutions, Gilson is the element of purification for your laboratory. Gilson’s innovative products will revolutionize your lab providing the durability, flexibility, modularity and ease-of-use you have come to expect with Gilson."
    },
    {
        "title": "Abstrax",
        "internal_link": "https://www.mjbizdirectory.com/company/913042/abstrax",
        "url": null,
        "linkedin": null,
        "description": "Leveraging its proven background in strain research, ABSTRAX is the leader in the research, development, and production of botanically-derived and cannabis-inspired terpenes that create unforgettable sensorial experiences."
    },
    {
        "title": "Accelerant Manufacturing",
        "internal_link": "https://www.mjbizdirectory.com/company/913531/accelerant-manufacturing",
        "url": null,
        "linkedin": null,
        "description": "Accelerant Manufacturing revolutionizes the pre-roll production industry with its automated pre-roll machines, which can fill, pack, and twist up to 3000 cones per hour without requiring any capital investment or overhead costs. Our Production as a Service (PaaS) model ensures seamless operation by providing machine maintenance and scalability at costs as low as $0.08 per pre-roll. Trusted by industry leaders, our PRO series machines offer accurate weigh filling, environmental monitoring, and smart alerts to optimize production. With innovative features like CoolFlow technology for infused pre-rolls, we guarantee consistent quality and a premium smoking experience. Experience unparalleled customer support and training, making Accelerant Manufacturing your ultimate production co-pilot."
    },
    {
        "title": "Advanced Extraction Labs",
        "internal_link": "https://www.mjbizdirectory.com/company/913522/advanced-extraction-labs",
        "url": null,
        "linkedin": null,
        "description": "ADVANCED EXTRACTION LABS Top manufacturers of custom C1D1 enclosures & more. See our Products Previous Next Who We Are Full-Service Extraction Lab Manufacturing solution We are experts in getting your space permitted. Our labs are made with quality and efficiency in mind and are guaranteed to last.Our in-house design team can handle any custom lab"
    },
    {
        "title": "Ally Biotech",
        "internal_link": "https://www.mjbizdirectory.com/company/913312/ally-biotech",
        "url": null,
        "linkedin": null,
        "description": "Interested in offering your clients something truly one-of-a-kind in the THC category? This is the end of your journey."
    },
    {
        "title": "Alpine Chillers",
        "internal_link": "https://www.mjbizdirectory.com/company/912860/alpine-chillers",
        "url": null,
        "linkedin": null,
        "description": "Alpine Chillers provides high performance extraction process cooling solutions.\n\nThe Alpine X Series air-cooled recirculating chiller utilizes ultra low temperature three-stage cascade refrigeration to rapidly chill extraction solvents to temperatures as low as -808C for production of high quality extracts."
    },
    {
        "title": "Anion",
        "internal_link": "https://www.mjbizdirectory.com/company/913384/anion",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Apache Stainless",
        "internal_link": "https://www.mjbizdirectory.com/company/913232/apache-stainless",
        "url": null,
        "linkedin": null,
        "description": "Apache Stainless is a manufacturer of sanitary, highly engineered, ASME pressure vessels for a multitude of industries, including cannabis processing, pharmaceutical, health and biopharma. We also design and manufacture vessels with Canadian Registration Numbers (CRN) for all Canadian provinces. We have all Stainless ASME certified manufacturing facility with custom capabilities including heat exchange surfaces, agitation, CIP (clean-in-place) componentry and controls. Apache has an in-house quality and compliance team to provide all testing and documentation requirements."
    },
    {
        "title": "Apical Consultations",
        "internal_link": "https://www.mjbizdirectory.com/company/912833/apical-consultations",
        "url": null,
        "linkedin": null,
        "description": "Apical specializes in providing end-to-end solutions for sustainable cultivation, extraction, post processing, product formulation, compliance, and facility design to processors across the globe."
    },
    {
        "title": "Atlantic Safety Products",
        "internal_link": "https://www.mjbizdirectory.com/company/751518/atlantic-safety-products",
        "url": null,
        "linkedin": null,
        "description": "At Atlantic Safety Products, we specialize in providing high-quality disposable gloves designed to protect your most valuable asset—your hands. Our robust glove line includes the industry-leading Black Lightning, Orange Lightning, and InTouch series, all engineered for maximum durability and comfort. Serving a range of industries from automotive to law enforcement, we are committed to not only providing top-tier protective gear but also ensuring exceptional customer service with same-day order processing and free delivery within the continental United States. Our goal is to be your guiding light in hand protection, empowering you with the knowledge and products needed to make the best decisions for hand safety. Trust Atlantic Safety Products for reliable, efficient, and effective hand protection solutions."
    },
    {
        "title": "Beaker & Wrench",
        "internal_link": "https://www.mjbizdirectory.com/company/913250/beaker-wrench",
        "url": null,
        "linkedin": null,
        "description": "Beaker & Wrench, Inc\nprovides turn-key automated solutions for the\nprocessing and refinement of cannabis and hemp oil.\nBeaker & Wrench is the only company that has pre-solved customer problems by providing a cannabis\noptimized solution combined with concierge style\nservice and unmatched productivity per dollar spent.\nOur product line is targeted to manufacturing\nlaboratories specializing in the medical, recreational\nand hemp oil industry. Currently there are just a few\ncompanies offering this product set, and our\ncustomers benefit from the experiential and\nprofessional knowledge our team offers."
    },
    {
        "title": "Bear Rootz Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/913374/bear-rootz-inc",
        "url": null,
        "linkedin": null,
        "description": "Need wholesale smoke shop products? Bear Rootz can keep your store or dispensary stocked wtih bulk orders of your favorite products."
    },
    {
        "title": "BLIMBURN SEEDS by BBG Project",
        "internal_link": "https://www.mjbizdirectory.com/company/912767/blimburn-seeds-by-bbg-project",
        "url": null,
        "linkedin": null,
        "description": "BLIMBURN SEEDS by BBG Projects is a global seeds producer & supplier from Barcelona, Spain. Dedicated to the Cannabis seeds industry since 2002, we offer to B to B market, a professional expertise & a wide range of Feminized seeds. Our portfolio is about high-quality stable strains from the best genetics (+/- 700 strains > Feminized, Auto, Fast-growing, high CBD & CBG)."
    },
    {
        "title": "Blue Basin Canna, LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/912761/blue-basin-canna-llc",
        "url": null,
        "linkedin": null,
        "description": "Retailer and wholesalers for hemp derived thc, cbg, and cbd products. Including, elixirs, gummies, and topicals."
    },
    {
        "title": "BOLD MAKER",
        "internal_link": "https://www.mjbizdirectory.com/company/913553/bold-maker",
        "url": null,
        "linkedin": null,
        "description": "We make the BEST Professional Platinum Silicone molds for all your Confectionery needs. Start producing all your Candy, and THC / CBD infused edibles today!"
    },
    {
        "title": "Buddy Boy Farms",
        "internal_link": "https://www.mjbizdirectory.com/company/912683/buddy-boy-farms",
        "url": null,
        "linkedin": null,
        "description": "We are a producer/processor with 2 tier 3 facilities in Washington State. We started in 2014 and have 4 brands in stores across the state."
    },
    {
        "title": "Canapa Valley Farms",
        "internal_link": "https://www.mjbizdirectory.com/company/912836/canapa-valley-farms",
        "url": null,
        "linkedin": null,
        "description": "Canapa Valley Farms is an ultramodern agricultural company focusing on sustainable cultivation and processing techniques using advanced technology."
    },
    {
        "title": "Cannabis Centrifuges",
        "internal_link": "https://www.mjbizdirectory.com/company/913476/cannabis-centrifuges",
        "url": null,
        "linkedin": null,
        "description": "Cannabis Centrifuges supplies centrifuges for cold Ethanol extraction in both Batch and Automated large scale processing for Cannabis and Hemp.\n\nWe also offer equipment for CBD crystal Filtering, Washing and Drying."
    },
    {
        "title": "Cannabolish by OMI Industries",
        "internal_link": "https://www.mjbizdirectory.com/company/913518/cannabolish-by-omi-industries",
        "url": null,
        "linkedin": null,
        "description": "Fight Smoke odor with plant power! Remove unwanted smoke odors from cannabis and tobacco, instantly and naturally. For chronic smoke odor issues, reach for Cannabolish, the plant-based cannabis odor remover made with natural ingredients. It's scientifically tailored to safely and effectively destroy smoke odor molecules. Cannabolish is a division of OMI Industries, which has been in the natural odor eliminating industry for over 30 years!"
    },
    {
        "title": "Cascade Sciences",
        "internal_link": "https://www.mjbizdirectory.com/company/913024/cascade-sciences",
        "url": null,
        "linkedin": null,
        "description": "Cascade Sciences is a division of Agrify that leads the industry in professional-grade processing solutions with nearly 30 years of industry experience. Our extensive line of vacuum, drying, and decarboxylation ovens, reactor systems, rotary evaporators, vacuum cold traps, chillers, homogenizers, laboratory baths, moisture analyzers, and scientific balances set the standard in laboratory testing and processing solutions. We are dedicated to providing the highest quality products with superior service and support."
    },
    {
        "title": "CCP Industries",
        "internal_link": "https://www.mjbizdirectory.com/company/913127/ccp-industries",
        "url": null,
        "linkedin": null,
        "description": "CCP Industries has been serving the needs of cultivators, laboratories, processors and other agricultural customers for over 100 years. As the nation leading manufacturer and provider of disposable gloves, work gloves, respirators and masks, disposable and durable hi visibility safety clothing and other PPE, we protect our customers with custom solutions every day. CCP also manufacturers and sells direct to the cannabis industry wiping cloths, chemicals, odor control products, rags, premoistened wipes, janitorial items and MRO items. With over 100 in-field sales managers, we visit each site and cater our products to the needs of individual growing, cultivating, processing, packaging, processor, and lab facility."
    },
    {
        "title": "Cedarstone Industry",
        "internal_link": "https://www.mjbizdirectory.com/company/912971/cedarstone-industry",
        "url": null,
        "linkedin": null,
        "description": "Cedarstone Industry, is a manufacturer of stainless steel process equipment, and suppliers of food, beverage, medical, and other industries."
    },
    {
        "title": "Chemtech Services Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/913157/chemtech-services-inc",
        "url": null,
        "linkedin": null,
        "description": "Chemtech Services Inc. designs and manufactures high vacuum distillation equipment based upon proprietary technology. Our expertise is in wiped film and short path evaporators for sensitive molecular separation."
    },
    {
        "title": "ChemTek",
        "internal_link": "https://www.mjbizdirectory.com/company/912756/chemtek",
        "url": null,
        "linkedin": null,
        "description": "Chem Tek was founded with the soul intention of improving cannabis filtration. We design each of our Filter Medias for specific variables and take the guesswork and estimation out of your filtration process. Unlike other media companies, our licensed California extraction lab allows us to put each of our medias through vigorous testing and R&D."
    },
    {
        "title": "City Trees",
        "internal_link": "https://www.mjbizdirectory.com/company/912852/city-trees",
        "url": null,
        "linkedin": null,
        "description": "We are a cannabis company that is committed to sustainability and providing the purest THC distillate products in Nevada. Established in 2017, City Trees leverages extensive experience in cannabis cultivation, extraction, and distribution to deliver top-quality THC distillate products. Our innovative extraction methods and meticulous attention to detail ensure a range of pure, consistent cannabis products that meet medical-grade standards. We are committed to sustainability and premium quality, constantly refining our formulations to enhance the customer experience. City Trees’ state-of-the-art lab enables us to offer toll processing services, transforming cannabis or hemp biomass into various oils and formulations tailored to your needs. Sustain Your State with City Trees, where passion meets innovation to bring you the finest cannabis products."
    },
    {
        "title": "Clear Cannabis Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/913086/clear-cannabis-inc",
        "url": null,
        "linkedin": null,
        "description": "About Clear Cannabis, Inc. -\nThe Clear‚ is one of the original cannabis brands. The brand was founded in 2013 by a team of scientists who introduced molecular distillation to the legal cannabis market and in the process reinvented the cannabis vape category. As a national cannabis brand and licensor of The Clear‚, Clear Cannabis, Inc. products are available in multiple cannabis markets in the U.S. The company is focused on product consistency regardless of state, proprietary formulations, product safety, consumer experience, and expanding product lines."
    },
    {
        "title": "Colorado Extraction Systems",
        "internal_link": "https://www.mjbizdirectory.com/company/913416/colorado-extraction-systems",
        "url": null,
        "linkedin": null,
        "description": "Colorado Extraction in Denver is the industry leader in extraction, evaporation, distillation, and isolation equipment using pure processing power."
    },
    {
        "title": "Crown Iron Works",
        "internal_link": "https://www.mjbizdirectory.com/company/913071/crown-iron-works",
        "url": null,
        "linkedin": null,
        "description": "Crown is an innovative, world leader in oilseed processing offering custom process engineering, equipment, piloting and aftermarket support for crush, refining, biofuels, oleochemicals, plant-based proteins and other specialty extraction such as hemp, hemp seeds, and cannabis."
    },
    {
        "title": "Cryometrix",
        "internal_link": "https://www.mjbizdirectory.com/company/913139/cryometrix",
        "url": null,
        "linkedin": null,
        "description": "Cryometrix blast freezing, storage cooling, and thawing products use a revolutionary liquid nitrogen technology that doesn't require a compressor or CFCs. It has low energy usage and greatly reduced maintenance.\nWant to reduce your cooling costs while also improving performance? Take a look at our Cryometrix products for your blast freezing, storage cooling, and thawing applications."
    },
    {
        "title": "Decarbitation",
        "internal_link": "https://www.mjbizdirectory.com/company/913543/decarbitation",
        "url": null,
        "linkedin": null,
        "description": "Decarboxylate at 99% efficiency in just 30 minutes. Precision temperature control with patented controlled cavitation means our tech won't scorch or degrade your cannabinoids like traditional heating elements do. 100% scalable to meet your extraction needs. Gain 10-20% on your decarboxylation yields with a Decarbitation System!"
    },
    {
        "title": "DEMA Engineering",
        "internal_link": "https://www.mjbizdirectory.com/company/851714/dema-engineering",
        "url": null,
        "linkedin": null,
        "description": "DEMA Is A Leading Supplier Of Chemical Dispensing Systems, Fluid Control Devices And Industrial Solenoid Valves, Strainers, Pumps And Injectors For Virtually Any Industrial, Institutional And Professional Market. Our institutional systems address the housekeeping, food service, food processing, warewash and laundry markets plus many other industries where precise metering of fluids is critical. DEMA industrial products answer the needs of the car wash, beverage, dairy, agriculture, irrigation, plant and design engineering marketplaces."
    },
    {
        "title": "Deutsche Process",
        "internal_link": "https://www.mjbizdirectory.com/company/913376/deutsche-process",
        "url": null,
        "linkedin": null,
        "description": "Deutsche Process is a custom industrial process equipment manufacturer. We engineer and build custom stainless steel applications."
    },
    {
        "title": "Dimplex Thermal Solutions",
        "internal_link": "https://www.mjbizdirectory.com/company/913150/dimplex-thermal-solutions",
        "url": null,
        "linkedin": null,
        "description": "For more than 70 years Dimplex Thermal Solutions has been solving our customers' process cooling issues. We've now engineered a full line-up of low temperature chillers specially for cannabis extraction."
    },
    {
        "title": "Doctors Hemp Solutions",
        "internal_link": "https://www.mjbizdirectory.com/company/912848/doctors-hemp-solutions",
        "url": null,
        "linkedin": null,
        "description": "Doctor Hemp Solutions takes pride in providing excellent products! In doing so we make sure to grow, harvest, and extract only the best! We're involved in all aspects of the production process with no middleman! From picking the best seeds, ensuring the soil is adequately nourished, to effectively extracting oil from the plants and into our finished products. We utilize high-quality ingredients when creating our topical, oils, creams, tinctures, and other supplement products. This proprietary process creates pharmaceutical-grade, high-quality, premium, full spectrum hemp products with quality pricing not found anywhere else."
    },
    {
        "title": "Dynamistic Technologies",
        "internal_link": "https://www.mjbizdirectory.com/company/913537/dynamistic-technologies",
        "url": null,
        "linkedin": null,
        "description": "Trim to oil, degassed and decarb, in an all-in-one unit. Extraction made simple! Dynamistic equipment includes automated process and safety parameters as well as real time data collection helping to ensure safe and regulatory compliant operation."
    },
    {
        "title": "Echelon Supply and Service",
        "internal_link": "https://www.mjbizdirectory.com/company/913269/echelon-supply-and-service",
        "url": null,
        "linkedin": null,
        "description": "Industrial supply companies in Southwest Louisiana a wide range of products to various types of applications at affordable rates. Echelon Supply and Service, with nearly 50 years of expertise, is North America’s premier provider of industrial and hydraulic hose solutions. Our extensive product line, including the high-performance FORSAFLEX system, meets the rigorous demands of both commercial and defense markets. Headquartered in Liverpool, New York, with 14 fabrication and distribution centers across the US and Canada, we ensure swift and reliable supply to our diverse clientele. We are committed to a customer-first approach, delivering quality products, exceptional support, and tailored solutions that make our customers' lives easier. Echelon is dedicated to empowering our clients' success through advanced technology and unparalleled service."
    },
    {
        "title": "Ecodyst, Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/913535/ecodyst-inc",
        "url": null,
        "linkedin": null,
        "description": "Ecodyst have developed a range of laboratory rotary evaporator systems, which provide the fastest evaporation rates under mild conditions."
    },
    {
        "title": "Emerald Green Technology",
        "internal_link": "https://www.mjbizdirectory.com/company/912914/emerald-green-technology",
        "url": null,
        "linkedin": null,
        "description": "A subsidiary of Tobacco Technology, Inc and E-LiquiTech, We are a flavoring company dedicated to the cannabinoid industry with specialized flavors for edibles, tinctures, hemp shisha, hemp smokables, hemp wraps, e-liquids, oral products and white label topicals."
    },
    {
        "title": "Emerald Scientific",
        "internal_link": "https://www.mjbizdirectory.com/company/913200/emerald-scientific",
        "url": null,
        "linkedin": null,
        "description": "Emerald Scientific advocates for collaboration, transparency, and evolution of the cannabis market toward more reliable and sophisticated science.\n\nFounded in 2014, Emerald Scientific was the first company 100% dedicated to distributing scientific supplies and equipment exclusively to the cannabis and hemp industries. Today we continue to offer the widest variety of quality products to meet your every cannabis and hemp testing, production, and extraction need.\n\nWe offer everything‚Äîfrom start to finish‚Äîfor cannabis analysis, testing, production, and extraction. We supply industry-leading scientific instruments, chemicals, supplies, and technical service to:\n\nCannabis testing labs\nExtraction facilities\nGenetics and seed companies\nConventional research labs investigating cannabis-related compounds including universities, biotech, and pharmaceutical labs.\nFor those setting up a new testing laboratory, or refitting an existing facility, our team of experts is here to help."
    },
    {
        "title": "Entexs Corporation",
        "internal_link": "https://www.mjbizdirectory.com/company/912817/entexs-corporation",
        "url": null,
        "linkedin": null,
        "description": "Redefining the Extraction and THC Remediation Industries.\nAt ENTEXS we are focused on developing technology to automate and optimize CBD extraction and refinement. From our class-leading THC Remediation solution, the RMD Series, which utilizes our industry-first real-time THC/CBD Reader, the CannaSpec, to our Automated Extraction and Distillation Systems. ENTEXS can enable your lab to efficiently produce the highest quality products.\n\nOur team understands that each customer extraction needs are unique. With in-house engineering and manufacturing, we can tailor our products to meet your specific needs. Proudly made in the USA, our systems address extraction process bottlenecks with truly hands-free automated systems."
    },
    {
        "title": "Erika Record Baking Equipment",
        "internal_link": "https://www.mjbizdirectory.com/company/913427/erika-record-baking-equipment",
        "url": null,
        "linkedin": null,
        "description": "Industry-leading distributor of bakery equipment for retail and wholesale bakeries. We are also proud to be among the first bakery equipment suppliers to accommodate the ever growing cannabis industry. We currently provide comprehensive solutions to a growing list of edible producers that infuse their products both with CBD and THC based ingredients."
    },
    {
        "title": "Extract Consultants",
        "internal_link": "https://www.mjbizdirectory.com/company/913218/extract-consultants",
        "url": null,
        "linkedin": null,
        "description": "Buy the best botanical terpenes for sale online with ease from Extract Consultants. We proudly offer the highest quality terpene and flavor products, regulatory guidance, and customer support on the market."
    },
    {
        "title": "ExtractionTek Stainless",
        "internal_link": "https://www.mjbizdirectory.com/company/913178/extractiontek-stainless",
        "url": null,
        "linkedin": null,
        "description": "Our Closed Loop Hydrocarbon Extractors are designed for safe and legal extraction using butane and propane as solvents."
    },
    {
        "title": "Filtrox",
        "internal_link": "https://www.mjbizdirectory.com/company/913301/filtrox",
        "url": null,
        "linkedin": null,
        "description": "frying oil filtration with SuperSorb Carbon pads. Improve the frying oil management, safe costs and provide consistent food quality."
    },
    {
        "title": "Fluid Chillers Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/854628/fluid-chillers-inc",
        "url": null,
        "linkedin": null,
        "description": "Fluid Chillers Inc. is a leading US-based manufacturer, specializing in advanced industrial chillers and process fluid cooling systems ranging from 1.3 tons to 500 ton capacity. We have rapidly evolved to deliver custom and standard chiller solutions across various sectors, including automotive, aerospace, medical, and more. Our comprehensive product lineup includes air-cooled, water-cooled, and custom chillers, backed by unrivaled service and support that ensures optimal performance. As industry pioneers, we are committed to innovation and efficiency, proudly meeting unique cooling challenges for diverse applications such as laser machinery, MRI scanners, and food processing. Experience unparalleled fluid cooling expertise tailored to your specifications with Fluid Chillers Inc. and discover what you've been missing."
    },
    {
        "title": "General Distributing",
        "internal_link": "https://www.mjbizdirectory.com/company/912997/general-distributing",
        "url": null,
        "linkedin": null,
        "description": "General Distributing Company, a 4th generation family-owned business since 1948, excels as a wholesale distributor of gases, equipment, and supplies aimed at enhancing efficiency, productivity, and profitability for our customers. Our extensive product range includes industrial, medical, and specialty gases, complemented by top-notch welding and industrial equipment. We offer a suite of services like equipment repair, cylinder testing, and cryogenic services, with a strong focus on education and training. Committed to community and customer success, we integrate local service with multiple locations across Montana. Celebrating over 75 years of service, we empower and inspire through unwavering dedication to quality and customer satisfaction."
    },
    {
        "title": "Gold Coast Ingredients",
        "internal_link": "https://www.mjbizdirectory.com/company/913403/gold-coast-ingredients",
        "url": null,
        "linkedin": null,
        "description": "Gold Coast Ingredients is a privately held and operated, wholesale flavor and color manufacturer located in California and Pennsylvania, USA. With us you will find Organic, Natural, Non-GMO, Allergen-Free and other flavors available as liquids, powders, powder encapsulations, emulsions and advanced extractions. Our flavors are compatible with any edible cannabis product."
    },
    {
        "title": "Gold Standard Consulting LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/912919/gold-standard-consulting-llc",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "GVB Biopharma",
        "internal_link": "https://www.mjbizdirectory.com/company/912698/gvb-biopharma",
        "url": null,
        "linkedin": null,
        "description": "GVB Biopharma stands at the forefront of hemp extraction, specializing in the production of high-quality CBD and minor cannabinoids through an innovative cryogenic process. Founded in the rich agricultural heartland of Oregon, we pride ourselves on our vertically integrated operations that ensure seed-to-shelf quality control. Our comprehensive offerings range from bulk ingredients like isolates and distillates to white label solutions, tailored for both wholesale and retail markets. With a dedicated team of top chemists and experts, we commit to delivering superior products at competitive prices, backed by exemplary customer service that fuels our swift growth and global reach. Experience the pinnacle of hemp science with GVB Biopharma, where excellence and precision drive our mission."
    },
    {
        "title": "HAL Extraction",
        "internal_link": "https://www.mjbizdirectory.com/company/912845/hal-extraction",
        "url": null,
        "linkedin": null,
        "description": "Turn-key CID1 & CID2 Extraction Booth for Cannabis Oil Extraction | HAL Extraction Golden, Colorado"
    },
    {
        "title": "Hashatron",
        "internal_link": "https://www.mjbizdirectory.com/company/913484/hashatron",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Hauschild SpeedMixer",
        "internal_link": "https://www.mjbizdirectory.com/company/913497/hauschild-speedmixer",
        "url": null,
        "linkedin": null,
        "description": "The World's Finest Lab Mixer and Industrial Mixer line. Unmatched reliability. Unrivalled German engineering. Legendary performance. Request a Demo Today."
    },
    {
        "title": "Herb's Supply",
        "internal_link": "https://www.mjbizdirectory.com/company/912688/herbs-supply",
        "url": null,
        "linkedin": null,
        "description": "We are dedicated to supporting commercial cultivation and extraction facilities. Herb's Supply offers high-quality products, unmatched technical support, and comprehensive installation services in the cannabis industry. Our high-quality hydroponic supplies, including Netafim drip irrigation systems, Dosatron nutrient delivery systems, and other agricultural equipment, are designed to enhance your cultivation setup. Our team brings expertise from the engineering, manufacturing, and industrial sectors, ensuring seamless integration of our products. Count on us to optimize your facility's yields and efficiency."
    },
    {
        "title": "Heyes Filters Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/913259/heyes-filters-inc",
        "url": null,
        "linkedin": null,
        "description": "Heyes Filters Inc. has been servicing and supporting the Cannabis marketplace since early 2018. We have the filtration items you need to turn your \"Green into Gold\"."
    },
    {
        "title": "High Art Studios",
        "internal_link": "https://www.mjbizdirectory.com/company/912704/high-art-studios",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Highpoint",
        "internal_link": "https://www.mjbizdirectory.com/company/912911/highpoint",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "HighTech Extracts LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/912952/hightech-extracts-llc",
        "url": null,
        "linkedin": null,
        "description": "HIGHTECH Extracts is the official North American Supplier of Supercritical Fluid Network (SCFN) Supercritical CO2 Extraction Systems."
    },
    {
        "title": "HK Technologies",
        "internal_link": "https://www.mjbizdirectory.com/company/913279/hk-technologies",
        "url": null,
        "linkedin": null,
        "description": "We make sifting operations better.\n\nHK Technologies offers a full line of vibratory fine mesh screening equipment for wet & dry cannabis sieving and sifting operations.\n\nEase the burden from manual effort to cut and separate trichome (kief) from its stalk. HK's kief shaker equipment sifts trichomes from milled material or smaller unused material to produce an easily collectible, higher potency end-product. Speed up the process and get a better quality sift. Get more money out of your old trim by sifting out trichomes from previous runs. Remove the extensive time and physical labor required when processing wet cannabis using mesh bags. Fine mesh screening equipment allows you to pour the water directly onto the screen deck. The water separates the trichomes and filters through the fine mesh screen, leaving the remaining trichomes on the top of the frame for easy collection. Multi-deck units are available that can catch different sizes, sorting and collecting a range of trichomes in one large batch."
    },
    {
        "title": "Huge Brands",
        "internal_link": "https://www.mjbizdirectory.com/company/913433/huge-brands",
        "url": null,
        "linkedin": null,
        "description": "Huge Brands exists to facilitate opportunity where potential exists. Based in Salt Lake City, Utah, we provide a wire array of services, and specialize in helping you build and capitalize on. Your brand identity through the power of custom merchandise."
    },
    {
        "title": "HUUE",
        "internal_link": "https://www.mjbizdirectory.com/company/912779/huue",
        "url": null,
        "linkedin": null,
        "description": "Clean. Consistent. Convenient. Enhance every moment with Huue Plant-Based Vapes fresh pressed cannabis flower you can take with you as you do life well."
    },
    {
        "title": "I.W. Tremont Co Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/806140/i-w-tremont-co-inc",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Inca Trail Terpenes",
        "internal_link": "https://www.mjbizdirectory.com/company/913249/inca-trail-terpenes",
        "url": null,
        "linkedin": null,
        "description": "Specializing in sourcing custom formulations of pure and potent terpenes."
    },
    {
        "title": "InCon Process Systems LLC.",
        "internal_link": "https://www.mjbizdirectory.com/company/913067/incon-process-systems-llc",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Isolate Extraction Systems Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/913085/isolate-extraction-systems-inc",
        "url": null,
        "linkedin": null,
        "description": "We build best in class Supercritical CO2 Extraction Machines. Our CO2 terpene extraction equipment rapidly produces shelf-ready oils."
    },
    {
        "title": "IWDC - PurityPlus",
        "internal_link": "https://www.mjbizdirectory.com/company/913317/iwdc-purityplus",
        "url": null,
        "linkedin": null,
        "description": "PurityPlus is a nationwide partnership of select independent specialty gas companies, unified under one brand, that guarantees certified-quality product and unparalleled local service."
    },
    {
        "title": "iX Biopharma Ltd",
        "internal_link": "https://www.mjbizdirectory.com/company/913368/ix-biopharma-ltd",
        "url": null,
        "linkedin": null,
        "description": "iX Biopharma is a specialty pharmaceutical company with expertise in drug delivery systems. The company fully integrated business model, which includes drug formulation, clinical studies, regulatory affairs, manufacturing in Melbourne Australia and sales, provides significant operational benefits from lower cost of sales, enhanced operating efficiencies, better quality control, shorter time-to-market and IP protection.\n\niX Biopharma has developed WaferiX‚, a sublingual drug delivery platform technology. It uses WaferiX to repurpose existing drugs for new indications and new dosage forms for better efficacy and side effect profile. Leveraging WaferiX, iX Biopharma has developed a line of medicinal cannabis sublingual wafers which it supplies in Australia to patients through medical channels. Its CBD sublingual wafer, Xativa, is the winner of Australia CBD Product of the Year in 2020."
    },
    {
        "title": "KECO PUMP",
        "internal_link": "https://www.mjbizdirectory.com/company/912840/keco-pump",
        "url": null,
        "linkedin": null,
        "description": "KECO Industrial Pumps, proudly serving North America as the exclusive distributor of Ragazzini Rotho Peristaltic Pumps, delivers versatile, high-performance pumping solutions for a wide array of applications. Our Rotho Peristaltic Hose Pumps, known for their valveless, sealless, and glandless design, can safely handle chemicals, solids up to 50% of the inner diameter, and operate under vacuum conditions. Established in 1954, KECO maintains a legacy of excellence in manufacturing, distribution, and engineering, supported by our commitment to quality workmanship and customer satisfaction. We offer innovative pumping solutions that run dry without damage, provide reversible flow, and support CIP/SIP applications, ensuring reliability and efficiency. Trust KECO to solve your toughest pumping challenges with our top-quality products, competitive pricing, and knowledgeable team."
    },
    {
        "title": "Lab Society",
        "internal_link": "https://www.mjbizdirectory.com/company/913389/lab-society",
        "url": null,
        "linkedin": null,
        "description": "At Lab Society, we are constantly striving to source the highest quality and most affordable scientific equipment on the market saving your business time, capital, and resources. Our goal is to provide the best, most customizable options to fit your company's needs. Contact us for your customized solution today!"
    },
    {
        "title": "LAUDA BRINKMANN",
        "internal_link": "https://www.mjbizdirectory.com/company/913477/lauda-brinkmann",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "LDT Works LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/912930/ldt-works-llc",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Lift and Grow",
        "internal_link": "https://www.mjbizdirectory.com/company/919455/lift-and-grow",
        "url": null,
        "linkedin": null,
        "description": "Lift and Grow revolutionizes commercial cannabis cultivation with our state-of-the-art automated overhead grow light and drying rack systems. With the touch of a button, you can precisely adjust the height of your lights and racks, enhancing both safety and efficiency in your grow facility. Our solutions are designed to maximize ROI by improving product quality and operational workflow. Trusted by leading brands, our patent-pending systems are customizable to fit any room design, ensuring optimal performance and ease of use. Experience the benefits of advanced automation and elevate your cultivation process with Lift and Grow."
    },
    {
        "title": "Lowtemp Industries, LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/913270/lowtemp-industries-llc",
        "url": null,
        "linkedin": null,
        "description": "Lowtemp Industries is the Industry Leader in American Manufactured Solventless Extraction Equipment and Supply. From Personal Applications to International Corporations, Lowtemp Industries has a solution designed by our in house Artesian Hash Makers at every level!"
    },
    {
        "title": "Luna Technologies",
        "internal_link": "https://www.mjbizdirectory.com/company/913545/luna-technologies",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Mach Technologies",
        "internal_link": "https://www.mjbizdirectory.com/company/913471/mach-technologies",
        "url": null,
        "linkedin": null,
        "description": "Mach Technologies is focused on developing cutting edge technologies, processes, and equipment for botanical extraction."
    },
    {
        "title": "Marijuana Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/912755/marijuana-inc",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Media Bros LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/913323/media-bros-llc",
        "url": null,
        "linkedin": null,
        "description": "Media Bros was founded with a scientifically engineered approach to improve existing extraction technologies. We are a group of chemical engineers, mechanical engineers, scientists, professional extractors, and growers. Focusing on performance in quality and throughput, our team set out to change the industry.\nWe also wanted to change how customers were treated and how information was shared. We wanted to become a knowledge center with the best in class customer service in the industry. In creating solutions for the extractor, we help our customers with fast response times, a deep knowledge base, and practical information for every level of extractor out there. Founded in Portland Oregon, we are also bros here to hook you up. We network. We educate. We engage. We put our values ahead of corporate America. We believe that by helping you out, you will keep coming back."
    },
    {
        "title": "MFG Tray Company",
        "internal_link": "https://www.mjbizdirectory.com/company/913142/mfg-tray-company",
        "url": null,
        "linkedin": null,
        "description": "Cannabis Gummy & Soft Gel Drying Trays, Oil Vial Trays, Storage Containers & Customized Options\n\nMFG Cannabis Processing products deliver exceptional durability and performance for all your cannabis processing techniques, from drying to storing. Unlike plastic trays and containers, our glass-reinforced composite products are dimensionally stable and will not rust, bend or sag under heavy loads. And unlike metal, they will not dent, corrode or bend. Thanks to this strength, MFG Tray products can be readily stacked to save space and maximize air flow for quicker drying.\n-TRAYS\n-TOTES\n-CONTAINERS\n-RACKS"
    },
    {
        "title": "Microfluidics International Corporation",
        "internal_link": "https://www.mjbizdirectory.com/company/913056/microfluidics-international-corporation",
        "url": null,
        "linkedin": null,
        "description": "Microfluidics International Corp., a Unit of IDEX MPT, Inc. is a global company producing superior high-shear fluid processors. Our technology delivers unrivalled results in creating uniform nanoemulsions or encapsulations (liposomes). This technology can produce repeatable uniform particle size reduction that gives liquids a transparent appearance which is invaluable in the creation of clear water liquids. They offer increased bioavailability and formulation stability affording enhanced consumer safety. The technology is also guaranteed to scale up so results achieved in the lab can be transferred to full-scale manufacturing. Microfluidizer Processors ensure that every mL of material gets the same high-shear treatment."
    },
    {
        "title": "MJM Install",
        "internal_link": "https://www.mjbizdirectory.com/company/913082/mjm-install",
        "url": null,
        "linkedin": null,
        "description": "Cannabis Greenhouse, Cultivation and Grow Room Construction. Modular, custom solutions. Professional bids & pricing. Call MJM Install today"
    },
    {
        "title": "Mobius",
        "internal_link": "https://www.mjbizdirectory.com/company/913488/mobius",
        "url": null,
        "linkedin": null,
        "description": "Mobius Trimmer revolutionizes the cannabis harvesting process with state-of-the-art industrial trimming machines, buckers, sorters, and mills designed to increase efficiency and product quality. Our automation suite offers GMP-ready solutions for commercial cannabis growers, ensuring consistent, high-quality output that rivals hand-trimmed products. Built with user-friendly features like tool-free disassembly, our equipment is easy to clean and ideal for scalable operations of all sizes. Committed to customer satisfaction, we provide comprehensive workflow consultations, expert installation support, and a risk-free money-back guarantee. Trust Mobius Trimmer for unparalleled performance and innovation in cannabis processing technology. Founded by industry veterans, 100% vertically integrated, and built around world-class engineering, Mobius has taken the market by storm, quickly becoming the number one choice of global cultivators in just three years."
    },
    {
        "title": "MUNCH Machine",
        "internal_link": "https://www.mjbizdirectory.com/company/913341/munch-machine",
        "url": null,
        "linkedin": null,
        "description": "Munch Machine leads the industry in designing and manufacturing top-tier hemp harvesting and bucking equipment. With over 80 years of expertise in the hops industry, our dedication is evident in the development of the Mother Bucker and Double Bucker, machines renowned for their durability and reliability. Proudly crafted in the USA, our equipment uses the highest quality materials to ensure top performance and longevity. We stand by our products with an exceptional warranty and unrivaled customer support, ensuring you receive the best service and value. If you're looking to enhance labor efficiency and protect the quality of your hemp flowers, Munch Machine sets the standard in the industry."
    },
    {
        "title": "NBS Calibrations",
        "internal_link": "https://www.mjbizdirectory.com/company/913429/nbs-calibrations",
        "url": null,
        "linkedin": null,
        "description": "Searching for a Balance, Scale, Pipette or Temperature Calibration Service? We offer both In-House and On-Site services. Click for info on our calibration services."
    },
    {
        "title": "O2VAPE",
        "internal_link": "https://www.mjbizdirectory.com/company/913475/o2vape",
        "url": null,
        "linkedin": null,
        "description": "Safety Tested Lifetime warranty vape pens and Award-Winning Full Ceramic/ All Glass cartridges. #1 in Service & Free Shipping over $74.99."
    },
    {
        "title": "Omega Equipment & Supply",
        "internal_link": "https://www.mjbizdirectory.com/company/913513/omega-equipment-supply",
        "url": null,
        "linkedin": null,
        "description": "Omega Equipment & Supply brings the experience and equipment to cannabis growers, cultivators, processors & dispensary operations. Shop online at Omega store today!"
    },
    {
        "title": "Orange Photonics Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/913049/orange-photonics-inc",
        "url": null,
        "linkedin": null,
        "description": "Orange Photonics empowers cannabis industry professionals with precise and reliable testing technology through its innovative LightLab 3 Cannabis Analyzers. These advanced tools measure up to 19 cannabinoids and provide semi-quantitative terpene data across a variety of cannabis product types. The High Sensitivity model offers unparalleled accuracy, quantifying cannabinoids below 2 ppm, including in edibles. Additionally, Orange Photonics extends its analytical expertise to psychedelics with the LightLab 3 Psychedelics Analyzer, delivering potency measurements for psilocybin, psilocin, and ACO-DMT. By bridging the gap between laboratory precision and field portability, Orange Photonics supports the cannabis and psychedelics industries in ensuring product quality and compliance."
    },
    {
        "title": "PIC Solution Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/913014/pic-solution-inc",
        "url": null,
        "linkedin": null,
        "description": "PIC Solution is a global leader in Supercritical Fluid Technologies and equipment for eco-sustainable CO2 extraction (SFE) and CO2 purification (SFC) with 18+ years working with the Pharma. Our highly reliable instruments enable automated step by step extraction of terpenes, followed by cannabinoids and eliminate the needs for winterization. PIC Solution CO2 separation instruments are used for THC remediation, isolation of individual cannabinoids and removal of impurities such as pesticides and heavy metals. Our unique One Machine Multiple Use‚ systems are designed to do both SFC and SFE. Our services are ranging from concept design to installation after-sales support methods development and toll processing for extraction and separation at research and production scale"
    },
    {
        "title": "PodTronix",
        "internal_link": "https://www.mjbizdirectory.com/company/913541/podtronix",
        "url": null,
        "linkedin": null,
        "description": "PodTronix manufactures customized Build-In Place modular enclosures as well as off-the-shelf Pods intended for cannabis extraction, distillation and general processing.\n\nWe strive to make the safest, cleanest and most reliable C1D1, C1D2 and General Purpose Ventilation enclosures on the market.\n\nAll systems are 3rd-party peer reviewed by fire protection agencies, PSI and more. Most agencies agree that our systems provide the highest quality and best designed protection available.\n\nIn many cases, we exceed UL requirements for a safe working environment and are in the process of becoming the first company in the industry to have our entire product line UL listed.\n\nPodTronix is American-made, utilizing the finest equipment that is UL/cUL, ETL or FM listed/approved to ensure compliant working environments."
    },
    {
        "title": "Prospiant",
        "internal_link": "https://www.mjbizdirectory.com/company/912981/prospiant",
        "url": null,
        "linkedin": null,
        "description": "Prospiant is made up of six heritage companies: Apeks Supercritical, Delta Separations, Rough Brothers, Nexus Corporation, Tetra Indoor and Thermo Solutions. Together, these companies offer over 185 years of experience in the agtech industry. We offer turnkey, full-service installation of cannabis facilities, from site preparation to full outfitting of your cannabis cultivation facility."
    },
    {
        "title": "PURE5 Extraction",
        "internal_link": "https://www.mjbizdirectory.com/company/913050/pure5-extraction",
        "url": null,
        "linkedin": null,
        "description": "PURE5 Extraction is specialized in manufacturing of botanical extraction systems. The company is dedicated on developing natural extraction technology with minimum impact to end product. Utilizing its Low pressure Liquefied Gas Extraction Technology (LPE), PURE5 solution is cheaper, faster and better than the currently most popular CO2, ethanol and butane extraction technologies.\n\nOur revolutionary extraction method, which we're calling ‚ÄòPure 5' process, is significantly safer, faster, cheaper, and produces a higher yield in shorter time than any other conventional method. Our machines are game-changer because it uses low temperature and pressure to process the material, it takes a fraction of the energy as its CO2 competitors, and can handle fragile natural ingredients with little degradation while preserving the natural potency of the oils. PURE5 is actively investing in the field giving more opportunities to good products and manufacturers."
    },
    {
        "title": "PurePressure",
        "internal_link": "https://www.mjbizdirectory.com/company/913390/purepressure",
        "url": null,
        "linkedin": null,
        "description": "We are a USA manufacturer of rosin presses, rosin filter bags, accessories, and all manner solventless extraction equipment. Our shop is located in the heart of Denver, Colorado. Between our team members we have over 20 years of manufacturing expertise and 15 years of oil extraction experience. We want to share our knowledge and industry-leading equipment with you. Our passion for cannabis and our dedication to our customers are the foundations of our success.All of our products are engineered to guarantee the highest yields and the highest quality concentrates possible. We are driven to ensure your extraction process is as efficient and profitable as possible. We're always here to help, so don't hesitate to contact us."
    },
    {
        "title": "Purge Labs",
        "internal_link": "https://www.mjbizdirectory.com/company/913379/purge-labs",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Purpl Scientific Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/912889/purpl-scientific-inc",
        "url": null,
        "linkedin": null,
        "description": "Purpl Scientific is a technology company dedicated to providing accurate, affordable tools that provide insight and intelligence about products and potency."
    },
    {
        "title": "Pyrite Trading Company LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/913095/pyrite-trading-company-llc",
        "url": null,
        "linkedin": null,
        "description": "We specialize in automated solventless extraction/ice water processing, filtration systems, and Membrane-based Winterization and Solvent Recovery."
    },
    {
        "title": "Qsonica",
        "internal_link": "https://www.mjbizdirectory.com/company/912950/qsonica",
        "url": null,
        "linkedin": null,
        "description": "Qsonica manufacturers the Sonicator ultrasonic processor. We offer turn-key solutions for nanoemulsion production that allow anyone to make water soluble THC/CBD products. Create high quality nanoemulsions using the Sonicator along with the NanoOptimizer‚ surfactant package which delivers industry-leading particle size, enhanced bioavailability, and unparalleled stability. Made in the USA with over 50 years of experience."
    },
    {
        "title": "Quadro Engineering Corp.",
        "internal_link": "https://www.mjbizdirectory.com/company/913338/quadro-engineering-corp",
        "url": null,
        "linkedin": null,
        "description": "Quadro Engineering Corp., a Unit of IDEX MPT, Inc. is a high-shear mixer manufacturer that designs and manufactures single-pass, inline high-shear mixing equipment for powder incorporation and dispersion into liquids, in addition to liquid-into-liquid mixing and homogenizing. We pride ourselves on being the mixer manufacturing company that provides the solutions and experience that other businesses cannot.\n\nAdvantages of our breakthrough, single-pass processing technology include:\nReduced batch processing times, maximized use of raw ingredients for less waste, and the highest process repeatability for product quality from lab- scale through to production.\n\nWe continually advance our understanding of the science behind shear energy and dispersion through extensive research and development in our state-of-the-art in-house test center. As a world-leading mixer manufacturer, our innovative and effective solutions exceed expectations and break the traditional assumptions about processing limitations."
    },
    {
        "title": "Root Sciences",
        "internal_link": "https://www.mjbizdirectory.com/company/912957/root-sciences",
        "url": null,
        "linkedin": null,
        "description": "Want to enter the future of the hemp and cannabis industries? Get started with Root Sciences cannabis distillation & THC extraction equipment"
    },
    {
        "title": "Sample Automation LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/912726/sample-automation-llc",
        "url": null,
        "linkedin": null,
        "description": "SAMSMuch like its sister product the SAMS Machine is designed for bulk handling of biomass with a slight variance in automation. With over 15 years of experience in the processing instrumentation industry, Andrew has worked across a multitude of industries, including Pet Food, Tobacco, Snack Foods, Food Oils, Coat Weight for Paper, Particle board and Cardboard. Partnering with companies such as Fritsch GmbH and Stony Microworks, and exhibiting at events such as MJBiz Con, NECANN Shows, Cannabis Industrial Marketplace, and Others across the US and Globe. Sample Automation is an innovative, creative business, offering optimal and bespoke solutions for customers around the globe."
    },
    {
        "title": "Sasquash Rosin Press",
        "internal_link": "https://www.mjbizdirectory.com/company/912905/sasquash-rosin-press",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Sauce Terps",
        "internal_link": "https://www.mjbizdirectory.com/company/912827/sauce-terps",
        "url": null,
        "linkedin": null,
        "description": "We are the industry leading authority and producer of cannabis and hemp derived terpene profiles as well as 100% botanically derived full spectrum strain specific terpene profiles.\nIn recent years a lot of attention has been given to terpene profiles and how they can more accurately predict a plant medical benefits. When THC/CBD and terpenes are consumed together they are said to enhance or amplify their effects. This is commonly referred to as the Entourage effects‚. Terpenes naturally occur in cannabis but many extraction processes can lead to a loss of these natural compounds but luckily can be reintroduced to your concentrates using our terpene blends.\nWhen you are ready to take your THC or CBD product to the next level, we here at Medical Terpenes are ready to help. Don't waste precious time and resources trying to reinvent the wheel. Medical Terpenes Ph.D. chemists have spent over 6 years with countless trial and error perfecting our terpene profiles and that my friends is all we do. Our goal is not only to present superior terpene profiles, but to bring your product to life with an exquisite full spectrum experience to ultimately amaze you and your clients alike.\nMedical Terpenes is designed with the end user in mind. We currently carry over 50 strain specific full spectrum profiles for you to select from. Each of our individual profiles contain over 100 terpene isolates to provide unrivaled flavor and fragrance. If you don't see what you need or want, we can customize any flavor profile to fit your needs. Let your imagination run wild."
    },
    {
        "title": "Shivvers Manufacturing, Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/913136/shivvers-manufacturing-inc",
        "url": null,
        "linkedin": null,
        "description": "Shivvers is a leading manufacturer grain drying products including automatic grain drying, counter flow drying, and produces a quality grain dryer solution. One of the first innovations was the tapered sweep auger in 1968, this became the basis for the first commercially successful Continuous Counter-Flow Grain Drying system. In 1984, Shivvers Manufacturing transformed the industry again with the development of the COMPU-DRY™, the first computerized control unit for drying grain. Today, Shivvers leads the world in automated Continuous Counter-Flow Grain Drying systems. Today, Shivvers remains a family owned and operated business with Carl Shivvers as President."
    },
    {
        "title": "STERIS",
        "internal_link": "https://www.mjbizdirectory.com/company/913204/steris",
        "url": null,
        "linkedin": null,
        "description": "STERIS Instrument Management Services is a surgical device and instrument management and consulting company."
    },
    {
        "title": "STM Canna",
        "internal_link": "https://www.mjbizdirectory.com/company/913020/stm-canna",
        "url": null,
        "linkedin": null,
        "description": "Shop the Leading Manufacturer of the Industry Leading #1 Selling RocketBox Commercial Pre-Roll Machines, the Revolution Industrial Cannabis Grinders. STM Canna revolutionizes the cannabis industry with advanced, modular pre-roll machines designed to optimize and automate your production workflow. Trusted by top cannabis brands, our cutting-edge solutions like the RocketBox and Atomic Closer deliver unparalleled speed and efficiency, filling and closing up to 72 pre-rolls in just seconds. We pride ourselves on providing scalable and flexible systems that grow with your business, ensuring faster ROI and reduced labor costs. Our comprehensive product range—from grinders to infusers—guarantees premium quality and consistency, elevating your pre-roll production to new heights. Experience the STM Canna advantage and join a growing list of satisfied clients who benefit from our innovative automation solutions."
    },
    {
        "title": "Tecogen",
        "internal_link": "https://www.mjbizdirectory.com/company/913094/tecogen",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "THC Living",
        "internal_link": "https://www.mjbizdirectory.com/company/912900/thc-living",
        "url": null,
        "linkedin": null,
        "description": "After seven years of success with the popular CBD Living brand, the creators founded THC\nLiving to bring the same high-quality wellness products to the cannabis market. THC Living\nprestigious in-house scientists use three proprietary nanotechnology manufacturing processes -\nWater Soluble, Skin Retention and Self-Emulsifying - to create beverages, topicals and oils with\nenhanced bioavailability."
    },
    {
        "title": "The DigiVac Company",
        "internal_link": "https://www.mjbizdirectory.com/company/913088/the-digivac-company",
        "url": null,
        "linkedin": null,
        "description": "Providing precise measurement & control of vacuum systems for 35+ years, DigiVac has earned its claim as the industry leader in all-things vacuum.\n\nArometrix creates groundbreaking real-time molecular analytical technologies for botanical extraction. Find out what your Extraction needs from you!"
    },
    {
        "title": "The Terpene Store",
        "internal_link": "https://www.mjbizdirectory.com/company/913468/the-terpene-store",
        "url": null,
        "linkedin": null,
        "description": "Terpenes for sale! Shop The Terpene Store wide selection of terpenes to buy online and experience the craft of clean, flavorful, high quality terpenes today."
    },
    {
        "title": "Thermaline",
        "internal_link": "https://www.mjbizdirectory.com/company/750002/thermaline",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Triminator",
        "internal_link": "https://www.mjbizdirectory.com/company/913035/triminator",
        "url": null,
        "linkedin": null,
        "description": "Everything we do at Triminator starts with the cannabis farmer. Our story began in Northern California when a few grower friends asked us to create a machine that could trim their premium flower at a commercial scale. From our humble start, we worked tirelessly to engineer equipment to help fulfill the increasing needs of the grower, expanding our product line to encompass the entire process from the field to the final dried product."
    },
    {
        "title": "TruSteel",
        "internal_link": "https://www.mjbizdirectory.com/company/913339/trusteel",
        "url": null,
        "linkedin": null,
        "description": "TruSteel works with you to deliver integrated & automated extraction systems and mid- to large-scale processing equipment. Learn more & contact us today."
    },
    {
        "title": "VapeEZ USA",
        "internal_link": "https://www.mjbizdirectory.com/company/912887/vapeez-usa",
        "url": null,
        "linkedin": null,
        "description": "Founded in 2015, VapeEZ is the leading high-tech enterprise that focuses on the research and application of Electronic atomization technology. With R&D team from US, ISO certified dust-free workshop in China, VapeEZ will provide with you integrated services from product design to production."
    },
    {
        "title": "Vaper Tip",
        "internal_link": "https://www.mjbizdirectory.com/company/913377/vaper-tip",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "VaporTech USA",
        "internal_link": "https://www.mjbizdirectory.com/company/913316/vaportech-usa",
        "url": null,
        "linkedin": null,
        "description": "We carry all your vape needs from Disposable Vapo to our Slim Pens. We have a whole line of E-Juice Also!!!"
    },
    {
        "title": "Welch Vacuum by Ingersoll Rand",
        "internal_link": "https://www.mjbizdirectory.com/company/913174/welch-vacuum-by-ingersoll-rand",
        "url": null,
        "linkedin": null,
        "description": "We have an extensive portfolio of vacuum pumps including diaphragm pumps, rotary vane pumps, piston pumps, and turbomolecular pumps."
    },
    {
        "title": "Xtra Laboratories",
        "internal_link": "https://www.mjbizdirectory.com/company/913314/xtra-laboratories",
        "url": null,
        "linkedin": null,
        "description": "Xtra Laboratories is an industry leader in cannabis extraction techniques, offering a comprehensive selection of high-quality terpenes and custom flavor profiles. Our innovative product lineup includes live resin, full-spectrum blends, and botanical terpenes, all crafted to provide an exceptional cannabis experience. Committed to purity and precision, our products are free from fillers and synthetics, and are manufactured in GMP facilities to ensure the highest standards. We collaborate with industry leaders to drive innovation and advance the future of cannabis. Elevate your experience with Xtra Labs’ meticulously crafted terpenes and flavors for an unparalleled journey of taste and aroma."
    },
    {
        "title": "Xtractor Depot",
        "internal_link": "https://www.mjbizdirectory.com/company/913521/xtractor-depot",
        "url": null,
        "linkedin": null,
        "description": "Shop Xtractor Depot for closed loop extraction systems, short path distillation equipment, vacuum ovens, lab accessories, and everything else needed for extractions."
    }
]