[
    {
        "title": "NAVAC Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/913505/navac-inc",
        "url": "https://www.navacvacuum.com/",
        "linkedin": "https://www.linkedin.com/company/navac-inc/",
        "description": "NAVAC, VACUUM SOLUTIONS FOR EVERY INDUSTRIAL CHALLENGE\n\n⦿ DESIGNED & BUILT TO WITHSTAND THE TOUGHEST INDUSTRIAL PROCESSES ⦿\nNAVAC is a global manufacturer that has dedicated over 30 years to the R&D and manufacturing of Industrial Vacuum solutions and HVAC/R tools.\nNAVAC draws upon its commitment to technical innovation, strong customer service, and robust R&D to deliver solutions offering unsurpassed efficiency, accuracy, and durability. Offering a full product line of industrial vacuum pumps, accessories, and customized solutions. NAVAC’s product portfolio is designed with three focuses in mind: Performance, Reliability, and Service. With NAVAC, we empower our customers to drive innovation for the future while helping them NAVIGATE advanced vacuum technology challenges and choices.\n\n⦿ APPLICATION FOR AN EXTENSIVE RANGE OF KEY INDUSTRIES ⦿\nNAVAC is comprised of vacuum technology experts who understand the sector’s ever-evolving landscape and the challenges it presents. Our vacuum pump solutions cater to a wide, extensive range of applications. Discover how NAVAC can empower you with Performance, Reliability, and Service.\n\n⦿ PERFORMANCE. RELIABILITY. SERVICE. DRIVEN BY YOUR SUCCESS ⦿"
    },
    {
        "title": "Total Grow Control",
        "internal_link": "https://www.mjbizdirectory.com/company/913388/total-grow-control",
        "url": "https://www.totalgrowcontrol.com/",
        "linkedin": "https://www.linkedin.com/company/total-grow-control",
        "description": "Total Grow Control revolutionizes agriculture with autonomous, AI-powered technology designed for precision and productivity. Our advanced control systems offer real-time monitoring and remote management of environmental conditions, nutrient delivery, and cultivation processes, ensuring optimal growth and maximum yields. Tailored to the unique specifications of each operation, our data-driven solutions analyze and optimize every aspect of your growth, from temperature and humidity to light and nutrient levels. The Eden Nutrient Delivery Series and smart irrigation systems exemplify our commitment to innovative and sustainable farming practices. With Total Grow Control, you can effortlessly achieve unparalleled efficiency and quality in your agricultural endeavors."
    },
    {
        "title": "AgeChecker.Net",
        "internal_link": "https://www.mjbizdirectory.com/company/918377/agechecker-net",
        "url": "https://www.agechecker.net/",
        "linkedin": null,
        "description": "AgeChecker.Net is dedicated to providing an easy-to-use service for e-commerce age verification. We want to make it simple for businesses to comply with the latest regulations while continuing to grow their sales.\n\nOur solution aims to be as unobtrusive as possible so that you don’t lose customers over age verification. We utilize high quality data sources that allow us to verify the identity of more than 90% of the US population within seconds just from their name, address, and date of birth.\n\nAs a customer, you can access our installation guides, request help, and view your age verification metrics. We offer professional installation and development services in order to make sure our solution works on as many platforms and websites as possible.\n\nPlease contact us if you have any questions, we want to work with you and be as transparent as possible in our age verification process."
    },
    {
        "title": "Paylient HR",
        "internal_link": "https://www.mjbizdirectory.com/company/925945/paylient-hr",
        "url": "https://www.paylient.com/",
        "linkedin": null,
        "description": "At Paylient, we specialize in providing comprehensive HR solutions tailored exclusively for the cannabis industry.\n\nOur mission is to level the playing field, offering cannabis businesses the same caliber of services and opportunities available in other sectors. By navigating the intricate employee regulatory landscape, we ensure adherence to evolving labor laws and industry-specific regulations. Our deep passion and insight into the specific challenges and opportunities in this sector, coupled with key partnerships with top-tier suppliers, set us apart. We handle the complexities of HR, so you can focus on scaling your business and achieving operational efficiency.\n\nWhy Choose Paylient?\n\n- Tailored HR Solutions: Customized to meet the unique demands of the cannabis industry, with over 250 years of combined experience in HR, workers’ compensation, and benefits.\n- Compliance Assurance: Keeping your business compliant and alleviating administrative burdens across all 50 states. We've secured strategic alliances with premium suppliers and two A-rated carriers, offering access to cutting-edge HR solutions.\n- Shared-Liability Approach: Bringing our expertise in payroll, HR, and regulatory compliance to your business so you can concentrate on growth.\n\nVisit www.paylient.com to learn more and experience the difference a dedicated HR partner can make."
    },
    {
        "title": "BizReps 420",
        "internal_link": "https://www.mjbizdirectory.com/company/926364/bizreps-420",
        "url": "https://bizreps420.com/",
        "linkedin": null,
        "description": "Welcome to BizReps 420! We are a team of Engineers & Cannabis Sales Professionals specializing in delivering U.S. Made, cutting-edge LED Grow Lights, Power Outage Mitigation, and Cannabis Homogenizers for the cannabis growing industry. We are on a mission to transform the cannabis industry with solutions that enhance productivity and sustainability while being cost-effective.\n\nOur Mission at BizReps 420 is to provide sales outsourcing services to legal cannabis growers and processors by offering the highest quality LED Grow Lights, Cannabis Homogenizers/Mixers, and Off the Grid Power Solutions. We are a manufacturing representative for several U.S. made products focused on improving the growing and processing operations in the legal cannabis industry. We represent some of the top manufacturing companies in the U.S. and work with our clients to understand their needs, assist them in selecting and selling the right equipment at a competitive price to improve their business."
    },
    {
        "title": "KIMTRON Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/351073/kimtron-inc",
        "url": "https://www.kimtron.com/cannabis-irradiators",
        "linkedin": "https://www.linkedin.com/company/kimtron-inc-cannabis-sterilization-division",
        "description": "Kimtron, Inc., founded in 1991, excels as an industry leader in delivering superior industrial X-ray products and services across a vast array of sectors, including medical, biological research, cannabis, aerospace, metal casting, defense, and homeland security. As an ISO 9001:2015-certified engineering and manufacturing firm, we pride ourselves on our history of strong customer partnerships, reliably delivering high-performance, advanced X-ray solutions to over 500 clients worldwide. Our best-in-class, patented X-ray technologies combined with our commitment to quality and precision reflect in our comprehensive offerings ranging from biological irradiators and X-ray generators to custom high-voltage power supplies. Our responsive field service, performance excellence, and repair center capabilities ensure we meet customer needs swiftly and effectively, underscoring our dedication to innovation and service. Kimtron's devotion to pushing the boundaries of X-ray technology, along with our robust responsiveness to market demands, we focus on rapid technology deployment, responsive service, and creating value to enhance your competitiveness in your respective fields. We Grow with You."
    },
    {
        "title": "CannaBI by Dimensional Insight",
        "internal_link": "https://www.mjbizdirectory.com/company/915467/cannabi-by-dimensional-insight",
        "url": "https://www.cannabis.dimins.com/",
        "linkedin": "https://www.linkedin.com/company/dimensional-insight/",
        "description": "Learn how you can use business intelligence and analytics to help manage data in complex and highly regulated industries. We are a company deeply committed to the success of our customers. In fact, the central philosophy of Dimensional Insight is to support our customers and our employees, since they, in turn, will support the company. Everyone at Dimensional Insight—from our technology developers, to our support staff, to our consultants, to our executive team—is solely focused on driving results for the companies we work with.\n\nThe legalization of cannabis in many states has presented businesses with a unique opportunity to explore a new and exciting industry. However, every opportunity also comes with its own set of novel challenges. In order to navigate the complex world of cannabis, businesses need access to accurate and up-to-date information that provides them with the insights necessary to succeed. Dimensional Insight’s end-to-end platform includes advanced analytics and data visualization features to help you transform your potential into reality."
    },
    {
        "title": "SeedMasters.com",
        "internal_link": "https://www.mjbizdirectory.com/company/921222/seedmasters-com",
        "url": "https://seedmasters.com/",
        "linkedin": null,
        "description": "Here at SeedMasters.com, we specialize in offering a diverse range of high-quality souvenir cannabis seeds by collaborating with numerous reputable seed banks to ensure discreet, secure, and reliable sourcing for our customers. Our user-friendly online platform is designed to help businesses efficiently search and refine product selections based on specific needs such as feminized or auto-flowering seeds. We are committed to customer satisfaction, providing detailed information from trusted sources and continuously expanding our inventory with seeds from the world’s top producers. We serve customers throughout the UK and Europe, providing a reliable service backed by credible information.\n\nOur personalized customer support ensures that if a specific product is not listed on our website, businesses can reach out to us directly for tailored assistance and precise product details. We hope you find exactly what you are looking for here at SeedMasters.com! However, if you can’t find what you need on the website, that doesn’t mean we can’t get it!"
    },
    {
        "title": "LabWare Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/562376/labware-inc",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Qredible, Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/920363/qredible-inc",
        "url": null,
        "linkedin": null,
        "description": "Qredible, Inc. builds enterprise compliance management software, Quality Management Systems (QMS), and supply chain automation for highly regulated industries like CBD, nutraceuticals, hemp, cannabis, supplements, and peptides. Qredible's compliance-driven regulatory technology services connect your entire supply chain for safer digital commerce. Our unique software ecosystem automates compliance monitoring, COA management, integrates high-risk payment processors, offers AI-powered 24/7 risk management and audit management, and enables blockchain-secured business verification for your regulators and financial partners.\n\nBusinesses use our Q-Trust blockchain-secured digital registry of compliance data to speed up due diligence and readily identify reliable and quality CBD, hemp, hemp-derived, and other high-risk products. We enable transparency for: Hemp and Cannabis Growers, Manufacturers, Distributors, Wholesalers, and Retailers.\n\nThe automotive industry has CarFax to give the consumer unbiased information about the quality and safety of the product they may buy. The medical industry has the FDA to protect the consumer from unfounded product claims and mis-labeled products. Now the CBD, hemp, nutraceutical, supplements, and cannabis industries have Qredible. Our technology doesn't tell the supply chain partner or consumer what product to purchase, but we do provide validation and verification of the brand quality and product safety. If the brand or highly regulated product is Q-verified, then all parties can trust in the transaction.\n\nQredible's Q-Transact system (part of Q-Trust) is a high risk business e-commerce integrated compliance system. Highly regulated products can be deployed, sold, fulfilled, and managed online with the system. Our users can launch e-commerce storefronts in minutes with our proprietary, automated store builder. Q-Transact allows you to create compliant labels and 3D mockups. The Q-Transact APIs are designed to facilitate order fulfillment and shipment through the Q-Transact App for e-commerce businesses hosting their storefronts on platforms such as WooCommerce, Shopify, Wix, Magento, etc. In addition to accessing white-labeled product information in Q-Transact, these APIs also provide status updates for orders and shipments fulfilled by private label distributors on the Q-Transact's platform.\n\nThe Q-Monitor module within the Q-Trust platform is designed to enable the efficient tracking, monitoring, and management of counter-party risk. The system is currently implemented for banks, merchant card processors, and brands within the Cannabis and CBD / Hemp industries. However, the system monitors multiple company types (i.e., nutraceuticals) and is not just limited to CBD / Hemp and Cannabis brands. Q-Monitor eliminates manual tracking via automated monitoring of your websites and your inventory against products that are not permitted for sale in certain states, or in violation of your merchant processing or banking relationship. Advanced AI algorithms scan text, images, and audiovisual content across your digital marketing platforms seeking state-specific potential violations. Alerts occur in real-time helping your company avoid FDA letters, FTC fines, fees and penalties, and class-action litigation. Real-time analysis and automated monitoring ensure that your company or suppliers meet the complex regulatory burden of each state where you conduct business.\n\nQredible's product compliance, supply chain, and QMS platform serve: CBD, hemp, and cannabis, nutraceuticals and wellness supplements, hemp-derived products, pharmaceuticals, merchant banking, financial institutions, telehealth, healthcare and life sciences, medical devices, food and beverage, consumer products, construction, government and public sectors.\n\nQredible builds advanced compliance management software technology to help your highly regulated company protect your brand and grow your business via safer, trustworthy digital commerce."
    },
    {
        "title": "Velosio",
        "internal_link": "https://www.mjbizdirectory.com/company/912991/velosio",
        "url": null,
        "linkedin": null,
        "description": "Cannabis cultivators, processors and distributors can maximize profits through greater efficiency across operations (cultivation, production, supply chain and sales) by deploying a modern technology platform, focused on the unique needs of the cannabis industry. SilverLeaf, built on Dynamics 365 Business Central, can help you better understand production planning and requirements, inventory quality and availability by strain, sales and order fulfillment, profitability, and much more. Technology and industry experts from Velosio understand the challenges you face and can help you reach your goals through the use of technology."
    },
    {
        "title": "Onfleet",
        "internal_link": "https://www.mjbizdirectory.com/company/915408/onfleet",
        "url": null,
        "linkedin": null,
        "description": "Power your deliveries with the world's most advanced logistics software. Onfleet is the trusted last mile delivery solution for thousands of companies across dozens of industries including legal cannabis, food and beverage, retail, e-commerce, furniture, pharmacy and more."
    },
    {
        "title": "Evolve Garden Supply",
        "internal_link": "https://www.mjbizdirectory.com/company/927108/evolve-garden-supply",
        "url": null,
        "linkedin": null,
        "description": "Evolve Garden Supply is your go-to destination for top-quality hydroponics and garden supplies tailored for professional growers. Our extensive product range includes advanced lighting solutions, premium nutrients and plant care essentials, environmental control systems, and state-of-the-art hydroponic equipment. We are committed to helping you achieve unparalleled growth and yield with our selection of reliable products from leading brands. With a focus on sustainability and innovation, Evolve Garden Supply supports growers with energy rebate and incentive programs to maximize efficiency and reduce costs. Join a community of successful cultivators who trust Evolve Garden Supply for their gardening and hydroponic needs."
    },
    {
        "title": "Paybotic",
        "internal_link": "https://www.mjbizdirectory.com/company/920135/paybotic",
        "url": null,
        "linkedin": null,
        "description": "We are a team of experienced payment professionals who have spent the past few years on formulating and strengthening our network of domestic and international partners to provide solutions suitable for nearly every type of legal high-risk business. Whether your business is in need of debit card processing, ACH processing, check service or any other payment solution, we customize a high-risk payment solution by selecting the best partner options to suit your exact needs. We take pride in our expert customer service while finding you the best fit for your cannabis payment processing needs. Contact us today to learn about our solutions and how we can help you grow your business.\n\nOur account specialists will be happy to assess your needs and answer your questions without obligation."
    },
    {
        "title": "CannVerify",
        "internal_link": "https://www.mjbizdirectory.com/company/912850/cannverify",
        "url": null,
        "linkedin": null,
        "description": "Leaders in anti-counterfeit and information delivery for the cannabis and hemp industry. Patented technology. Founded in 2017. CannVerify offers a leading anti-counterfeit and brand protection platform specifically designed for the cannabis and hemp industry. Our comprehensive system increases customer trust and enhances brand transparency by providing accurate product information and real-time lab results through our innovative LiveLabel technology. Companies of all sizes, from startups to multi-state operators, use our robust solutions to safeguard their products and connect directly with their customers, while also offering loyalty rewards to enhance customer engagement. With seamless integrations with world-class software like Confident Cannabis, Shopify, and Flourish Seed-to-Sale, CannVerify ensures automated workflows and efficient information delivery. Our mission is to protect brands and provide consumers with safe, verified cannabis and hemp products through a secure and user-friendly platform."
    },
    {
        "title": "Genuinity by Sajware Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/912777/genuinity-by-sajware-inc",
        "url": null,
        "linkedin": null,
        "description": "Genuiniti helps consumers distinguish authentic products from counterfeits. We are on a mission to protect consumers from counterfeit products by letting them verify the authenticity of products manufactured by brands that equip their products with wireless tags supplied by and activated with Genuiniti platform.\n\nGenuinity by Sajware Inc. is the world's most advanced anti-counterfeiting platform, offering a cutting-edge solution to the global problem of counterfeit goods worth trillions of dollars. Our robust technology protects hundreds of millions of dollars in retail value by seamlessly securing and enhancing most types of existing packaging with smart tags and innovative mobile apps. We specialize in providing a rich feature set tailored to the needs of industries most affected by counterfeiting, ensuring product authenticity and consumer trust. Our mission is to safeguard brands and consumers through our proven, end-to-end solution that combines activation, verification, and promotion functionalities. As a leader in anti-counterfeiting technology, Genuiniti continuously advances its offerings to meet the evolving challenges of the market."
    },
    {
        "title": "EBS Ink Jet Systems USA",
        "internal_link": "https://www.mjbizdirectory.com/company/750582/ebs-ink-jet-systems-usa",
        "url": null,
        "linkedin": null,
        "description": "EBS Ink-Jet Systems is a pioneering manufacturer and supplier of high-performance industrial ink-jet printers and consumables, serving a diverse range of industrial and service sectors globally. With a rich history spanning over 47 years, we specialize in providing intricate solutions for contact-free coding of texts, graphics, barcodes, dates, and numbers. Our product lineup includes small character printing, large character printing, mobile printing, and high-resolution printing, ensuring optimal and versatile marking capabilities. Committed to innovation and quality, our cutting-edge technology guarantees consistent, high-standard results, with dedicated support available through our extensive network in over 60 countries. Choose EBS Ink-Jet Systems for reliable, advanced, and efficient product marking solutions that enhance your operational efficiency and brand integrity."
    },
    {
        "title": "240 Logistics",
        "internal_link": "https://www.mjbizdirectory.com/company/929890/240-logistics",
        "url": null,
        "linkedin": null,
        "description": "240L offers a proprietary technology, FlyWheel, designed to provide transparency throughout the cannabis supply chain and to drive inventory management efficiencies.\n\nFlyWheel streamlines the cannabis supply chain with real-time insights through easy-to-understand dashboards and reports. Seamlessly integrated with software like Metrc, Dutchie, Treez, Flourish, QuickBooks, and Salesforce, FlyWheel provides the visibility and insights needed for informed decision-making and timely support."
    },
    {
        "title": "Bughut",
        "internal_link": "https://www.mjbizdirectory.com/company/919376/bughut",
        "url": null,
        "linkedin": null,
        "description": "BugHut revitalizes your garden and house plants with a range of premium, easy-to-use products that deliver vibrant, healthy results every time. Our customers rave about how our solutions, like Flower Power and De-Stressor, help their gardens not just survive but thrive, even in extreme temperatures. Whether you’re growing flowers for a special occasion or keeping your favorite houseplants happy, BugHut ensures remarkable growth and longevity. Trusted by plant lovers for bringing sick plants back to life and aiding smooth transitions, our products make plant care simple and effective. Join the community of satisfied gardeners who’ve seen their plants dance with joy and bloom beautifully with BugHut."
    },
    {
        "title": "Biochar Now LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/915495/biochar-now-llc",
        "url": null,
        "linkedin": null,
        "description": "Biochar Now is a trailblazer in the biochar industry, boasting advanced engineering, top-tier manufacturing, and a dedicated sales team focused on producing and distributing high-quality biochar on a large scale. Our innovative kiln-based technology ensures efficient and consistent biochar production, suitable for a wide range of applications including specialty agriculture, land reclamation, odor control, and algae removal. Committed to environmental sustainability, Biochar Now contributes significantly to climate control efforts by providing a reliable solution for carbon sequestration. Our robust operational framework and exceptional product quality have earned us numerous certifications and features, further solidifying our reputation as industry leaders. Located in Berthoud, CO, we are passionate about harnessing the transformative potential of biochar to benefit the world."
    },
    {
        "title": "Surna Cultivation Technologies",
        "internal_link": "https://www.mjbizdirectory.com/company/915455/surna-cultivation-technologies",
        "url": null,
        "linkedin": null,
        "description": "Surna specializes in providing innovative HVAC equipment and engineering solutions tailored for cannabis and controlled environment agriculture facilities. With over 16 years of experience, we offer energy-efficient technologies and comprehensive services—from facility design and architectural planning to installation and maintenance—that optimize your growing environment. Our range of products includes advanced chillers, air handlers, dehumidifiers, and cutting-edge controls to ensure precision in climate management. Dedicated to supporting growers from project inception to post-production, Surna helps you achieve higher yields and operational efficiency. Trust Surna to be your one-stop-shop for creating and maintaining successful indoor cultivation facilities."
    },
    {
        "title": "Grow Glide",
        "internal_link": "https://www.mjbizdirectory.com/company/913540/grow-glide",
        "url": null,
        "linkedin": null,
        "description": "Our industry-leading, grower-focused vertical and mobile racks increase ROI and help cultivators scale their production while letting them focus on what they do best - delivering the highest quality cannabis. But we didn't stop there. Grow Glide's new AirGlide system rewrites the book on cultivation airflow as it effortlessly outperforms current market solutions and ensures plants are receiving the healthy climate conditions that are critical to a successful grow.\n\nOur Grow Deck workflow platform provides cultivation teams with the strongest multi-tier deck solution and the peace of mind that they can safely give plants on any level the attention they need. With Grow Glide, growers have what they need to take elevate their cultivation to new heights."
    },
    {
        "title": "Grassroots Fabric Pots",
        "internal_link": "https://www.mjbizdirectory.com/company/913528/grassroots-fabric-pots",
        "url": null,
        "linkedin": null,
        "description": "Bring soil to Life with Grassroots! We manufacture wildly innovative living soil growing containers, microbial inoculants and microbes foods. Grassroots Fabric Pots is dedicated to revolutionizing the way gardeners and cultivators nurture their plants by designing high-quality, durable fabric pots and beds that promote healthy soil ecosystems. Our products, trusted by industry leaders, provide optimal aeration and drainage, fostering vigorous root growth without root circling. Beyond fabric pots, we offer a range of microbe and plant food products to enhance plant health and yield. As a community of enthusiasts and professionals passionate about soil vitality, Grassroots Fabric Pots supports growers with customizable solutions and bulk orders tailored to specific needs. Join us in creating sustainable growing environments for the betterment of the soil and the plants it supports."
    },
    {
        "title": "Twister Trimmer by Keirton Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/913512/twister-trimmer-by-keirton-inc",
        "url": null,
        "linkedin": null,
        "description": "Twister Trimmer leads the industry in providing innovative and efficient post-harvest solutions for cannabis, marijuana, and hemp producers. Our advanced trimming machines, including the Twister T2, T4, and the industrial-grade T-Zero, are designed to maximize productivity and ensure top-quality output while preserving the natural beauty of the flower. With our cutting-edge SoftTumble technology and robust design, our machines reduce labor costs and downtime, allowing producers to scale their operations efficiently. Twister also offers a comprehensive range of products such as the BatchOne Pro and Marvel AI Sorter to meet varying production needs, from small batches to large commercial operations. Trust Twister Trimmer for exceptional engineering, outstanding design, and unparalleled performance in every trimming and sorting solution we offer."
    },
    {
        "title": "MtoZ Biolabs",
        "internal_link": "https://www.mjbizdirectory.com/company/928923/mtoz-biolabs",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Riococo",
        "internal_link": "https://www.mjbizdirectory.com/company/913487/riococo",
        "url": null,
        "linkedin": null,
        "description": "RIOCOCO-MMJ, a subsidiary of Ceyhinz Link Inc, is a premier manufacturer and supplier of 100% organic coconut coir products, dedicated to the hydroponic, vertical farming, and cannabis cultivation industries. With over 19 years of experience and a presence in 65 countries, we provide custom-blended coco coir that fosters faster, stronger, and healthier root growth. Our product range includes easily hydratable propagation plugs, starter blocks, and ready-to-use grow bags, all designed to streamline the cultivation process from cloning to flowering stages. Committed to quality, our coco coir is super-washed and steam-sterilized, ensuring it's free from harmful heavy metals, bacteria, and fungi. Trust RIOCOCO-MMJ for your cultivation needs and experience the power of nature with our biodegradable, renewable, and non-toxic growing mediums."
    },
    {
        "title": "Agrowtek Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/913461/agrowtek-inc",
        "url": null,
        "linkedin": null,
        "description": "Agrowtek Inc. specializes in advanced grow controls designed for greenhouses, hydroponics, and indoor growing, providing industry-leading solutions for climate, nutrient dosing, and irrigation management. Our innovative products, such as the GrowControl Series and BDX BatchMatic Fertigation System, automate and optimize critical cultivation processes, ensuring maximum efficiency and yield. Proudly designed and manufactured in the USA, our offerings include precise liquid level sensors, durable irrigation valves, and advanced quantum light spectrometers. With a commitment to quality and performance, we integrate intelligent sensors and controllers that support MODBUS communication protocols, enabling seamless connectivity with PLCs. Trust Agrowtek for reliable, high-quality cultivation control systems that elevate your growing operations."
    },
    {
        "title": "Enrichment Systems Nanobubble Technology",
        "internal_link": "https://www.mjbizdirectory.com/company/913443/enrichment-systems-nanobubble-technology",
        "url": null,
        "linkedin": null,
        "description": "Enrichment Systems manufacturers equipment that uses Nanobubble technology to infuse any gas into liquid.\nOur primary focus is improving plant, crop, and infrastructure health by increasing dissolved oxygen in water for use in Agriculture.\nWe are a leader in disruptive Nanobubble gas irrigation solutions directed to indoor, controlled environment, and greenhouse facilities.\nEnrichment Systems irrigation products boost productivity and put your water to work!"
    },
    {
        "title": "HortGrow Solutions LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/913441/hortgrow-solutions-llc",
        "url": null,
        "linkedin": null,
        "description": "Manufacturer of precision coco coir grow bags, grow cubes, and bulk coco potting mixes for Berries, Hemp, Vegetables, Flowers and Nurseries. HortGrow products are used worldwide by professional growers in indoor facilities, greenhouses and outdoor environments. HortGrow delivers quality products at affordable costs"
    },
    {
        "title": "GRD",
        "internal_link": "https://www.mjbizdirectory.com/company/913430/grd",
        "url": null,
        "linkedin": null,
        "description": "e-Gro\nEvery decision you make has an impact on the health and performance of your crop. e-Gro is a platform that collects and analyses comprehensive data on Rootzone and Climate conditions from throughout your facility to give you the data you need to make the best decisions. Having insights available 24/7 from anywhere you can access the internet gives you the information you need to optimize your growing strategy or diagnose problems exactly when you need to. The result: a comprehensive and clear status of your crop growth at a glance. With e-Gro, you are in control and empowered to make informed decisions to optimize your production and improve yields.\nWe supply innovative and sustainable growing media solutions. Since we invented hydroponic stone wool growing in 1969 we have continuously evolved the Grodan approach to sustainable growing."
    },
    {
        "title": "Xtreme Gardening / Reforest Technologies International",
        "internal_link": "https://www.mjbizdirectory.com/company/913404/xtreme-gardening-reforest-technologies-international",
        "url": null,
        "linkedin": null,
        "description": "Industry-proven for over fourteen years, Xtreme Gardening focuses on providing its customers with the highest quality and most affordable biological products on the market. With an emphasis on freshness and consistency, Xtreme Gardening continues to deliver the best-in-class mycorrhizal inoculants and beneficial bacteria. At Xtreme Gardening, we are committed to advancing microbial evolution to ensure our customers experience superior plant growth and health."
    },
    {
        "title": "HOVE International Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/913397/hove-international-inc",
        "url": null,
        "linkedin": null,
        "description": "HOVE International Inc. is a leader in delivering state-of-the-art automation and internal transport solutions for greenhouse operations across North America. For over 31 years, we have specialized in providing customizable systems, such as 2D-shuttles and automated irrigation booms, to enhance productivity and efficiency for growers of potted plants, young plants, cut flowers, and more. Our comprehensive services include not only the design and installation of innovative solutions but also ongoing support and optimization to ensure peak performance. By working closely with customers, we tailor our offerings to meet both current needs and future expansions, ensuring sustainable growth and operational excellence. As the sole distributor of Logiqs products in North America, HOVE International is your trusted partner for cutting-edge horticultural automation."
    },
    {
        "title": "Hydra Unlimited",
        "internal_link": "https://www.mjbizdirectory.com/company/913355/hydra-unlimited",
        "url": null,
        "linkedin": null,
        "description": "Hydra Unlimited specializes in innovative, high-performance hydroponic grow systems designed to maximize your yield efficiently and sustainably. With over 40 years of expertise, our HydraMax product line caters to home, professional, and commercial growers, offering advanced recirculating deep water culture (RDWC) technology. Our patented Root Halo media-less netpot ensures superior root growth and stability, eliminating the need for traditional grow media and reducing the risks of pathogens. We pride ourselves on providing eco-friendly, American-made solutions that enhance cultivation through optimal nutrient distribution and reduced maintenance needs. Experience unparalleled growth and operational support with Hydra Unlimited's top-tier hydroponic systems."
    },
    {
        "title": "Optic Foliar",
        "internal_link": "https://www.mjbizdirectory.com/company/913352/optic-foliar",
        "url": null,
        "linkedin": null,
        "description": "Optic Foliar is the industry leader in advanced foliar sprays, dedicated to manufacturing the highest-quality and best-performing products to enhance plant health and growth. Our innovative foliar solutions, backed by rigorous scientific research, provide home gardeners and professional growers with the tools they need to optimize nutrition, pest management, and disease control. From our flagship products like Transport, REV, Overgrow, and ATAK, we ensure every spray delivers exceptional results, even in full sunlight. Our commitment to customer service is reflected in our dedication to helping growers solve problems and make informed decisions. Choose Optic Foliar for top-tier foliar sprays that push the limits of plant nutrition and protection."
    },
    {
        "title": "Current Culture H2O",
        "internal_link": "https://www.mjbizdirectory.com/company/913345/current-culture-h2o",
        "url": null,
        "linkedin": null,
        "description": "For the last 15 years, Current Culture H2O (CCH2O) has been a market leader and innovator in hydroponic cultivation solutions for professional growers worldwide. Our Proven Production Approach includes high-performance hydroponics systems, premium hydroponic nutrients, and expert support.\n\nOur solutions are used in a wide variety of modern agricultural applications in both greenhouses and controlled environments."
    },
    {
        "title": "Dakine 420",
        "internal_link": "https://www.mjbizdirectory.com/company/913344/dakine-420",
        "url": null,
        "linkedin": null,
        "description": "DaKine 420 revolutionizes cannabis cultivation with scientifically-backed, super-soluble powdered nutrients, microbials, and premium coco coir grow mediums. Thanks to our team of experts, led by a Mad Scientist with dual PhDs in chemistry and microbiology, our products maximize plant health, yield, and potency. Growers can expect robust root growth, soda-can-sized buds, and plants that resemble THC trees. With unparalleled customer support and a simplified nutrient system, even experienced growers are impressed by the results. Choose DaKine 420 for the best cannabis fertilizers and grow media, meticulously developed to elevate your growing experience."
    },
    {
        "title": "Aeromixer",
        "internal_link": "https://www.mjbizdirectory.com/company/913343/aeromixer",
        "url": null,
        "linkedin": null,
        "description": "Aeromixer is the all-in-one solution for your garden's mixing and aeration needs, designed to save you time and improve efficiency. Capable of handling up to 1/4 inch solids and 1/4 pound of fertilizer per gallon of water, our powerful pump ensures thorough mixing and even nutrient distribution. By effectively suspending particulates, Aeromixer provides consistent feeding and optimal growth for your plants. Say goodbye to outdated air stones; Aeromixer utilizes innovative technology and traditional methods to reduce the need for pH stabilizers. Trust Aeromixer to deliver the best in garden care, from mixing to aeration with unmatched performance."
    },
    {
        "title": "UbiGro",
        "internal_link": "https://www.mjbizdirectory.com/company/913331/ubigro",
        "url": null,
        "linkedin": null,
        "description": "UbiGro revolutionizes greenhouse farming with its advanced luminescent films that optimize sunlight for diverse crops, including vegetables, ornamentals, leafy greens, and cannabis. Our innovative quantum dot technology converts less efficient UV and blue photons into potent orange and red light, enhancing photosynthesis and boosting crop yields by up to 20%. Engineered for versatility and ease of use, UbiGro films are compatible with any greenhouse setup, whether as an external cover or an internal retrofit. Our sustainable, electricity-free solutions promote healthier plants and increased profitability, making UbiGro a vital investment for modern greenhouse operations. Trust UbiGro to deliver superior light quality and maximize your greenhouse's potential."
    },
    {
        "title": "Haygrove",
        "internal_link": "https://www.mjbizdirectory.com/company/913306/haygrove",
        "url": null,
        "linkedin": null,
        "description": "Haygrove provides innovative high tunnels and growing systems to enhance the productivity and sustainability of agricultural operations. With a range of field-scale high tunnels and tailored substrate gutter solutions, our products are designed to optimize crop protection and yield. Founded with a focus on solving real-world farming challenges, Haygrove has grown to operate farms in the UK, South Africa, Portugal, and China. Our commitment to quality and innovation is also reflected in our involvement in water desalination and eco-friendly garden tunnels. Trust Haygrove to deliver advanced agricultural solutions that meet the unique needs of growers worldwide."
    },
    {
        "title": "Smart Pots",
        "internal_link": "https://www.mjbizdirectory.com/company/913293/smart-pots",
        "url": null,
        "linkedin": null,
        "description": "Join A Growing Revolution‚ and maximize your yield with America's original, award winning, fabric growing container, the Smart Pot. Established in 1984, Smart Pot fabric planters are proudly made 100% in the USA and are extremely durable and reusable, they won't fall apart in the middle of a grow. Smart Pot fabric planters are independently tested and are BPA Free and Lead Free. We offer a variety of sizes, colors, and shapes. We also make custom Smart Pot containers to fit any growing situation. Smart Pot containers are available for commercial growers, case counts apply."
    },
    {
        "title": "Viscon Medicinal Crops.",
        "internal_link": "https://www.mjbizdirectory.com/company/913273/viscon-medicinal-crops",
        "url": null,
        "linkedin": null,
        "description": "Passionate about Agro and Food processes and the limitless possibilities technology has to offer. Our machinery, software and integrated solutions enable the world to produce, distribute and enjoy healthy fresh food, flowers and plants.We provide machine automation, software and integrated solutions to make agricultural processes more sustainably profitable, scalable and easy.\nAs a system integrator, we build machines but moreover we build integrations. Our software enables full control and management of your production facility, seamlessly integrating all automation equipment."
    },
    {
        "title": "Vostermans Ventilation Multifan",
        "internal_link": "https://www.mjbizdirectory.com/company/913272/vostermans-ventilation-multifan",
        "url": null,
        "linkedin": null,
        "description": "Echelon Supply and Service, with nearly 50 years of expertise, is North America’s premier provider of industrial and hydraulic hose solutions. Our extensive product line, including the high-performance FORSAFLEX system, meets the rigorous demands of both commercial and defense markets. Headquartered in Liverpool, New York, with 14 fabrication and distribution centers across the US and Canada, we ensure swift and reliable supply to our diverse clientele. We are committed to a customer-first approach, delivering quality products, exceptional support, and tailored solutions that make our customers' lives easier. Echelon is dedicated to empowering our clients' success through advanced technology and unparalleled service."
    },
    {
        "title": "Hoogendoorn",
        "internal_link": "https://www.mjbizdirectory.com/company/913265/hoogendoorn",
        "url": null,
        "linkedin": null,
        "description": "Hoogendoorn creates user-friendly automation solutions for every kind of horticultural business worldwide.Do you strive for efficient use of water & energy? Hoogendoorn Growth Management, a global leader in horticultural automation with over 55 years of expertise, is committed to connecting nature with technology for optimal crop growth. From our roots in the Netherlands to our presence in over 100 countries, we deliver sustainable and user-friendly process automation solutions tailored to all types of growers. Our advanced systems like IIVO and Intelligent Algorithms empower growers to maximize efficiency and minimize resource use across diverse climates and crops. With a strong partner network and comprehensive training and support, we provide a total package to optimize business processes in horticulture. Join us in pioneering the future of automated growing and achieving more sustainable horticulture worldwide."
    },
    {
        "title": "Van der Knaap USA LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/913262/van-der-knaap-usa-llc",
        "url": null,
        "linkedin": null,
        "description": "The Van der Knaap Group is a Dutch family company with production facilities all over the world. We produce and develop high-quality, natural rooting and growing media for the professional horticulture."
    },
    {
        "title": "bio365",
        "internal_link": "https://www.mjbizdirectory.com/company/913175/bio365",
        "url": null,
        "linkedin": null,
        "description": "bio365 produces biologically activated and nutrient dense biochar soils for\nprofessional cultivation. Developed by a team of leading soil scientists,\nbiochar experts, and cultivators, our mixes provide optimal characteristics\nfor high-value plants to thrive."
    },
    {
        "title": "Agnetix",
        "internal_link": "https://www.mjbizdirectory.com/company/913159/agnetix",
        "url": null,
        "linkedin": null,
        "description": "Agnetix water cooled LED lighting system is the most advanced technology in horticulture: Highly-efficient, high performing, fully connected grow lights with integrated sensors and cameras for the ultimate visibility to the crop."
    },
    {
        "title": "Koppert Biological Systems",
        "internal_link": "https://www.mjbizdirectory.com/company/913128/koppert-biological-systems",
        "url": null,
        "linkedin": null,
        "description": "Koppert Biological Systems is a global leader in sustainable agricultural solutions, specializing in the biological control of pests and diseases, natural pollination, and plant health support. We offer a comprehensive range of products, including beneficial microorganisms, predatory insects, and biological fungicides, to promote crop resilience and growth. Dedicated to innovation, our technologies, such as the Natutec Drone Release System and Bumblebee Pollination, ensure eco-friendly farming practices. Our mission is to improve agricultural productivity while preserving the environment, making us a trusted partner for growers worldwide. Through extensive research and development, we continue to provide cutting-edge solutions that support both protected and outdoor cultivation."
    },
    {
        "title": "Anderson Injectors",
        "internal_link": "https://www.mjbizdirectory.com/company/913098/anderson-injectors",
        "url": null,
        "linkedin": null,
        "description": "Manufacturer of water treatment equipment mainly\nserving the greenhouse, tree nursery and agriculture markets. Our equipment includes\nfertilizer, chemical, chlorine and acid injector systems."
    },
    {
        "title": "Agrify",
        "internal_link": "https://www.mjbizdirectory.com/company/913053/agrify",
        "url": null,
        "linkedin": null,
        "description": "Agrify is a leading provider of innovative cultivation and extraction solutions for the cannabis industry, bringing data, science, and technology to the forefront of the market. Our proprietary micro-environment-controlled Vertical Farming Units (VFUs) enable cultivators to produce the highest quality products with unmatched consistency, yield, and ROI at scale. Our comprehensive extraction product line, which includes hydrocarbon, ethanol, solventless, post-processing, and lab equipment, empowers producers to maximize the quantity and quality of extract required for premium concentrates."
    },
    {
        "title": "Earth Juice",
        "internal_link": "https://www.mjbizdirectory.com/company/913036/earth-juice",
        "url": null,
        "linkedin": null,
        "description": "Home to the highly acclaimed Earth Juice line of plant care products the most innovative, effective and high performing products for the home and garden."
    },
    {
        "title": "Onset Computer Corp",
        "internal_link": "https://www.mjbizdirectory.com/company/216519/onset-computer-corp",
        "url": null,
        "linkedin": null,
        "description": "Onset is the world’s leading supplier of data loggers. The company’s HOBO data logger and weather station products are used around the world in a broad range of applications, including building energy performance monitoring, water resources management, and ecological and agricultural research. Based on Cape Cod, Massachusetts, Onset has sold more than 2 million data loggers since the company’s founding in 1981. Visit Onset on the web at http://www.onsetcomp.com."
    },
    {
        "title": "Advanced Treatment Technologies",
        "internal_link": "https://www.mjbizdirectory.com/company/912992/advanced-treatment-technologies",
        "url": null,
        "linkedin": null,
        "description": "Advanced Treatment Technologies uses cutting edge, research-backed technologies to design water with qualities specific to each application across multiple industries."
    },
    {
        "title": "Global Garden",
        "internal_link": "https://www.mjbizdirectory.com/company/912988/global-garden",
        "url": null,
        "linkedin": null,
        "description": "From the outset, Global Garden® was founded with the principles of finding best-in-class products that offered innovative ideas and efficient solutions to growers. Since our entry into the hydro space in the mid 2000’s we have always been, and continue to be, awed by the do-it-yourself, inquisitive, can-do nature of growers. It also quickly became obvious that dedicated growers will continually look for an edge in the garden.\n\nHaving always valued quality goods as consumers ourselves, we decided that Global Garden® would only work with high value products. Products, that bring demonstrable value to the grower. Sometimes that might mean an above market price lighting fixture, and sometimes it might mean a lower cost plant additive. Either way, the grower is going to get the best value and see distinguishable results."
    },
    {
        "title": "Schwazze",
        "internal_link": "https://www.mjbizdirectory.com/company/912972/schwazze",
        "url": null,
        "linkedin": null,
        "description": "Schwazze is a pioneering vertically integrated cannabis operator with a strong presence in Colorado and New Mexico, dedicated to transcending the human condition through cannabis. Our diverse family of brands, including Star Buds, Emerald Fields, and R.Greenleaf, offers premium retail experiences and a wide selection of high-quality cannabis products for both recreational and medical use. At Schwazze, we embrace a data-driven approach to innovation, utilizing advanced cultivation techniques and technologies to maximize growth and enhance product quality. Our commitment to exceptional customer service and community engagement sets us apart, ensuring personalized and informative experiences at every point of contact. With our vibrant ecosystem of cultivators, manufacturers, and retailers, Schwazze is reimagining the future of wellness through the power of cannabis."
    },
    {
        "title": "Trinity Greenhouse Structures",
        "internal_link": "https://www.mjbizdirectory.com/company/912933/trinity-greenhouse-structures",
        "url": null,
        "linkedin": null,
        "description": "Trinity Greenhouse Structures LLC is a leading greenhouse manufacturing and distribution company, driven by over 60 years of combined industry experience. Co-founded by industry veterans Chris Kirschner, David Branca, and Dave Bishop, we specialize in turnkey design-build services that elevate your growing facility to its maximum potential. Our team provides expert guidance through the intricate process of designing and constructing customized greenhouses tailored to the unique needs of various horticultural markets, including cannabis cultivation. With a personal touch and professional dedication, we don't just help you build a greenhouse—we help you grow your business. Trust Trinity Greenhouse to deliver innovative, high-quality solutions that support your success in the ever-evolving world of horticulture."
    },
    {
        "title": "ZeroCool Systems",
        "internal_link": "https://www.mjbizdirectory.com/company/912904/zerocool-systems",
        "url": null,
        "linkedin": null,
        "description": "ZeroCool Systems, a dynamic division of RAE Corporation, specializes in innovative climate control solutions tailored for indoor agriculture and environments needing precise temperature and humidity regulation. Established to address the unique challenges of indoor growers, our cutting-edge HVACD (Heating, Ventilation, Air Conditioning, and Dehumidification) systems ensure optimal conditions for all plant life stages, both during lights-on and lights-off modes. By constructing our own state-of-the-art grow facility in 2020, we continuously test and refine our equipment to better serve our customers' evolving needs. With features like precise temperature control, CO2 regulation, and advanced dehumidification, our systems deter the growth of mold, pests, and diseases, promoting healthier crops. ZeroCool is committed to providing unparalleled climate management solutions, helping cultivators achieve consistent high yields and optimal growth conditions around the clock."
    },
    {
        "title": "Hydrobuilder Holdings",
        "internal_link": "https://www.mjbizdirectory.com/company/912903/hydrobuilder-holdings",
        "url": null,
        "linkedin": null,
        "description": "Hydrobuilder Holdings is a premier omni-channel retailer, offering state-of-the-art hydroponics and specialty agriculture equipment across multiple platforms. Formed through the strategic acquisitions of leading businesses such as Hydrobuilder.com, GreenCoast Hydroponics, and Elevated Equipment Supply, we offer unparalleled expertise and a comprehensive range of products. With 14 retail storefronts across six states, and nine strategically located warehouses, our expansive retail and distribution network is complemented by a robust eCommerce platform. Our team of 299 passionate horticulturists leverages 85 years of combined experience to provide innovative solutions that streamline business operations and enhance crop yields. Hydrobuilder Holdings is dedicated to supporting growers of all sizes, ensuring they achieve their agricultural goals with cutting-edge technology and exceptional customer service."
    },
    {
        "title": "MEDIC GROW",
        "internal_link": "https://www.mjbizdirectory.com/company/912851/medic-grow",
        "url": null,
        "linkedin": null,
        "description": "After years of research and experience in the LED grow light industry, we are proud to launch our own brand, Medic Grow. Medic Grow is a leading provider of advanced LED grow light solutions designed for both home and commercial horticulture. With over 10 years of professional excellence, our spectrum-adjustable lights, such as the Fold-800 and Neo-780, ensure optimal plant growth and energy efficiency. We offer a wide range of products tailored to different growing environments, including full-spectrum, veg, and flower-specific lights, all ETL and DLC certified for maximum rebates and cost-effectiveness. Our dedication to innovation and customer satisfaction sets us apart, making us the top choice for growers looking to maximize their harvest quality and yield. Experience unmatched performance and value with Medic Grow's state-of-the-art LED grow lights."
    },
    {
        "title": "Horizon Lift",
        "internal_link": "https://www.mjbizdirectory.com/company/912776/horizon-lift",
        "url": null,
        "linkedin": null,
        "description": "Horizon Lift is at the forefront of innovative lighting solutions for the horticulture industry, dedicated to enhancing your lighting investment while reducing operational costs. Our patented XRT Rope Light Hangers and cutting-edge Horizon Lift Light Movers enable growers to easily adjust light positioning, optimizing PPFD (Photosynthetic Photon Flux Density) for improved crop yield and quality. With over 13 years of experience in light lifting, our systems are designed for efficiency, safety, and ease, eliminating the need for ladders and reducing setup time to mere seconds. Controlled via a mobile app, our light movers ensure precise canopy coverage and temperature management, fostering healthier plant growth. Horizon Lift also offers expert consulting services for seamless installation, maintenance, and repair of our advanced light lifting systems."
    },
    {
        "title": "Verilytix",
        "internal_link": "https://www.mjbizdirectory.com/company/912691/verilytix",
        "url": null,
        "linkedin": null,
        "description": "Verilytix is an artificial intelligence (AI) company fundamentally changing the cannabis industry through canopy scanning robotics, machine learning, and retail AI applications."
    },
    {
        "title": "CO2Meter, Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/771507/co2meter-inc",
        "url": null,
        "linkedin": null,
        "description": "CO2Meter is a U.S. based business that designs and manufactures gas detection monitoring, analytical, and control solutions. Our systems are used across restaurant, beverage, industrial, medical, and cold storage applications."
    },
    {
        "title": "OBEDIO",
        "internal_link": "https://www.mjbizdirectory.com/company/912760/obedio",
        "url": null,
        "linkedin": null,
        "description": "Obedio delivers unrivaled business and regulatory intelligence from local public records on the industries that will shape the future."
    },
    {
        "title": "Strainprint Technologies",
        "internal_link": "https://www.mjbizdirectory.com/company/928315/strainprint-technologies",
        "url": null,
        "linkedin": null,
        "description": "Strainprint Technologies Inc. is the leading medical cannabis data company dedicated to advancing the scientific understanding of cannabis use through comprehensive data collection and analysis. Through our powerful analytics platform, researchers, retailers, and industry stakeholders gain real-time insights and detailed reports, supporting informed decision-making and industry advancements. Committed to privacy and security, our platform is HIPAA, PIPEDA, and PHIPA compliant, ensuring sensitive user data is protected. Join tens of thousands of users in making informed, data-driven choices for better health outcomes with Strainprint."
    },
    {
        "title": "ReLeaf",
        "internal_link": "https://www.mjbizdirectory.com/company/928314/releaf",
        "url": null,
        "linkedin": null,
        "description": "Track the use and experienced effects of products in your inventory and across your state.\nCustomers want more information about what they are buying. Differentiate your dispensary by providing evidenced-based effects data on your products. Our patent-pending platform allows users to anonymously record real-time and historical experiences with specific products, capturing dosage, symptom relief, side effects, and more. By analyzing your data, Releaf provides intelligent reports that can be shared with doctors, caregivers, or dispensary staff to help identify the most effective products and methods for your unique needs. Join our global community striving for better health outcomes and contribute to an industry built on transparency, truth, and collaboration."
    },
    {
        "title": "Bud",
        "internal_link": "https://www.mjbizdirectory.com/company/928313/bud",
        "url": null,
        "linkedin": null,
        "description": "GrowBud is a vibrant community platform where cannabis enthusiasts document and share their cultivation journeys. From seedling to harvest, members provide real-time updates and valuable insights on various strains such as Green Gelato OG, Sunset Sherbet Auto Flower, and Magic Candy Mountain OG. With detailed journals covering critical growth phases and innovative techniques, GrowBud fosters a collaborative environment for learning and improving cultivation skills. Our platform also features cloning, defoliation, and light management tools, ensuring every grower can achieve optimal results."
    },
    {
        "title": "simLeaf",
        "internal_link": "https://www.mjbizdirectory.com/company/928312/simleaf",
        "url": null,
        "linkedin": null,
        "description": "SimLeaf is an advanced 3D cannabis grow simulator app available on iPhone, iPad, and Android devices. Designed by experienced growers, SimLeaf offers a realistic and immersive learning experience by simulating every aspect of cannabis cultivation. Users can manage light, temperature, humidity, water levels, nutrients, and pH levels to grow unique plants, all while learning through hands-on interaction in a game-like environment. The app allows users to rotate and zoom in on their plants, examine them in high-resolution detail, and receive tips and educational information throughout the growing process. With features like genetic modeling, nutrient absorption simulation, and robust analytics, SimLeaf enables users to perfect their growing techniques, even allowing for the creation and crossbreeding of mother plants for endless genetic variations."
    },
    {
        "title": "Priva",
        "internal_link": "https://www.mjbizdirectory.com/company/915597/priva",
        "url": null,
        "linkedin": null,
        "description": "Priva is a high-tech company that develops hardware, software, and services in climate control, energy saving, and optimal reuse of water. We provide integrated solutions to control and manage horticultural operations worldwide. Priva creates optimal environments, allowing people and plants to experience the best way to grow.\nOur company was founded over 65 years ago by the same family that still owns and runs it today. Over the years, we have delivered technology and leading-edge innovation for fast-growing markets such as horticulture, building automation, and indoor growing. Together with our partners, we automate commercial and public buildings and greenhouses. Additionally, we make them smart for improved comfort, higher yield, and improved energy management through a suite of cloud-based services. Our customers can focus on key activities while managing risks and maximizing returns, anytime and anywhere.\n\nWe build tomorrow, today."
    },
    {
        "title": "IDScan.net",
        "internal_link": "https://www.mjbizdirectory.com/company/735786/idscan-net",
        "url": null,
        "linkedin": null,
        "description": "Flexible ID scanning solutions to protect physical and digital retailers from fraud.\nFake ID Detection - Catch fake IDs\nUse ID authentication to detect up to 95% of fake IDs.\n\nID scanning\nSell age restricted products\nVerify customer age before selling alcohol, tobacco, cannabis, and other adult items"
    },
    {
        "title": "ActionPac",
        "internal_link": "https://www.mjbizdirectory.com/company/913137/actionpac",
        "url": null,
        "linkedin": null,
        "description": "American made packaging automation equipment, written performance guarantee and free lifetime support included. ActionPac builds the world’s most efficient automated packaging equipment.\nA second generation, family-owned company, we’ve got 45 years of designing, building and servicing automated packaging machinery under our belts."
    },
    {
        "title": "Neatleaf",
        "internal_link": "https://www.mjbizdirectory.com/company/912686/neatleaf",
        "url": null,
        "linkedin": null,
        "description": "Experts from the robotics, automation, and AI industries have come together to revolutionize the agricultural industry by designing technology that will improve yields, increase profits, and enhance sustainability through data.\n\nThe Neatleaf Spyder enables you to remotely monitor and optimize your growing environment for each individual plant. Know your environment conditions in every corner and rely on automatically collected plant health and growth metrics to guide your decision making. The Spyder contains several sensors to gather a comprehensive understanding of the cultivation environment. The same sensor set is used to collect the data across the canopy which guarantees consistency and ensures interpretability. By automatically identifying plant stress multiple times a day across your complete canopy you will get a very strong signal for overall plant health and trend. Hot spots and systematic issues will become immediately apparent and allow you to respond quickly.\n\nAt Neatleaf, we are committed to connecting people with plants and data, and creating a positive impact for our planet."
    },
    {
        "title": "Rootwurks",
        "internal_link": "https://www.mjbizdirectory.com/company/928025/rootwurks",
        "url": null,
        "linkedin": null,
        "description": "Rootwurks revolutionizes the cannabis industry by integrating education with compliance through our Learning Experience Platform (LXP), designed to enhance training operations and ensure adherence to regulations. Our comprehensive suite of tools including on-demand learning modules, expertly crafted checklists, and detailed assessments work collectively to build a culture of safety and compliance for cannabis professionals. With customizable learning plans and internal audits, we facilitate a proactive approach to complying with regulations, ensuring your team is informed and accountable. Trusted by leading cannabis enterprises, our platform makes learning accessible and efficient, allowing employees to engage in bite-size training segments that fit into their workflow without adding extra burden. At Rootwurks, we are dedicated to bridging the gap between day-to-day operations and regulatory compliance, empowering your business through education that drives sales and minimizes distractions."
    },
    {
        "title": "Flourish Software",
        "internal_link": "https://www.mjbizdirectory.com/company/928130/flourish-software",
        "url": null,
        "linkedin": null,
        "description": "Flourish Software revolutionizes the cannabis industry with its comprehensive seed-to-sale ERP Software Platform, designed to support cannabis businesses from startups to large multi-state operators. Our platform covers the entire regulated supply chain, with tailored solutions for cultivation management, distribution and warehousing, manufacturing workflows, and seamless retail operations. Built by a team of supply chain engineers and experienced cannabis operators, Flourish emphasizes compliance, accuracy, efficiency, and uncovering cost-saving opportunities, enabling businesses to optimize production, reduce waste, and significantly boost profitability. Our powerful, user-friendly platform integrates a best-in-class API for seamless operations, empowering owners with in-depth analytics and reports for informed decision-making and operational optimization. Flourish stands as the partner of choice for navigating the complexities of the cannabis industry, offering guided implementation by industry experts and rapid, highly-rated support to ensure businesses not only comply but thrive in this dynamic market."
    },
    {
        "title": "SilverLeaf CBC",
        "internal_link": "https://www.mjbizdirectory.com/company/928129/silverleaf-cbc",
        "url": null,
        "linkedin": null,
        "description": "SilverLeaf CBC emerges as a pivotal force in revolutionizing the cannabis industry by providing an end-to-end business management solution tailored for cannabis growers and processors. Leveraging the robust capabilities of Microsoft Dynamics 365 Business Central, SilverLeaf offers seamless integration of cultivation, finance, inventory, regulatory compliance, and sales delivery, ensuring that businesses can flourish with efficiency and remain compliant. By eliminating the reliance on fragmented software solutions, this platform empowers operators with real-time insights and comprehensive control over their operations, from seed to sale. SilverLeaf's user-friendly platform is crafted to meet the dynamic needs of the cannabis market, facilitating streamlined processes, predictive analytics, and strategic planning for future growth. As a leader in digital transformation, SilverLeaf CBC is dedicated to helping cannabis businesses achieve their full potential by optimizing productivity, ensuring compliance, and driving success in a competitive industry."
    },
    {
        "title": "Viridian Sciences",
        "internal_link": "https://www.mjbizdirectory.com/company/928128/viridian-sciences",
        "url": null,
        "linkedin": null,
        "description": "Viridian Sciences leads the way in providing secure, comprehensive cannabis business management software, built on the trusted and secure platform of SAP Business One. As pioneers in the cannabis ERP technology space, we offer an all-in-one solution that streamlines operations for cultivators, producers, processors, and dispensaries, ensuring compliance, automation, and scalability. Our cloud-based, seed-to-sale software grants unparalleled flexibility, allowing businesses to access their operations from any device, anywhere, ensuring they stay ahead in the fast-evolving cannabis industry. With features like custom reporting and affordable pricing models, we make it easier for small to medium-sized enterprises to leverage the benefits of an enterprise-grade ERP system without the typical costs or complexities. Viridian Sciences is committed to empowering cannabis businesses with the tools they need to grow, compete, and comply with confidence, backed by our world-class support and continuous software enhancements."
    },
    {
        "title": "Marijuana Software",
        "internal_link": "https://www.mjbizdirectory.com/company/928127/marijuana-software",
        "url": null,
        "linkedin": null,
        "description": "MarijuanaSoftwareLLC is at the forefront of providing innovative and reliable software solutions tailored for the cannabis industry, designed to streamline operations, enhance compliance, and boost sales. Our comprehensive suite of tools, including point of sale (POS) systems, inventory management, and customer relationship management (CRM) features, empowers dispensaries and cannabis businesses to operate more efficiently and connect more effectively with their customers. With a deep understanding of the unique challenges facing the cannabis market, we offer customizable software that adapts to the needs of each client, ensuring optimal functionality and ease of use. Dedicated to supporting the growth and success of our clients, MarijuanaSoftwareLLC provides unparalleled customer service, from initial setup and training to ongoing support and updates. Our mission is to be the technology partner that cannabis businesses trust to navigate the evolving marketplace, ensuring they stay ahead of the curve in an increasingly competitive environment."
    },
    {
        "title": "FolioGrow",
        "internal_link": "https://www.mjbizdirectory.com/company/913251/foliogrow",
        "url": null,
        "linkedin": null,
        "description": "FolioGrow is smart cannabis cultivation software that helps you make the right decisions to increase your yields and profits. If you are using whiteboards to manage your cannabis grow, you're losing valuable KPIs as well as data. Which strains are the most profitable? Which employees are performing the best? Is your cost-per-pound (CPP) as low as it could be? All of these factors affect the profitability of your grow. FolioGrow is a cannabis cultivation management platform (CCMP) that pulls together all of your data to help you make better decisions. From every one of your team members up to your investors, you can get the right information to the right people at the right time. Run your grow like a stock portfolio by unlocking the math in your crop."
    },
    {
        "title": "Alpine IQ",
        "internal_link": "https://www.mjbizdirectory.com/company/915464/alpine-iq",
        "url": null,
        "linkedin": null,
        "description": "At Alpine IQ, we empower businesses to navigate the complexities of regulated markets with our cutting-edge digital solutions, designed to unlock untapped revenue streams and optimize customer engagement. With a suite of tools that includes marketing, loyalty programs, analytics, data operations, and custom-branded apps, we offer a holistic approach to drive certainty and growth. We specialize in providing unparalleled access to first-party and third-party data insights, enabling brands and retailers to make informed decisions and tailor their strategies for maximum impact. Whether it's through automated, personalized communication across multiple channels or implementing rewards systems that magnetize customers, Alpine IQ is dedicated to helping our clients excel. Trusted by more than 3,600 stores globally, our platform is the cornerstone for businesses aiming to thrive in the digital ecosystem."
    },
    {
        "title": "Order",
        "internal_link": "https://www.mjbizdirectory.com/company/928078/order",
        "url": null,
        "linkedin": null,
        "description": "Order.co revolutionizes the purchasing experience for cannabis businesses by streamlining the entire buy-to-pay process into a unified, efficient platform. With over 15,000 trusted vendors in one curated catalog, businesses can manage purchases, track orders, and harness flexible payment terms, all within a single, integrated system. By centralizing procurement, Order.co not only unlocks immediate cash flow improvements but also delivers unparalleled spend visibility and control, ensuring every dollar is optimally utilized. The platform's elegant solution to consolidate invoices and automate payment reconciliations transforms financial management, providing cannabis businesses with the clarity and efficiency essential for scaling. Emphasizing simplicity and savings, Order.co is the partner of choice for cannabis businesses aiming to optimize their buying process, achieve significant time savings, and realize a robust return on investment."
    },
    {
        "title": "Pioneer Logics",
        "internal_link": "https://www.mjbizdirectory.com/company/928076/pioneer-logics",
        "url": null,
        "linkedin": null,
        "description": "Pioneer Logics stands out as a distinguished technology partner, boasting over 700 successful software projects since its establishment in 2010, catering to a global clientele seeking middle to high-complexity software solutions. With a focus on nurturing long-term relationships, the company emphasizes quality, professionalism, and a steadfast commitment to project delivery, offering flexible and dynamic teams adept in turning visions into tangible technology-driven successes. Specializing in IT staff augmentation, custom software development, and mobile application development, Pioneer Logics provides a cross-functional, Scrum-team approach, ensuring direct collaboration with clients to bring their most innovative ideas to fruition. The company's expertise extends across a broad technology spectrum, including cloud computing and bespoke Business Intelligence solutions, embodying a commitment to addressing complex challenges with smart, efficient, and scalable solutions. Pioneer Logics, driven by a mission to excel in software consultancy, sets a benchmark in delivering end-to-end solutions that encapsulate the entire project lifecycle, from ideation through to deployment and beyond, ensuring each client's technological needs are met with precision and excellence."
    },
    {
        "title": "Dispense",
        "internal_link": "https://www.mjbizdirectory.com/company/928075/dispense",
        "url": null,
        "linkedin": null,
        "description": "Dispense, now part of Alpine IQ, offers advanced cannabis eCommerce and dispensary management software designed to optimize the digital and physical storefronts of dispensaries. The platform enhances customer acquisition and retention through seamless integrations with key tools for POS, analytics, and payments, ensuring a robust management ecosystem. Dispense's features are crafted to boost online orders with SEO optimization, cart abandonment solutions, and loyalty programs, making it remarkably user-friendly and customizable to each dispensary's needs. The comprehensive suite includes solutions for in-store experiences like kiosks, drive-through, delivery, and order pickup, allowing dispensaries to manage all sales channels effectively. Beyond functionality, Dispense is committed to societal impact, prominently featuring a Social Equity Program aimed at supporting underrepresented entrepreneurs in the cannabis market."
    },
    {
        "title": "Quantumleaf Solutions",
        "internal_link": "https://www.mjbizdirectory.com/company/928074/quantumleaf-solutions",
        "url": null,
        "linkedin": null,
        "description": "Quantum Leaf Solutions pioneers in providing an all-encompassing Enterprise Resource Planning (ERP) platform tailored for the cannabis industry, facilitating businesses to adeptly manage the complexities of regulations. Their innovative approach combines cultivation, manufacturing, inventory, and compliance aspects into a single, intuitive ERP system, eliminating reliance on disparate software and spreadsheets. With features like virtual gardens for cultivation management and true manufacturing functionality, Quantum Leaf ensures every facet of the supply chain is integrated and easily manageable. Real-time analytics and financial tools offer clear insights and streamline operations across all levels of a cannabis business, be it cultivators, processors, manufacturers, or distributors. Trusted by industry leaders, Quantum Leaf's solutions stand as a beacon for businesses aiming for efficient compliance, seamless integration, and superior operational management in the dynamic cannabis market."
    },
    {
        "title": "Seed Technology",
        "internal_link": "https://www.mjbizdirectory.com/company/928073/seed-technology",
        "url": null,
        "linkedin": null,
        "description": "Seed Technology specializes in revolutionizing the customer experience within cannabis dispensaries through in-store digital engagement software, including cutting-edge TV menus and self-service kiosks. Tailored for efficiency and modernity, Seed's platforms enable dispensaries to streamline customer flow and influence purchasing decisions, increasing sales lift on featured products and reducing transaction times. With partnerships across major POS and e-commerce systems, Seed ensures that dispensary menus remain accurate, up-to-date, and effective in driving profit. Trusted by multi-location dispensaries for its robust integrations and user-friendly interfaces, Seed reduces staff workload in managing screens while creating a dynamic, modern shopping experience for consumers. Embrace the future of cannabis retail with Seed Technology, where innovative digital signage meets seamless operational excellence."
    },
    {
        "title": "Backbone",
        "internal_link": "https://www.mjbizdirectory.com/company/928071/backbone",
        "url": null,
        "linkedin": null,
        "description": "Backbone Universal introduces the world's first and only Supply Mesh Platform, designed to transform traditional supply chains into robust, agile networks ready to handle global volatility. By employing a mesh network model, Backbone Universal allows businesses to adapt quickly to supplier disruptions, optimize business outcomes, and make agile decisions that surpass traditional chain constraints. Our platform excels in industries ranging from agriculture and pharmaceuticals to cannabis and coffee, ensuring compliance with complex regulatory and environmental standards while focusing on social impact. With Backbone Universal, companies can move beyond outdated supply chain models and embrace a future where scalability and resilience are central to business strategy. Join us as we lead the market into a new era of global business, fortified by transparency and proactive management across all industry verticals."
    },
    {
        "title": "Happy Cabbage Analytics",
        "internal_link": "https://www.mjbizdirectory.com/company/928067/happy-cabbage-analytics",
        "url": null,
        "linkedin": null,
        "description": "Happy Cabbage Analytics is transforming the way dispensaries optimize their revenue through advanced, data-driven insights that streamline inventory management and boost customer engagement. By integrating seamlessly with your existing tech stack, we provide actionable strategies for buyers, marketers, and operators aiming to maximize sell-through and keep cash flow healthy. For marketers, our platform revolutionizes customer communication, leveraging personalized SMS and email campaigns that resonate deeply, encouraging more purchases without the need for extensive audience segmentation. On the operations side, Happy Cabbage turns goodbye to the cumbersome spreadsheets, offering a sleeker, more efficient way to track sales KPIs and align teams on actionable weekly goals. With Happy Cabbage, dispensaries can not only survive the competitive cannabis market but thrive, leveraging our targeted marketing tools and comprehensive performance insights to make informed decisions quickly and keep pace with the industry's rapid evolution."
    },
    {
        "title": "AROYA",
        "internal_link": "https://www.mjbizdirectory.com/company/928066/aroya",
        "url": null,
        "linkedin": null,
        "description": "AROYA by Addium Inc is the ultimate cannabis production platform, engineered to elevate the art of cultivation through data-driven insights and top-tier technology. Our platform empowers growers with research-backed sensors and software designed to optimize yield, scale operations profitably, and achieve unparalleled success in the cannabis industry. With AROYA, cultivators have access to precision tools like the TEROS ONE sensor for fine-tuning irrigation and substrate management, alongside the CLIMATE ONE station for exhaustive climate control, ensuring every aspect of the grow environment is meticulously monitored and managed. From the moment of planting to the final stages of drying and processing, AROYA provides a comprehensive snapshot of your operations, enabling a seamless integration of data for consistent product quality and operational efficiency. Embrace the future of cannabis cultivation with AROYA, where our commitment to quality science leads to quality harvests, positioning us as the partner of choice for the industry's top-shelf producers."
    },
    {
        "title": "Lucid Green",
        "internal_link": "https://www.mjbizdirectory.com/company/928064/lucid-green",
        "url": null,
        "linkedin": null,
        "description": "Lucid Green is revolutionizing cannabis industry logistics with its pioneering LucidIDs, a smarter tracking solution that simplifies compliance, streamlines the supply chain from seed to sale, and removes the need for manual data entry and secondary stickering. Recognized for innovation with awards like the 2023 BIG Business Intelligence Group Innovation Award and the Cannabis Tech Today Sustainable Packaging Award, Lucid Green is setting the standard for product identification and transparency. Our platform enhances operational efficiencies for brands and retailers, offering real-time actionable insights, and reducing the complexity and costs of inventory management and product recalls. For consumers, Lucid Green offers a secure way to verify product authenticity, access detailed information, and participate in reward programs, contributing to smarter purchasing decisions. With over 65 million LucidIDs generated and a growing community of users, Lucid Green is at the forefront of creating a safe, transparent, and efficient marketplace where authenticity and consumer trust thrive."
    },
    {
        "title": "LeafLink",
        "internal_link": "https://www.mjbizdirectory.com/company/915385/leaflink",
        "url": null,
        "linkedin": null,
        "description": "The Flower Agency excels in cultivating digital marketing strategies for the cannabis industry, merging expertise in omnichannel approaches with in-depth analysis to promote dispensaries and brands' growth efficiently. Specializing in programmatic advertising, search engine marketing, and social media and influencer marketing, we tailor strategies that align with your brand's unique KPIs and budgetary considerations. Our goal-oriented method ensures a comprehensive process from brand awareness and customer acquisition to re-engagement and conversion optimization, enabling your cannabis brand to thrive. Leveraging real-time data analytics, we transform complex information into actionable insights, ensuring campaign strategies resonate deeply with targeted demographics. At The Flower Agency, we pride ourselves on becoming an integral part of your team, providing white-glove marketing service and an omnichannel strategy to turn first-time interactions into lasting customer conversions."
    },
    {
        "title": "APG Cash Drawer, LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/89622/apg-cash-drawer-llc",
        "url": null,
        "linkedin": null,
        "description": "APG Cash Drawer, LLC is the retail industry's leading manufacturer of cash drawers and other POS related products. Serving thousands of customers around the world, APG has a reputation as a designer and manufacturer of the most durable and dependable cash drawers in the industry. Our heavy-duty products will be the most reliable component in your workstation. APG offers a wide range of cash drawers for applications found in Retail, Food, Hospitality and Convenience Stores. APG Cash Drawer offers both heavy duty cash drawers and standard duty cash drawers along with integration products and customized solutions. Configure your own custom cash drawer online now!"
    },
    {
        "title": "CannaEx Trades",
        "internal_link": "https://www.mjbizdirectory.com/company/928030/cannaex-trades",
        "url": null,
        "linkedin": null,
        "description": "CannaEx Trades specializes in the distribution and legalization of genetic cannabis products. Since establishing the company in 2019, we have steadily become the go-to partner for businesses seeking expert guidance in importing and exporting top-tier cannabis seeds, flowers, and extracts. Utilizing our all-encompassing government licenses and deep-rooted connections with prominent industry figures, we streamline the complexities of the international cannabis trade, ensuring full compliance and exceptional service. Through CannaEx Trades, clients gain unique access to an expansive range of strains, coupled with unparalleled consultancy on GMP certification, phytosanitary requirements, and logistical intricacies. We are committed to advancing the industry's standards by providing a robust platform for secure, efficient, and successful cannabis transactions worldwide."
    },
    {
        "title": "Adherence Compliance",
        "internal_link": "https://www.mjbizdirectory.com/company/928027/adherence-compliance",
        "url": null,
        "linkedin": null,
        "description": "At Global Go Consulting, formerly known as Adherence Compliance, we leverage deep industry knowledge and comprehensive consulting strategies to elevate cannabis businesses worldwide. Our suite of services encompasses everything from regulatory compliance and licensing support to market analysis and brand development, tailored to propel entities within the cannabis sector to the forefront of the market. With an acute focus on global markets, we equip our clients with the insights and tools necessary to navigate the complex landscape of cannabis regulations and opportunities internationally. From emerging startups to established enterprises, our expert consultancy provides a roadmap to success by optimizing operational efficiency, mitigating risks, and refining business models for scalability. Embrace the advantage of Global Go's unparalleled expertise to transform your cannabis venture into a leading market player, navigating the industry with confidence and strategic agility."
    },
    {
        "title": "BizTender",
        "internal_link": "https://www.mjbizdirectory.com/company/928023/biztender",
        "url": null,
        "linkedin": null,
        "description": "At BizTender, we streamline the operational complexities of the cannabis industry with our all-inclusive management and compliance system, helping businesses flourish in a regulated space. Whether you're a cultivator, producer, distributor, or dispensary, our versatile platform is your trusted partner in tracking every vital aspect of your product's lifecycle to ensure legal compliance and optimize growth. Features like seed-to-sale tracking, government compliance syncing, and cashless payment options come together to facilitate a smarter, more efficient operation. From cultivators to dispensaries, our software is fine-tuned to provide tailored solutions, such as point-of-sale systems, marketing services, and detailed business analytics to propel your cannabusiness toward success. Our mission at BizTender is to alleviate the regulatory burdens of cannabis entrepreneurship so you can concentrate on nurturing your product and your profits."
    },
    {
        "title": "Simplifya",
        "internal_link": "https://www.mjbizdirectory.com/company/928022/simplifya",
        "url": null,
        "linkedin": null,
        "description": "As the pioneering figurehead in cannabis compliance software, Simplifya unfurls a seamless pathway for licensed operators to ensure, monitor, and maintain adherence to intricate state cannabis regulations. Our robust platform, established in 2016, is synonymous with operational compliance, entrusted by the largest Multi-State Operators (MSOs) and smaller entities alike to protect their most valuable asset – their license. Our intuitive suite of tools, including audit guidance, SOP templates, and license tracking, are meticulously designed to demystify the nuances of regulatory demands. With the expertise of a seasoned team, we translate complex legalities into actionable steps, laying the groundwork for compliant growth and mitigated risk across the dynamic cannabis landscape. Our unwavering dedication to innovation and support in the cannabis sector fashions Simplifya as the linchpin for businesses aiming to thrive amidst the web of regulations, safeguarding their journey with confidence and peace of mind."
    },
    {
        "title": "NatureTrak",
        "internal_link": "https://www.mjbizdirectory.com/company/928021/naturetrak",
        "url": null,
        "linkedin": null,
        "description": "NatureTrak offers an unrivaled compliance and risk management solution tailored for financial institutions navigating the complexities of the cannabis industry. Our robust platform transforms compliance departments into profit centers by enabling banks and credit unions to safely, and profitably engage with cannabis-related businesses. Through our proven system, we've validated over $25 billion in cannabis-related transactions, ensuring legal and regulatory peace of mind. By integrating our state-of-the-art technology and advisory services, institutions can expand their cannabis banking programs efficiently without the need for additional staff, capitalizing on new market opportunities with minimized risk. Our dedication to excellence is supported by comprehensive regulatory guidance and expert support, empowering our partners to meet the dynamic needs of the emerging cannabis market confidently."
    },
    {
        "title": "Confident Cannabis",
        "internal_link": "https://www.mjbizdirectory.com/company/928016/confident-cannabis",
        "url": null,
        "linkedin": null,
        "description": "Manage your orders, notify clients and analyze your results over time, all through a centralized dashboard.\nAt Confident Cannabis, we are proud to lead the way in cannabis lab testing with our revolutionary software platform that supports over 60% of the industry. Our bespoke LIMS (Laboratory Information Management System) is meticulously tailored to meet the unique demands of cannabis testing, offering labs a centralized dashboard to manage orders, notify clients, and analyze results efficiently. As the preferred choice for numerous laboratories nationwide, we provide software solutions that simplify the complexities of cannabis testing and enhance the service labs can offer to their clients. Our mission is to streamline the trade and testing of legal cannabis, fostering transparency and trust throughout the supply chain. Embracing innovation and client feedback, we've evolved into Confient LIMS, expanding our commitment to deliver state-of-the-art laboratory information management tools designed for the rapidly growing cannabis industry."
    },
    {
        "title": "Aeropay",
        "internal_link": "https://www.mjbizdirectory.com/company/915406/aeropay",
        "url": null,
        "linkedin": null,
        "description": "Aeropay is a financial technology company that helps people move money with bank-to-bank (ACH) transfers.\n\nWe enable businesses to accept compliant, cashless and contactless payments giving customers the freedom to spend. Leaving cash and cards behind and paying with a personal mobile device promotes safety, convenience and a modern lifestyle.\n\nEnabled with sophisticated and secure technology, with compliance at the core, Aeropay is the better way to move money."
    },
    {
        "title": "Bluelab",
        "internal_link": "https://www.mjbizdirectory.com/company/913068/bluelab",
        "url": null,
        "linkedin": null,
        "description": "Bluelab is a global leader in the production of measurement and automation devices that support crop success in the Controlled Environment Agriculture market. Our reliable, accurate, and accessible product range is trusted by tens of thousands of growers worldwide, from small-scale grow-rooms to commercial facilities. Driven by the vision of a healthier world for all, Bluelab is committed to helping the world grow more with fewer resources."
    },
    {
        "title": "Node",
        "internal_link": "https://www.mjbizdirectory.com/company/927842/node",
        "url": null,
        "linkedin": null,
        "description": "Node is a cloud-based BI (Business Intelligence) tool specifically made for the cannabis industry. It interfaces with METRC and provides advanced reporting capabilities on all METRC data and allows users Custom Data Entry for specialized reports and tasks outside of METRC. Batch Tracking, Wholesale Marketplace, Business Intelligence, Inventory Management, and Compliance tools"
    },
    {
        "title": "SEPTIVICA",
        "internal_link": "https://www.mjbizdirectory.com/company/927841/septivica",
        "url": null,
        "linkedin": null,
        "description": "We validate and verify all participants in Hemp transactions: buyers and sellers. Our best of breed technology supports common workflows in order to streamline and track your hemp transactions. All funds are held in escrow until all parties are satisfied that the terms of the transaction are met. No matter where you sit in the Hemp supply chain, Septivica can help your business run more effectively."
    },
    {
        "title": "Argus Controls & Conviron",
        "internal_link": "https://www.mjbizdirectory.com/company/913048/argus-controls-conviron",
        "url": null,
        "linkedin": null,
        "description": "Greenhouse controls, horticulture control systems, cannabis controls, automated irrigation and fertigation, glasshouse controls, vertical farming control systems. Argus provides advanced environmental control systems that are customized to each grower's requirements and are adaptable to their changing needs, enabling them to operate their facilities exactly the way they want."
    },
    {
        "title": "Bloom Automation",
        "internal_link": "https://www.mjbizdirectory.com/company/927839/bloom-automation",
        "url": null,
        "linkedin": null,
        "description": "Bloom Automation supports cannabis industry, leveraging advanced AI-powered technology to revolutionize cultivation processes. Our patented machine learning algorithms and sophisticated computer vision systems enable growers to automate complex and repetitive tasks, significantly reducing labor costs while enhancing the quality and consistency of their harvest. By harnessing a global cannabis dataset, Bloom's intelligent software optimizes every aspect of the grow operation, from scanning to analyzing and acting. Our mission is to empower cannabis cultivators to break free from traditional methods, allowing them to maximize value and streamline operations effortlessly.\n\nBloom Automation works to bring advanced computer vision, AI, and ultra-precise robotics to the cannabis cultivation industry."
    },
    {
        "title": "Pulse Grow",
        "internal_link": "https://www.mjbizdirectory.com/company/927838/pulse-grow",
        "url": null,
        "linkedin": null,
        "description": "Pulse Grow is dedicated to empowering cultivators by providing precision monitoring solutions that optimize grow room conditions. Our state-of-the-art sensors and intuitive app deliver real-time data on key metrics like VPD, temperature, humidity, and more, ensuring your plants thrive. With Pulse Grow, you'll receive instant alerts when conditions deviate, allowing you to act swiftly to protect your yield. Designed for both hobbyists and professionals, our products are easy to set up and use, offering peace of mind and unparalleled insight into your growing environment. Elevate your cultivation game with Pulse Grow, and make every crop your best."
    },
    {
        "title": "GrowFlow",
        "internal_link": "https://www.mjbizdirectory.com/company/927837/growflow",
        "url": null,
        "linkedin": null,
        "description": "GrowFlow provides seed-to-sale tracking and management solutions for the cannabis industry. Take your cannabis business to the next level – Join over 1,498 cannabis operators that are managing and growing their operations with GrowFlow's easy-to-use business management and compliance platform."
    },
    {
        "title": "FloEnvy",
        "internal_link": "https://www.mjbizdirectory.com/company/927836/floenvy",
        "url": null,
        "linkedin": null,
        "description": "FloEnvy is the premier software for cannabis cultivation. From startup farms to the largest commercial operations in the world, FloEnvy delivers a single solution for managing cultivation, compliance, logistics, financial, and environmental data - all through a simple and intuitive platform. With happy clients across 5 countries and 18 METRC states, FloEnvy is the only software capable of handling the full cannabis supply chain on a global scale."
    },
    {
        "title": "Biotrack",
        "internal_link": "https://www.mjbizdirectory.com/company/915521/biotrack",
        "url": null,
        "linkedin": null,
        "description": "BioTrack aims to bring cannabis out of prohibition through transparency, accountability, and scalable growth. As pioneers of seed-to-sale tracking for both business management and government oversight software, the BioTrack team has the professional experience necessary to navigate regulations and enforce compliance across any regulated landscape. BioTrack is a leading seed-to-sale inventory management and dispensary point-of-sale (POS) software designed specifically for the cannabis industry. We offer a comprehensive suite of business tools that give you everything you need to run and control your Cannabis business operation."
    },
    {
        "title": "Growtronix",
        "internal_link": "https://www.mjbizdirectory.com/company/927835/growtronix",
        "url": null,
        "linkedin": null,
        "description": "The all in one Grow Room Automation and climate controller. The Growtronix system can monitor nearly every aspect of an indoor garden. The system is modular in design. This means that you can locate Growtronix hardware where it's needed. For example you can have a temperature sensor located in the canopy and the controllable outlet controlling the exhaust fan located elsewhere in the facility."
    },
    {
        "title": "Koolfog",
        "internal_link": "https://www.mjbizdirectory.com/company/913090/koolfog",
        "url": null,
        "linkedin": null,
        "description": "Koolfog high-pressure fogging systems allow growers to output fog at precise levels and can serve multiple areas within a greenhouse or grow facility with a reliable, scalable solution. Our systems produce micron-sized fog particles. This provides the perfect vehicle to humidify the air in a uniform manner with high efficiency, and low maintenance costs. Koolfog systems can also provide chemical delivery for disinfection, fungicides, mold management and a variety of other uses including odor control. Koolfog Benefits & Solutions: Balanced Humidification Cooling Energy Efficient Operation Easy Integration to Greenhouse Management Systems Minimizes Dust Particles and Unhealthy Bacteria Cost Effective and Scalable Can Retrofit to Existing Structures Used in Greenhouses, Nurseries, Cannabis Grow Facilities"
    },
    {
        "title": "LeafLink, Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/913083/leaflink-inc",
        "url": null,
        "linkedin": null,
        "description": "LeafLink is the cannabis industry's wholesale platform, defining the way thousands of cannabis brands, distributors, and retailers do business. Easily and efficiently sell, ship, pay, get paid, advertise and drive margin. LeafLink is live in 30 markets with over $5B in annual orders."
    },
    {
        "title": "Dutchie",
        "internal_link": "https://www.mjbizdirectory.com/company/913194/dutchie",
        "url": null,
        "linkedin": null,
        "description": "Dutchie is the fastest-growing cannabis technology platform powering cannabis commerce, streamlining dispensary operations, and providing safe and easy access for consumers. Powering over 5,000 dispensaries throughout the U.S. and Canada and facilitating $14 billion in sales annually, Dutchie is a one-stop-shop for retailers, providing solutions for point of sale, ecommerce, payments, and more.\nWith Dutchie’s fully-integrated cannabis payment solutions, you can accept safe and secure cashless payments to create a more convenient and familiar in-store shopping experience."
    },
    {
        "title": "NEED WEED WE DELIVER",
        "internal_link": "https://www.mjbizdirectory.com/company/922061/need-weed-we-deliver",
        "url": null,
        "linkedin": null,
        "description": "As long-time proponents of CANNABIS, Need Weed We Deliver (NWWD), is driven to facilitate safe and sensible use by building a cannabis community where producers and consumers can both benefit from the growing legal status of Cannabis. After more than 4 years in development, Needweedwedeliver.com is here and it is your next best connection for Delivery Solution / Cannabis Marketplace."
    },
    {
        "title": "Agilent Technologies Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/153787/agilent-technologies-inc",
        "url": null,
        "linkedin": null,
        "description": "Agilent Technologies is the world's premier measurement company. Agilent provides core electronic and bio-analytical measurement tools to advance the electronics, communications, life science research, environmental and petrochemical industries."
    },
    {
        "title": "Chetu, Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/558787/chetu-inc",
        "url": null,
        "linkedin": null,
        "description": "Chetu is a US-based software development company and IT Managed Services Provider, dedicated to providing industry-specific, world-class software solutions to businesses around the globe.\n\nCombining technological expertise, specific domain experience, and a passion for delivering world-class, enterprise-grade solutions, Chetu is a true and seamless backend technology partner. We specialize in helping businesses accelerate the development of desktop, mobile, and web-based apps with on-demand developers who are dedicated to moving your business forward.\n\nHeadquartered in Sunrise, Florida, with offices throughout the US, Europe, and Asia, Chetu has been serving startups, SMBs, and Fortune 5000 companies with an unparalleled software delivery model since 2000. Our comprehensive suite of IT Managed Services complements our software development expertise, ensuring that your technology infrastructure is robust, secure, and efficient, allowing your business to thrive in the digital age."
    },
    {
        "title": "Xero",
        "internal_link": "https://www.mjbizdirectory.com/company/918676/xero",
        "url": null,
        "linkedin": null,
        "description": "We help small businesses thrive worldwide.\n\nXero’s online accounting software connects small business owners with their numbers, their bank, and advisors anytime.\n\nFounded in 2006, Xero now has 3.5 million subscribers and is a leader in cloud accounting. Our experienced board, executive and leadership teams work to ensure Xero focuses on innovation and performance for our customers. Our team loves to help businesses, accountants and bookkeepers automate, collaborate and grow."
    },
    {
        "title": "TEKLYNX Americas Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/915500/teklynx-americas-inc",
        "url": null,
        "linkedin": null,
        "description": "TEKLYNX is the leading software developer of integrated barcode and RFID label design products. TEKLYNX is a Microsoft Gold Certified Partner, Oracle Gold Partner and has connectivity relationships with multiple Enterprise Resource Planning (ERP) software providers. More than 750,000 companies in 170 countries rely on its integrated software solutions for supply chain automation, warehouse management, shipping and receiving, inventory control and asset management. With over 30 years of experience, TEKLYNX is the global leader because of its reliable software and superior customer support. To learn more about how the TEKLYNX community helps companies across industries worldwide, visit teklynx.com or call TEKLYNX in your region. Barcode Better™ with TEKLYNX. TEKLYNX International helps supply chains work better."
    },
    {
        "title": "Originscale",
        "internal_link": "https://www.mjbizdirectory.com/company/923755/originscale",
        "url": null,
        "linkedin": null,
        "description": "Your One-Stop Farm & Grow Management Software\nSimplify and optimize your farming operations with our comprehensive solution. Automate your growing with Originscale sensors, monitor growth and streamline processes—all from one AI-Powered, User-Friendly Platform!"
    },
    {
        "title": "Order.co",
        "internal_link": "https://www.mjbizdirectory.com/company/923529/order-co",
        "url": null,
        "linkedin": null,
        "description": "Modernize your procurement process with Order.co – automate PO management, sourcing, approvals and payments all in one customizable platform. Plus, improve your budgeting, forecasting, and reporting with real-time spend insights by user, location, cost center, and more."
    },
    {
        "title": "Australis Capital",
        "internal_link": "https://www.mjbizdirectory.com/company/913118/australis-capital",
        "url": null,
        "linkedin": null,
        "description": "AUSA Corp. is building American cannabis brands across North America. Find out how you can invest in our cannabis brands."
    },
    {
        "title": "Paragon Payroll",
        "internal_link": "https://www.mjbizdirectory.com/company/913494/paragon-payroll",
        "url": null,
        "linkedin": null,
        "description": "Paragon Payroll, founded in 2007, is a payroll and Human Capital Management (HCM) technology provider specializing in supporting the cannabis community since 2016. The company offers customized payroll and HCM solutions designed specifically for cannabis businesses, including dispensaries, cultivators, and manufacturers.\n\nParagon understands the unique challenges faced by cannabis businesses due to the complex and ever-changing legal landscape. Therefore, they have developed specialized expertise in navigating the regulatory and compliance issues associated with the industry.\n\nSolutions offered by Paragon include Payroll/Tax Compliance, Employee Pay (Direct Deposit, Pay Cards, EWA), Time & Scheduling, Benefits Administration, Applicant Tracking (ATS), Mobile Onboarding, Learning Management (LMS), Performance Management, and Employee Engagement. They also provide a variety of time hardware, web kiosks, and mobile punch options to help streamline payroll and HR processes.\n\nParagon is a boutique firm - small enough to care, yet big enough to deliver. Experience their nimble white-glove implementation & agile concierge support. Paragon is committed to providing reliable and compliant payroll & HCM technology to the cannabis industry, helping businesses to focus on what they do best - growing, cultivating, and distributing high-quality cannabis products."
    },
    {
        "title": "NaviSite, Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/352170/navisite-inc",
        "url": null,
        "linkedin": null,
        "description": "Navisite is a combination of seven successful and respected IT consulting and managed service providers that were brought together under the Navisite brand—RDX, Navisite, clckwrk, ClearDB, Privo, Dickinson + Associates and Velocity Technology Solutions. Building on our collective DNA, we’ve created a modern managed cloud service provider that is specifically rightsized for the needs of mid-market and smaller enterprise customers. We provide the people, skills, solutions, global capabilities and public cloud expertise to help businesses successfully navigate the now of IT change and accelerate IT transformation across every part of the technology stack—from cloud migration and management to infrastructure, enterprise application and data management services."
    },
    {
        "title": "Star Micronics",
        "internal_link": "https://www.mjbizdirectory.com/company/923153/star-micronics",
        "url": null,
        "linkedin": null,
        "description": "Star Micronics: Proud manufacturer of retail point of sale (POS) system hardware and equipment, including receipt printers, cash drawers, self service kiosk printers, and more."
    },
    {
        "title": "Treez",
        "internal_link": "https://www.mjbizdirectory.com/company/913186/treez",
        "url": null,
        "linkedin": null,
        "description": "Treez is the leading enterprise cloud commerce platform providing point of sale software, retail analytics, cashless payments and integrated partner solutions to the highest volume retail operators in the biggest state markets in the cannabis industry. Treez's innovative technology and insights help retailers streamline their growth, increase their ROI, and drive efficiency in their operations. The extensible open API platform provides smooth integration into a variety of best-of-breed solutions across ecommerce, delivery, customer relationship management, marketing and loyalty, accounting, ERP and more."
    },
    {
        "title": "Abaca",
        "internal_link": "https://www.mjbizdirectory.com/company/913322/abaca",
        "url": null,
        "linkedin": null,
        "description": "Abaca is the comprehensive cannabis banking and financial platform. We provide compliant bank accounts, treasury management, payments, and other financial services to cannabis companies across the country through proprietary technology and proven partnerships."
    },
    {
        "title": "Custom Hydro",
        "internal_link": "https://www.mjbizdirectory.com/company/921712/custom-hydro",
        "url": null,
        "linkedin": null,
        "description": "SUPPLYING WATER WISE HYDROPONIC AND ORGANIC FERTILIZERS FOR FERTIGATION AND FOLIAR, COMMERCIAL CANNABIS FERTILIZERS AND HEMP GROWING SUPPLIES.\nLooking to maximize your plant growth? Look no further than Custom Hydro's range of water wise hydroponic fertilizers, organic fertilizers for fertigation, and commercial cannabis fertilizers. Take advantage of our premium products to achieve outstanding results in your gardening endeavors.\n\nBoost plant growth with water wise hydroponic fertilizers\nNourish your plants with organic fertilizers for fertigation\nEnhance cannabis cultivation with our specialized commercial fertilizers"
    },
    {
        "title": "IndicaOnline",
        "internal_link": "https://www.mjbizdirectory.com/company/913516/indicaonline",
        "url": null,
        "linkedin": null,
        "description": "Since 2011, IndicaOnline dispensary software and services has been purpose-built with any size business in mind. From sales, to compliance, to expenses and analytics, we strive to streamline and simplify dispensary operations. We develop innovative dispensary management tools for thousands of retailers and delivery services in the U.S. and Canada, ranging from multi-location enterprises to small businesses."
    },
    {
        "title": "Akerna",
        "internal_link": "https://www.mjbizdirectory.com/company/913217/akerna",
        "url": null,
        "linkedin": null,
        "description": "Akerna (Nasdaq: KERN) is an enterprise software company focused on compliantly serving the cannabis, hemp, and CBD industries. Based in Denver, Colorado, the Company's mission is to create the world's most transparent and accountable supply chain by building a cannabis technology ecosystem connecting data points across the global cannabis supply chain from seed to sale to self. Using connected data and information to propel the cannabis industry forward, Akerna empowers businesses, governments, patients, and consumers to make smart decisions. The Company's cornerstone technology, MJ Platform, the world's leading infrastructure as a service platform, powers retailers, manufacturers, brands, distributors, and cultivators. Akerna also offers a complete suite of professional consulting services and data analytics for businesses."
    },
    {
        "title": "CoastBio",
        "internal_link": "https://www.mjbizdirectory.com/company/919299/coastbio",
        "url": null,
        "linkedin": null,
        "description": "CoastBio is pioneering the future of healthy soils and clean water with our organic, biological-based amendments designed for large-scale agriculture and bioremediation projects. Our innovative production methods for mycorrhizal fungi significantly reduce application costs per acre, making sustainable farming more accessible and efficient. Offering a diverse range of products, including seven species of endomycorrhiza, five species of ectomycorrhiza, and various beneficial microbes, we cater to the unique needs of farms, agri-businesses, and environmental remediation efforts. Our capabilities extend to custom blending and labeling services, ensuring tailored solutions for each client's specific requirements. Based in California, CoastBio is committed to providing cost-effective, ecological solutions for soil health and wastewater treatment."
    },
    {
        "title": "SpringBIG",
        "internal_link": "https://www.mjbizdirectory.com/company/913039/springbig",
        "url": null,
        "linkedin": null,
        "description": "Springbig is the industry leading marketing SaaS provider for the recreational, medicinal and compliant cannabis and CBD industries of North America. Springbig has led the way, providing targeted, granular SMS & email marketing to both retail and brand clients from enterprise grade solutions, all the way down to catering to independent dispensaries. While simultaneously, crafting unique loyalty programs and white-labeled native apps for clients. With 6+ years of experience providing these services to the cannabis industry, we have been blazing the path to success for 2500+ dispensary locations. Innovation also means never stopping the improvement process, so we are always working on directly integrating with over 30+ POS and E-Commerce providers to enable dispensary owners to track advertising campaign conversions in near-real time. Our system is HIPAA and SOC2 compliant, ensuring your consumer data is securely stored, so you can rest easy. Learn how you can leverage springbig to gain market share, retain loyal customers and increase your revenue today!"
    },
    {
        "title": "3rd Element Consulting",
        "internal_link": "https://www.mjbizdirectory.com/company/915376/3rd-element-consulting",
        "url": null,
        "linkedin": null,
        "description": "3rd Element provides a full scope of IT offerings to support businesses in the horticultural, manufacturing, distribution, retail, and cannabis markets, as well as legal, law enforcement and government. Our corporate headquarters are in Mechanicsburg, PA, with a secondary office in Houston, TX. We serve customers across the United States with onsite and virtual support. Our leadership team possesses decades of proven experience across tech segments, and years of award-winning service. 3rd Element has been rated one of the top 250 Managed Service Providers in North America for years. Our CEO, Dawn is listed as one of the top women in tech year over year."
    },
    {
        "title": "Hoodie Analytics",
        "internal_link": "https://www.mjbizdirectory.com/company/913381/hoodie-analytics",
        "url": null,
        "linkedin": null,
        "description": "Next Day & Real-Time Cannabis Product Pricing, Promotion & Sales Insights. Global Coverage. SKU Level Pricing & Stocking Levels for Brands and Cannabis Dispensaries."
    },
    {
        "title": "Solink",
        "internal_link": "https://www.mjbizdirectory.com/company/900731/solink",
        "url": null,
        "linkedin": null,
        "description": "Solink, at its core, provides a compliant video management system that helps connect the dots on the day-to-day of a dispensary. Through leveraging existing investments (Video surveillance systems & Point of Sales) Solink allows its users to navigate through transactions with ease, while pairing together the relevant video to give a complete perspective. With the click of a button, Solink can turn your camera system into a robust video alarm system with emergency dispatch, to help protect the safety of your employees and community."
    },
    {
        "title": "AmeriCoco-FiberDust",
        "internal_link": "https://www.mjbizdirectory.com/company/913189/americoco-fiberdust",
        "url": null,
        "linkedin": null,
        "description": "Wholesale supplier,global producer, coconut coir peat, pith, coir block,coir slab,coir grow bags, coir poles, coir container load, coir India, coir SriLanka,"
    },
    {
        "title": "Meadow",
        "internal_link": "https://www.mjbizdirectory.com/company/912673/meadow",
        "url": null,
        "linkedin": null,
        "description": "Meadow’s all-in-one cannabis POS platform has the tools you need to efficiently run and scale your dispensary business, with intuitive interfaces and thoughtful workflows to manage your entire front and back of house operations. Seamlessly complete all core business functions from one centralized dashboard, easily navigate between managing inventory, tracking orders, running reports, reviewing sales trends, activating a new promotional code, sending SMS messages and communicating directly with your customers. Optimized based on real-world feedback from high-volume retail partners since 2014, our software will help you sell more products, stay compliant with state and local regulations, keep staff and customers happy, and boost your bottom line. Learn more at getmeadow.com"
    },
    {
        "title": "Headset",
        "internal_link": "https://www.mjbizdirectory.com/company/913216/headset",
        "url": null,
        "linkedin": null,
        "description": "Services & Solutions for the Cannabis Industry - Eliminate the guesswork and confidently build your business strategy. Headset provides industry-leading data analytics & market intelligence solutions for cannabis retailers, product manufacturers, CPGs, processors, growers & all ancillary services.\n\nOur cannabis data is unmatched - Everything at Headset begins with retail and consumer shopping. Headset connects with point-of-sale data from retail and dispensary cooperators, giving Headset subscribers an aggregated market read, providing visibility into industry trends, market data, competitive insights, and new opportunities, all in real-time. We work with well over 1,000 retailers in medical and adult-use markets in the United States and Canada, delivering comprehensive cannabis business intelligence solutions for cannabis products & businesses."
    },
    {
        "title": "Blaze Solutions",
        "internal_link": "https://www.mjbizdirectory.com/company/913005/blaze-solutions",
        "url": null,
        "linkedin": null,
        "description": "Founded in 2017, BLAZE, a VC-backed California technology company, offers unified seed-to-sale software and apps for the cannabis supply chain. Developed by tech entrepreneurs and former cannabis company operators, BLAZE makes tech simple with an easy-to-use frontend powered by an enterprise backend for dispensaries, delivery services, distributors, and cultivators. Customers can be more profitable and productive while creating a better user experience for end customers and employees. The company software ensures compliance with state laws and taxes. BLAZE offers full APIs and integrates seamlessly with over 60 technology vendors in the cannabis industry."
    },
    {
        "title": "Avivatech",
        "internal_link": "https://www.mjbizdirectory.com/company/913526/avivatech",
        "url": null,
        "linkedin": null,
        "description": "With cash automation solutions from Avivatech, cannabis retailers can set themselves up for greater success by enabling quicker, easier, and more accurate cash management processes. XpressCash from Avivatech frees retail staff from the time-consuming continuous counts and recounts of their tills and creates a more secure process for the end-of-day balancing. The solution also enables cannabis stores to manage cash payments for product inventory, service providers and even payroll with easy vendor set-up, dollar amount limits, high speed cash dispense and full transaction audit logs. XpressControl gives retailers the end-to-end cash visibility they need to proactively manage secure cash and enforce accountability across all locations.\n\nAvivatech proudly delivers the efficient transactions and total control cannabis retailers need to drive growth and success in their businesses."
    },
    {
        "title": "Fujitsu Frontech North America",
        "internal_link": "https://www.mjbizdirectory.com/company/551242/fujitsu-frontech-north-america",
        "url": null,
        "linkedin": null,
        "description": "Fujitsu Frontech North America Inc. offers a wide variety of products, including currency handling equipment, self-checkout systems, biometric authentication technology, and RFID solutions. Operations and product development is headquartered in Orange County, California, with sales, service and engineering support throughout the United States, Canada, and globally."
    },
    {
        "title": "Trym",
        "internal_link": "https://www.mjbizdirectory.com/company/913017/trym",
        "url": null,
        "linkedin": null,
        "description": "Cannabis software built for commercial growers. Improve efficiency & consistency to optimize your grow for more ROI and less WTF. Our mission is to help growers succeed by providing powerful software to level-up their operations. Trym combines task management, environmental sensor data, and innovative compliance tech like: Touchless Harvesting - to empower growers to boost efficiency, increase yields, and stay compliant."
    },
    {
        "title": "Revolution Retail Systems LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/746112/revolution-retail-systems-llc",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "IQ BackOffice",
        "internal_link": "https://www.mjbizdirectory.com/company/912985/iq-backoffice",
        "url": null,
        "linkedin": null,
        "description": "IQ BackOffice - Finance and Accounting Business Process Outsourcing Solutions, Accounting/AP/AR/Managed Payroll Outsourcing."
    },
    {
        "title": "Cultivera",
        "internal_link": "https://www.mjbizdirectory.com/company/918509/cultivera",
        "url": null,
        "linkedin": null,
        "description": "Cultivera is powering the legal cannabis industry with our proven and reliable enterprise platform for cultivators, manufacturers, distributors, and retailers.\n\nCultivera Pro is cannabis operations and business management software for cultivators, manufacturers, processors, and distributors, featuring automated workflows from seed to sale, making compliance simple at every stage.\n\nCultivera Market is a B2B order portal built to increase revenue by connecting buyers to top brands’ live menus, featuring real-time product availability, automated fulfillment, and simplified sales and inventory management\n\nCultivera POS is an all-in-one point of sale and dispensary management system that includes personalized inventory, purchasing, and customer management solutions for cannabis retailers and medical dispensaries."
    },
    {
        "title": "PeopleGuru",
        "internal_link": "https://www.mjbizdirectory.com/company/816451/peopleguru",
        "url": null,
        "linkedin": null,
        "description": "PeopleGuru provides cloud-based human capital management (HCM) software to help agile, mid-market organizations attract, retain, and recognize their people and streamline back-office HR and Payroll functions."
    },
    {
        "title": "Parabit",
        "internal_link": "https://www.mjbizdirectory.com/company/913030/parabit",
        "url": null,
        "linkedin": null,
        "description": "Parabit is a leading global provider of innovative security and self-service hardware and software solutions. Known for quality, reliability and durability, our full range of services includes product design, software design and development, engineering services, prototyping, manufacturing, integration, logistics, installation, reporting and service. With a rich tradition of performance excellence in public deployments, our turn-key solutions secure facilities and transform the customer experience."
    },
    {
        "title": "Shield Compliance",
        "internal_link": "https://www.mjbizdirectory.com/company/915482/shield-compliance",
        "url": null,
        "linkedin": null,
        "description": "Shield Compliance transforms how financial institutions manage risk, comply with regulations, and satisfy operational demands associated with serving the legal cannabis market. For more information or to schedule a demo, please visit https://www.shieldbanking.com."
    },
    {
        "title": "ProCanna",
        "internal_link": "https://www.mjbizdirectory.com/company/915443/procanna",
        "url": null,
        "linkedin": null,
        "description": "ProCanna is a cloud-based solution for all levels of your cannabis operation. Tools for all of your employees to confidently implement, maintain, track and share proof of compliant operations in a cost-effective way. Enjoy the ease of use, pre-built content, training and onboarding, data, history, and much more. Take back control and ownership of your compliance, data, regulations, operations, and more by utilizing ProCanna."
    },
    {
        "title": "The Attivo Group",
        "internal_link": "https://www.mjbizdirectory.com/company/915469/the-attivo-group",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Tella Digital",
        "internal_link": "https://www.mjbizdirectory.com/company/915380/tella-digital",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Forian",
        "internal_link": "https://www.mjbizdirectory.com/company/915368/forian",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Edistera Tech Pvt Ltd",
        "internal_link": "https://www.mjbizdirectory.com/company/915432/edistera-tech-pvt-ltd",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Support One",
        "internal_link": "https://www.mjbizdirectory.com/company/915314/support-one",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Applied Data Consultants, Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/838208/applied-data-consultants-inc",
        "url": null,
        "linkedin": null,
        "description": "Applied Data Consultants, Inc. (ADC) uses revolutionary web technologies and employs modern geographic information systems (GIS) to deliver real-time, dynamic, geospatial web solutions for clients throughout the nation."
    },
    {
        "title": "Salient Systems",
        "internal_link": "https://www.mjbizdirectory.com/company/238174/salient-systems",
        "url": null,
        "linkedin": null,
        "description": "Salient Systems is a leader in open architecture video management systems. By combining powerful, yet flexible video management software and versatile hardware platforms, Salient delivers surveillance solutions that are easy to use and scalable. As Salient's CompleteView VMS supports a wide variety of security industry applications, customers are free to choose the best available design parameters to fit their needs."
    },
    {
        "title": "Custom America",
        "internal_link": "https://www.mjbizdirectory.com/company/746000/custom-america",
        "url": null,
        "linkedin": null,
        "description": "Custom America, Inc. is a division of Custom S.p.a., a leader in the printing technology market. Custom America designs, manufacturers, and distributes thermal printing and Point-of-Sale hardware to a variety of vertical markets and technologies. We offer a diverse product portfolio in addition to the ability to provide complete product development and customization to meet our customers specific application needs."
    },
    {
        "title": "Tidel",
        "internal_link": "https://www.mjbizdirectory.com/company/753717/tidel",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Rees Scientific Corp.",
        "internal_link": "https://www.mjbizdirectory.com/company/58610/rees-scientific-corp",
        "url": null,
        "linkedin": null,
        "description": "Rees Scientific is an automated temperature monitoring company. We monitor temperature, humidity, differential pressure, oxygen, light, etc. and critical assets."
    },
    {
        "title": "March Networks",
        "internal_link": "https://www.mjbizdirectory.com/company/55979/march-networks",
        "url": null,
        "linkedin": null,
        "description": "A global leader in intelligent IP video surveillance products and solutions for businesses including retailers, banks, transit agencies and more."
    },
    {
        "title": "Genetec",
        "internal_link": "https://www.mjbizdirectory.com/company/83504/genetec",
        "url": null,
        "linkedin": null,
        "description": "Genetec is recognized as a pioneer in IP video surveillance and a technology leader within the physical security industry. Genetec’s develops software solutions to address three main security applications: access control, video surveillance, and license plate recognition. Synergis is an advanced IP access control system. Its innovative architecture offers end-to-end digital connectivity using leading industry IP-based controllers. Omnicast is an open-architecture IP security solution that provides seamless management of digital video, audio and data across any IP network. Both products scale from small to enterprise-class systems. Autovu, a license plate recognition technology, accurately and automatically reads and records license plates and matches the readings to a database, for both fixed and mobile applications."
    },
    {
        "title": "Arca Technologies Ltd",
        "internal_link": "https://www.mjbizdirectory.com/company/59284/arca-technologies-ltd",
        "url": null,
        "linkedin": null,
        "description": "Integrated VoIP and TDM Platform providing bulk call generation, protocol analysis and QoS measurements."
    },
    {
        "title": "Dimensional Insight",
        "internal_link": "https://www.mjbizdirectory.com/company/293475/dimensional-insight",
        "url": null,
        "linkedin": null,
        "description": "Dimensional Insight is the leading provider of integrated business intelligence and performance management solutions that empower information consumers throughout the enterprise with data-driven decision making abilities. Our worldwide presence has allowed us to service the information delivery needs of more than 2,600 customers and thousands of users from around the globe."
    },
    {
        "title": "Accelerant Manufacturing",
        "internal_link": "https://www.mjbizdirectory.com/company/913531/accelerant-manufacturing",
        "url": null,
        "linkedin": null,
        "description": "Accelerant Manufacturing revolutionizes the pre-roll production industry with its automated pre-roll machines, which can fill, pack, and twist up to 3000 cones per hour without requiring any capital investment or overhead costs. Our Production as a Service (PaaS) model ensures seamless operation by providing machine maintenance and scalability at costs as low as $0.08 per pre-roll. Trusted by industry leaders, our PRO series machines offer accurate weigh filling, environmental monitoring, and smart alerts to optimize production. With innovative features like CoolFlow technology for infused pre-rolls, we guarantee consistent quality and a premium smoking experience. Experience unparalleled customer support and training, making Accelerant Manufacturing your ultimate production co-pilot."
    },
    {
        "title": "AccuBANKER",
        "internal_link": "https://www.mjbizdirectory.com/company/912982/accubanker",
        "url": null,
        "linkedin": null,
        "description": "Money counters, coin and bill counters, and counterfeit bill detectors from one of the industry's most trusted cash handling solution provider, AccuBANKER."
    },
    {
        "title": "Adam Equipment",
        "internal_link": "https://www.mjbizdirectory.com/company/912955/adam-equipment",
        "url": null,
        "linkedin": null,
        "description": "For more than a half-century, professionals worldwide have relied on United Kingdom-based Adam Equipment for an extensive selection of dependable and affordable weighing equipment in the laboratory, education, industrial, legal cannabis, food, medical, and animal/veterinary markets. Adam operates offices and distribution centers in England, the United States, South Africa, Australia, China and Germany to provide product support and fast, efficient delivery to‚ÄØour‚ÄØworldwide‚ÄØdistribution network and customer base."
    },
    {
        "title": "AdaViv",
        "internal_link": "https://www.mjbizdirectory.com/company/913478/adaviv",
        "url": null,
        "linkedin": null,
        "description": "ADAVIV leverages AI-powered technology to revolutionize farm operations, offering tools that automate continuous improvement and enhance productivity across cultivation processes. Our platform provides real-time insights that help reduce per-pound costs, optimize labor efficiency, and ensure precise execution of cultivation tasks. By enabling early detection of crop health issues, ADAVIV allows farmers to swiftly address and mitigate risks, ultimately leading to higher yields and reduced losses. Our solutions foster a culture of operational excellence and sustainable growth by significantly lowering chemical dependencies and boosting team performance. Trusted by industry veterans, ADAVIV is the key to transforming your farm into a model of efficiency and success."
    },
    {
        "title": "AEssenseGrows",
        "internal_link": "https://www.mjbizdirectory.com/company/913103/aessensegrows",
        "url": null,
        "linkedin": null,
        "description": "AEssenseGrows (pronounced \"essence grows\"), founded in 2014, is a precision AgTech company based in Santa Clara, Calif. with global locations and customers.\nAEssenseGrows provides precision sensor and software controlled aeroponic grow systems for cannabis and fresh produce operations. These highly automated SmartFarms are at your fingertips from anywhere in the world."
    },
    {
        "title": "Agrinomix",
        "internal_link": "https://www.mjbizdirectory.com/company/913011/agrinomix",
        "url": null,
        "linkedin": null,
        "description": "AgriNomix, a key component of AdeptAg, is North America's premier provider of automation, irrigation, and integrated control solutions for controlled-environment agriculture. We specialize in offering a complete suite of best-in-class products including potting machines, conveyor systems, seeding solutions, and advanced irrigation technologies, all designed to maximize efficiency and productivity. Our commitment extends beyond delivering top-quality products; we offer 24/7 support, training, and a dedicated service team to ensure your operations run smoothly. Formed in 2022, AdeptAg brings together industry leaders to deliver exceptional ROI by understanding unique grower needs and providing tailored, innovative solutions. Trust AgriNomix to be your partner in optimizing your horticultural production and achieving unparalleled success."
    },
    {
        "title": "Alcott Enterprises",
        "internal_link": "https://www.mjbizdirectory.com/company/913263/alcott-enterprises",
        "url": null,
        "linkedin": null,
        "description": "I.T. as a Value Based Service.\n\nEstablished in 2014, Alcott Enterprises is an information technology consulting company delivering agile IT strategies and next-generation IT managed services. As a 100% remote organization based in Los Angeles, CA, Alcott Enterprises offers over 50+ years of combined industry experience. Our experts have been leading digital transformations, providing consulting services, and managing the technical infrastructure for companies of all sizes, across a variety of industries."
    },
    {
        "title": "Ardent Cannabis",
        "internal_link": "https://www.mjbizdirectory.com/company/913231/ardent-cannabis",
        "url": null,
        "linkedin": null,
        "description": "Decarboxylation converts cannabis into its active form, making it bioavailable for our bodies. Try infusing with our easy-to-use decarbing machines!"
    },
    {
        "title": "Berbix",
        "internal_link": "https://www.mjbizdirectory.com/company/913102/berbix",
        "url": null,
        "linkedin": null,
        "description": "Instant identity verification with Berbix combines a biometric scan of a user's face with data extracted from the human and machine readable components of the ID. Quickly and accurately check IDs to accelerate growth."
    },
    {
        "title": "BioTherm",
        "internal_link": "https://www.mjbizdirectory.com/company/913097/biotherm",
        "url": null,
        "linkedin": null,
        "description": "Cultivation Environment Solutions since 1980\n\nBioTherm's Environment Enhancements range from root zone heating systems, greenhouse/indoor climate control, dissolved oxygen irrigation systems, AC/dehumidification, CO2 Enrichment, and more. Knowledge and experience have made BioTherm one of the most trusted sources for cultivation technologies for commercial and craft plant growers.\n\nTake control of your growing enterprise with BioTherm enhancements. Join the legion of BioTherm customers and benefit from greater sustainability, lower costs and maximizing your crop yield with a BioTherm system."
    },
    {
        "title": "BudSense",
        "internal_link": "https://www.mjbizdirectory.com/company/912846/budsense",
        "url": null,
        "linkedin": null,
        "description": "Cannabis menus are hard to manage. Selling weed is supposed to be fun.\nBudSense helps you create better digital, print, and web cannabis menus."
    },
    {
        "title": "BVB Substrates",
        "internal_link": "https://www.mjbizdirectory.com/company/913264/bvb-substrates",
        "url": null,
        "linkedin": null,
        "description": "BVB Substrates, a trusted brand under Kekkilä-BVB, stands at the forefront of growing media with over a century of expertise, serving professional growers across Europe and now the United States. Our high-quality, tailor-made substrates support diverse cultivation needs, from berries and leafy greens to medical cannabis and ornamental plants. Born from a deep-rooted heritage of horticulture, our knowledgeable Sales Advisors, many of whom are experienced growers themselves, provide unparalleled support and advice to our clients. We pride ourselves on being more than just suppliers; we are your partners in achieving the best possible outcomes for your crops. Together, we strive to grow for a better future, nurturing both plants and positive, sustainable practices."
    },
    {
        "title": "Canix",
        "internal_link": "https://www.mjbizdirectory.com/company/913296/canix",
        "url": null,
        "linkedin": null,
        "description": "Canix is a cannabis ERP software and seed-to-sale platform for cannabis cultivators, manufacturers and distributors. Founded in 2019, the company serves both large commercial operations and standalone single-service operators. Canix provides a suite of tools for cannabis companies to operate efficiently and increase profit margins while remaining compliant with legislative authorities. With Canix, businesses have complete control over their real-time inventory and sales data."
    },
    {
        "title": "Cannabiz Media",
        "internal_link": "https://www.mjbizdirectory.com/company/912958/cannabiz-media",
        "url": null,
        "linkedin": null,
        "description": "License Database provides cannabis & hemp license data. Sales & marketing teams get contact information for license holders & a powerful email marketing tool. Financial analysts & investors conduct analysis, target M&A, and research valuations."
    },
    {
        "title": "CannaBusiness ERP",
        "internal_link": "https://www.mjbizdirectory.com/company/912781/cannabusiness-erp",
        "url": null,
        "linkedin": null,
        "description": "CannaBusiness ERP is built to manage your entire business. More than basic seed-to-sale or compliance-only software, CannaBusiness ERP tracks production, inventory, sales, finance, quality and clients. It streamlines financial and operational management - Supports quality and safety (GMP, US State/Health Canada reporting) - Improves cultivation and production management - Increases inventory accuracy and provides insight to actual costs. NexTec Group developed CannaBusiness ERP based on years in the cannabis industry. We've incorporated best practices from top growers and industry leaders."
    },
    {
        "title": "CannaPoint / Mariner Business Solutions",
        "internal_link": "https://www.mjbizdirectory.com/company/912866/cannapoint-mariner-business-solutions",
        "url": null,
        "linkedin": null,
        "description": "The CannaPoint Seed-to-Sale software was designed by industry experts specifically for grow operations, manufacturing facilities and retail operations in the cannabis industry. We are METRC certified and can help track plants from propagation to processing."
    },
    {
        "title": "CGM LABDAQ",
        "internal_link": "https://www.mjbizdirectory.com/company/912812/cgm-labdaq",
        "url": null,
        "linkedin": null,
        "description": "From CompuGroup Medical, CGM LABDAQ is a laboratory information management system (LIMS) designed to manage cannabis testing data with instrument integration, support of multi-step testing protocols, quality control, data review, and inventory management. This lab manager software connects users with instruments, cultivators, dispensaries, regulatory bodies, third-party software, and more."
    },
    {
        "title": "CIMA CASH HANDLING AMERICA, INC.",
        "internal_link": "https://www.mjbizdirectory.com/company/913442/cima-cash-handling-america-inc",
        "url": null,
        "linkedin": null,
        "description": "CIMA is a manufacturer of cash management equipment and cash automation machines that include smart safes, back office/front of store cash recycling machines, and software. We help cannabis businesses significantly reduce the cost of managing cash."
    },
    {
        "title": "Climate Control Systems",
        "internal_link": "https://www.mjbizdirectory.com/company/913027/climate-control-systems",
        "url": null,
        "linkedin": null,
        "description": "Climate Control Systems Inc. has been manufacturing grow automation systems since 1985. Our grow automation software and solutions help achieve a better crop while saving precious grower time. Our 3 main solutions are the Fertigation Manager‚, Climate Manager‚ and Ozone Pro Water Treatment‚ Systems. These products are designed to help growers & owners maximize crop yields, help manage energy costs and help with water & fertilizer conservation"
    },
    {
        "title": "Cova Software",
        "internal_link": "https://www.mjbizdirectory.com/company/913180/cova-software",
        "url": null,
        "linkedin": null,
        "description": "Cova Software is the leading POS solution in the cannabis industry. Cova helps retailers simplify compliance, reduce operational costs, and increase revenue through automated compliance, inventory management, and mobile reporting dashboards. Our retail platform powers 20,000 stores with virtually no downtime, even on 4/20, making us the most robust and reliable cannabis POS system available."
    },
    {
        "title": "Cultivatd",
        "internal_link": "https://www.mjbizdirectory.com/company/913507/cultivatd",
        "url": null,
        "linkedin": null,
        "description": "We provide no-cost consultation and expert insight into agriculture technology that will improve the performance of your indoor farm. Whether you are planning, building, or expanding your farming facility, our staff expertise can help save you time, money, and frustration."
    },
    {
        "title": "Cure8",
        "internal_link": "https://www.mjbizdirectory.com/company/913472/cure8",
        "url": null,
        "linkedin": null,
        "description": "About Cure8 - The cannabis IT services leader. Get help planning and setting up the tech for your next location, or fixing problems with your current IT. Services include POS installation, surveillance system installation, and 24/7 IT management and support."
    },
    {
        "title": "Cvault/FreshStor",
        "internal_link": "https://www.mjbizdirectory.com/company/913104/cvault-freshstor",
        "url": null,
        "linkedin": null,
        "description": "FreshStor is dedicated to revolutionizing the way you preserve and store your harvests with innovative cold storage solutions. Our cutting-edge technologies ensure optimal temperature and humidity levels, extending the life and quality of your produce. Whether in agriculture, floriculture, or other industries requiring meticulous preservation, FreshStor provides tailored solutions to meet your unique needs. Our commitment to sustainability and efficiency helps businesses minimize waste and maximize profits. Trust FreshStor to keep your hardest work fresher, longer."
    },
    {
        "title": "Delta9 Systems & Color Label Solutions",
        "internal_link": "https://www.mjbizdirectory.com/company/912680/delta9-systems-color-label-solutions",
        "url": null,
        "linkedin": null,
        "description": "Delta9 Systems is your comprehensive source for cutting-edge cannabis cultivation and processing supplies, offering everything from advanced cannabis labeling and packaging solutions to robust tracking systems. Our innovative technologies, such as the Purpl PRO Instant Cannabis Potency Measurement System, empower your business to maximize efficiency, eliminate waste, and enhance profitability. We provide an extensive catalog of products, including thermal and inkjet label printers, barcode scanners, and high-precision weighing scales, all designed to meet the unique needs of cannabis operations. Our commitment to exceptional service means we are dedicated to supporting your business from seed to sale with tailored solutions and professional expertise. Discover how Delta9 Systems can elevate your cannabis facility to new heights of operational excellence."
    },
    {
        "title": "DEMA Engineering",
        "internal_link": "https://www.mjbizdirectory.com/company/851714/dema-engineering",
        "url": null,
        "linkedin": null,
        "description": "DEMA Is A Leading Supplier Of Chemical Dispensing Systems, Fluid Control Devices And Industrial Solenoid Valves, Strainers, Pumps And Injectors For Virtually Any Industrial, Institutional And Professional Market. Our institutional systems address the housekeeping, food service, food processing, warewash and laundry markets plus many other industries where precise metering of fluids is critical. DEMA industrial products answer the needs of the car wash, beverage, dairy, agriculture, irrigation, plant and design engineering marketplaces."
    },
    {
        "title": "Distru",
        "internal_link": "https://www.mjbizdirectory.com/company/919731/distru",
        "url": null,
        "linkedin": null,
        "description": "Distru is the modern seed to sale software trusted by hundreds of the top cannabis brands across the nation, giving them the ability to manage inventory, orders, and customer relations all from a single platform. Distru features like one-click inline repackaging, granular cost accounting, and automating route generation help you save hundreds of hours per week. We continue to build on our integrations and partner ecosystems. Distru integrates with cannabis wholesale platforms like LeafLink, cannabis cultivation software like Trym, the major cannabis POS systems (Dutchie, Treez, and BLAZE,) and financial software like QuickBooks, all in order to streamline and centralize your day to day workflows."
    },
    {
        "title": "dopeapps",
        "internal_link": "https://www.mjbizdirectory.com/company/912735/dopeapps",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "e2b teknologies",
        "internal_link": "https://www.mjbizdirectory.com/company/912873/e2b-teknologies",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Elevated Signals",
        "internal_link": "https://www.mjbizdirectory.com/company/913399/elevated-signals",
        "url": null,
        "linkedin": null,
        "description": "We help cannabis manufacturers streamline processes, unite departments & make better decisions backed by data. You'll be more efficient, competitive & profitable with Elevated Signals."
    },
    {
        "title": "Eskatech",
        "internal_link": "https://www.mjbizdirectory.com/company/913509/eskatech",
        "url": null,
        "linkedin": null,
        "description": "Expert security, surveillance, and technology solutions for Michigan businesses."
    },
    {
        "title": "Extreme Microbial Technologies",
        "internal_link": "https://www.mjbizdirectory.com/company/913458/extreme-microbial-technologies",
        "url": null,
        "linkedin": null,
        "description": "Extreme Microbial Technologies provides systems that continually generate Energized Hydrogen\nPeroxide Particles to seek out and deactivate contaminants as they're introduced into spaces.\nPassive solutions, including HEPA filters and UV lights, wait for harmful pathogens to travel\ndirectly to them. EMT solutions actively clean the air and surfaces to keep your environment safe.\nReduces and deactivates viruses, bacteria, molds, and odors by up to 99.99% Safe for occupied\nspaces, machinery, materials, animals, and plants\nScalable to any size indoor space"
    },
    {
        "title": "Figgro",
        "internal_link": "https://www.mjbizdirectory.com/company/912740/figgro",
        "url": null,
        "linkedin": null,
        "description": "Figgro is the single source Ready Cannabis Industry Manufacturing ERP. Figgro offers Cannabis Cloud ERP Powered by AI"
    },
    {
        "title": "Flowhub",
        "internal_link": "https://www.mjbizdirectory.com/company/925193/flowhub",
        "url": null,
        "linkedin": null,
        "description": "At Flowhub, we're on a mission to make safe cannabis product accessible to everyone on planet Earth. Flowhub is the leading cannabis technology company partnering with dispensaries nationwide to provide compliance, point of sale, payments, inventory tracking, and retail management solutions. Today, Flowhub processes over $3 billion in cannabis sales annually, empowering more than 1,000 cannabis retailers to automate operations, increase revenue, and create the best dispensary experience possible."
    },
    {
        "title": "GeoShepard, Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/913154/geoshepard-inc",
        "url": null,
        "linkedin": null,
        "description": "METRC Automated. GeoShepard's proprietary cannabis scale wirelessly sends marijuana compliance data to METRC accurately & FAST!"
    },
    {
        "title": "GGS Structures Inc.",
        "internal_link": "https://www.mjbizdirectory.com/company/913222/ggs-structures-inc",
        "url": null,
        "linkedin": null,
        "description": "GGS has been manufacturing top quality greenhouses and providing turnkey growing solutions for commercial growers since 1979. We work with you to provide the perfect environment for consistent quality cannabis crops at maximum yield, from structures and marijuana grow tables to light deprivation and environmental controls. Our dedicated marijuana grow team can assist you in design, installation and complete project management of your marijuana greenhouse or cannabis indoor garden using advanced technology and over 40 years of experience."
    },
    {
        "title": "Green Rebates",
        "internal_link": "https://www.mjbizdirectory.com/company/912895/green-rebates",
        "url": null,
        "linkedin": null,
        "description": "Green Rebates is the only energy rebate and incentive company that specializes in horticulture. We help commercial indoor and greenhouse growers get paid for implementing efficient grow equipment and lighting. Our customers have received millions of dollars in cash for everything from LED grow lights, HVAC, to Dehumidifiers, and more!"
    },
    {
        "title": "Greenducts by KE",
        "internal_link": "https://www.mjbizdirectory.com/company/912790/greenducts-by-ke",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Greenlink Merchants",
        "internal_link": "https://www.mjbizdirectory.com/company/912899/greenlink-merchants",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "Greenlyght",
        "internal_link": "https://www.mjbizdirectory.com/company/912695/greenlyght",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "GrowDirector",
        "internal_link": "https://www.mjbizdirectory.com/company/913548/growdirector",
        "url": null,
        "linkedin": null,
        "description": "GrowDirector is revolutionizing modern agriculture with its advanced automation solutions tailored for hydroponics, aeroponics, and traditional farming methods. Our flagship product, GrowDirector 3 PRO, simplifies complex growing processes by automating nutrient delivery, environmental control, and precise irrigation, thereby reducing labor costs and increasing yields. Utilizing AI-powered sensors and an intuitive interface, growers can maintain optimal conditions 24/7, ensuring consistent and high-quality crop production. Whether you're cultivating leafy greens, cannabis, or operating a greenhouse, our integrated systems offer actionable insights and seamless management to enhance your operation's efficiency. Join the new era of smart farming with GrowDirector and watch your productivity soar."
    },
    {
        "title": "Hawthorne Gardening Company",
        "internal_link": "https://www.mjbizdirectory.com/company/913215/hawthorne-gardening-company",
        "url": null,
        "linkedin": null,
        "description": "Hawthorne Gardening Company is a leading provider of hydroponic and indoor gardening solutions, dedicated to empowering growers with advanced technologies and high-quality products. Our comprehensive offerings include cutting-edge lighting systems, state-of-the-art climate control, and a wide range of nutrients and propagation solutions tailored for both hobbyists and commercial cultivators. We are committed to sustainability and innovation, ensuring our customers achieve optimal growth and success. With a strong focus on education, advocacy, and equity, Hawthorne Gardening Company stands as a trusted partner in the agricultural community. Experience unparalleled support and expertise as we help you grow your potential, from seed to harvest."
    },
    {
        "title": "Hybrid Payroll",
        "internal_link": "https://www.mjbizdirectory.com/company/913145/hybrid-payroll",
        "url": null,
        "linkedin": null,
        "description": "Hybrid Payroll was founded in 2014, originally Ms. Mary Staffing, as the first payroll service for the cannabis industry. Hybrid Payroll is headquartered in Denver, CO and has since expanded to offering Payroll, Professional Employer Organization (PEO), Insurance, Human Resources, and Staffing nationwide. Hybrid Payroll provides small and midsize businesses with a full-service HR solution so they can free themselves from the complexities of HR and focus on their goals. As their trusted HR business partner, Hybrid Payroll assumes many of the responsibilities of being an employer and helps these companies contain HR costs, minimize employer-related risks and relieve the administrative burden of HR. Hybrid Payroll offers bundled HR products tailored by industry and strategic HR services, resulting in a comprehensive and empowering solution."
    },
    {
        "title": "Hydrotek Hydroponics",
        "internal_link": "https://www.mjbizdirectory.com/company/913196/hydrotek-hydroponics",
        "url": null,
        "linkedin": null,
        "description": "Since 1998, Hydrotek Hydroponics has been North America hydroponic equipment distributor of choice for quality wholesale gardening supplies. Our catalog of select hydroponic growing equipment includes some of the top manufacturers of hydroponic cultivation supplies in the industry, including General Hydroponics, Cyco, and Remo hydroponic plant nutrients, grow lights from indoor growing experts Gavita and Luxx, Wachsen Pro Rolling Benches and Grow Racks, XTrays flood tables and grow trays, FloraFlex grows systems, Anden dehumidifiers, and more.\n\nHydrotek Hydroponics strives to provide the best hydroponic growing solutions for your urban garden and home-grown plants. In addition to the hydroponic equipment manufacturers we proudly distribute, Hydrotek Hydroponics also offers consultation services for ACMPR licensed producers and hydroponic store owners, including plant grow light mapping, CAD design, custom bench, and tray manufacturing, and specialized hydroponic retailer solutions."
    },
    {
        "title": "InTu Mobility",
        "internal_link": "https://www.mjbizdirectory.com/company/912815/intu-mobility",
        "url": null,
        "linkedin": null,
        "description": "A full-service packaging supplier. From flex-pack to shrink sleeves, labels, and more. All products are made and printed in the USA!"
    },
    {
        "title": "Kanha Technology Solutions",
        "internal_link": "https://www.mjbizdirectory.com/company/920205/kanha-technology-solutions",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "KayaPush",
        "internal_link": "https://www.mjbizdirectory.com/company/913473/kayapush",
        "url": null,
        "linkedin": null,
        "description": "KayaPush is the all-in-one platform making people management for dispensary owners easy.\nOur cloud-based technology offers integrated tools, including payroll, hiring and onboarding, HR, scheduling, and time tracking.\nThe software also integrates with leading dispensary POS systems to help streamline operations and provide insights into sales and labor metrics.\nSuitable for dispensary owners and operators who manage one store or many, KayaPush makes people management easy."
    },
    {
        "title": "Leaf Trade",
        "internal_link": "https://www.mjbizdirectory.com/company/913093/leaf-trade",
        "url": null,
        "linkedin": null,
        "description": "Leaf Trade is a technology company whose platform facilitates B2B ordering and fulfillment for cultivators, retailers, distributors, processors, and dispensaries in legalized cannabis and hemp markets.\n\nThe company is distinguished by its industry expertise and specializations, namely key integrations and partnerships with seed-to-sale, accounting, logistics, and ERP systems. Leaf Trade system operates in 17 states and is utilized by the majority of MSOs (multi-state operators) nationwide."
    },
    {
        "title": "Lift and Grow",
        "internal_link": "https://www.mjbizdirectory.com/company/919455/lift-and-grow",
        "url": null,
        "linkedin": null,
        "description": "Lift and Grow revolutionizes commercial cannabis cultivation with our state-of-the-art automated overhead grow light and drying rack systems. With the touch of a button, you can precisely adjust the height of your lights and racks, enhancing both safety and efficiency in your grow facility. Our solutions are designed to maximize ROI by improving product quality and operational workflow. Trusted by leading brands, our patent-pending systems are customizable to fit any room design, ensuring optimal performance and ease of use. Experience the benefits of advanced automation and elevate your cultivation process with Lift and Grow."
    },
    {
        "title": "Metrc, LLC",
        "internal_link": "https://www.mjbizdirectory.com/company/913197/metrc-llc",
        "url": null,
        "linkedin": null,
        "description": "Securing Markets. Supporting Business. Protecting Consumers. Metrc is the most trusted and experienced provider of cannabis regulatory systems in the United States. Our solution combines advanced software, radio-frequency identification (RFID), a dedicated customer-support team, and a secure database to track cannabis from growth, harvest, and processing to testing, transport, and sale. Metrc serves over 250,000 users, including growers, testing facilities, dispensaries, state regulators, and law enforcement officials across 21 states, the District of Columbia and Guam. We are proud to play a leading role in ensuring the safety and security of the nation's legal cannabis market."
    },
    {
        "title": "Millipore Sigma",
        "internal_link": "https://www.mjbizdirectory.com/company/913113/millipore-sigma",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "MISHMASH",
        "internal_link": "https://www.mjbizdirectory.com/company/912924/mishmash",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "MJM Install",
        "internal_link": "https://www.mjbizdirectory.com/company/913082/mjm-install",
        "url": null,
        "linkedin": null,
        "description": "Cannabis Greenhouse, Cultivation and Grow Room Construction. Modular, custom solutions. Professional bids & pricing. Call MJM Install today"
    },
    {
        "title": "North American Greenhouses",
        "internal_link": "https://www.mjbizdirectory.com/company/913413/north-american-greenhouses",
        "url": null,
        "linkedin": null,
        "description": "Somos una empresa dedicada a la fabricaciv=n e instalaciv=n de proyectos para la agricultura protegida. Nuestros servicios incluyen: Invernaderos, Casas Sombras, Super Macro, Heat Booster System, Insumos, Sistemas de Riego, automatizaciv=n y Retrofits."
    },
    {
        "title": "Onset - HOBO Data Loggers",
        "internal_link": "https://www.mjbizdirectory.com/company/913023/onset-hobo-data-loggers",
        "url": null,
        "linkedin": null,
        "description": "For decades, Onset HOBO Data Loggers have been widely recognized as the trusted industry standard for monitoring environmental conditions, water, and energy. Research-grade HOBO data loggers, remote monitoring systems, and weather stations offer valuable insights into daily grow operations, giving you the power to make informed decisions that can help control variables, optimize water use, prevent mold, maximize yields, and cut costs. Our award-winning HOBOnet monitoring system lets you deploy up to 50 wireless sensors across your operation to measure a wide range of parameters, including soil moisture/electrical conductivity (EC), temperature/RH, PAR, evapotranspiration (ET), and energy use with a main station sending your data directly to the cloud for convenient, anytime access and real-time alerts via text/email. From cannabis cultivation to processing, HOBO has the monitoring tools you need to grow your business, your confidence‚Ä¶and your profits!"
    },
    {
        "title": "Onsharp",
        "internal_link": "https://www.mjbizdirectory.com/company/913077/onsharp",
        "url": null,
        "linkedin": null,
        "description": "Providing web design and hosting as well as app and software development services, Onsharp is based in Fargo, ND with offices in Minneapolis and Denver."
    },
    {
        "title": "Outlaw Technology",
        "internal_link": "https://www.mjbizdirectory.com/company/913294/outlaw-technology",
        "url": null,
        "linkedin": null,
        "description": "Outlaw Technology provides solutions via our hardware/software based systems designed to capture data for plants, packages and products via RFID and/or barcode. Our OG Harvest system automates the process of weight to tag ID and our Desperado handheld allows for plant or package AUDITS/inventory via RFID, all MOVES as well as plant DESTROY. In addition the handheld can be used to locate any missing plant or package via their RFID tags. Finally, Outlaw is now enabling RFID for dispensaries via our MAVERICK program. Simply reach out and we can set up a web demo to show you all the functionality we provide to our customers coast-to-coast."
    },
    {
        "title": "Pipp Horticulture",
        "internal_link": "https://www.mjbizdirectory.com/company/913057/pipp-horticulture",
        "url": null,
        "linkedin": null,
        "description": "Pipp Horticulture is the industry leading provider of mobile vertical farming systems, with systems installed in over 400 indoor cultivation facilities totaling over 2,000 grow rooms in 45 states and provinces across North America! Our mobile grow racks allow cultivators to maximize space in cultivation production and post-harvest processing facilities. Implementing Pipp mobile racks will increase production by maximizing the cubic canopy footprint without increasing the square footprint of the room or building."
    },
    {
        "title": "POLN8 powered by 420 Financial",
        "internal_link": "https://www.mjbizdirectory.com/company/912724/poln8-powered-by-420-financial",
        "url": null,
        "linkedin": null,
        "description": "POLN8 is an all-inclusive solution that enables dispensaries to securely accept ACH, Debit, and Crypto Payments. Built-in marketing features empower businesses to grow their customer base and entice clients to come in and shop more often, all without the burdens of accepting cash.\n\nIn addition to providing dispensaries with their own custom-branded app, POLN8 delivers features such as push notifications, automated SMS marketing tools, geo-fencing, and a social media referral engine. Thanks to POLN8 technology and strategies, our portfolio of clients have experienced a 17% increase in average ticket sales and 50% lift in customer frequency.\n\nContact us today and learn how POLN8 can help you outgrow the competition."
    },
    {
        "title": "Predictive Nutrient Solutions",
        "internal_link": "https://www.mjbizdirectory.com/company/913474/predictive-nutrient-solutions",
        "url": null,
        "linkedin": null,
        "description": "PREDICTIVE NUTRIENT SOLUTIONS, INC. (PNS) is a soil and plant health optimization company that provides premium products that effectively blend Predictive Soil Testing Technologies with Intuitive Software for DIY and Professional Landscape markets. Our predictive decision-making platform merges disruptive soil nutrient release measurements with crop uptake demands, providing actionable insights only accomplished with our combination of technologies and software. The PNS Dashboard provides data-driven nutrient alerts, reminders, application rates and product chemistries to maximize yield, quality, and nutrient density while simultaneously eliminating or reducing the off-target movement of environmentally sensitive nutrients."
    },
    {
        "title": "Proteus 420",
        "internal_link": "https://www.mjbizdirectory.com/company/913182/proteus-420",
        "url": null,
        "linkedin": null,
        "description": "PROTEUS 420 the ONLY Real Time, Powerful and secure cannabis dispensary solution. Our Inventory, Client and POS management is developed for Cannabis Clubs and Medical Marijuana Dispensary and Delivery business."
    },
    {
        "title": "Ridder",
        "internal_link": "https://www.mjbizdirectory.com/company/913268/ridder",
        "url": null,
        "linkedin": null,
        "description": "Ridder | Innovative technical solutions for protected horticulture | Inside greenhouse technology for profitable horticulture."
    },
    {
        "title": "Senseon Secure Access",
        "internal_link": "https://www.mjbizdirectory.com/company/912854/senseon-secure-access",
        "url": null,
        "linkedin": null,
        "description": "Senseon is North America premier designer and manufacturer of concealed access control and inventory tracking systems for dispensary fixtures. Integrated within store fixtures, Senseon access control delivers seamless protection and monitoring to secure merchandise, optimize workflow, and help keep businesses compliant. Senseon protection allows dispensaries to have inventory on the sales floor without compromising aesthetics or security. Since 2011, Senseon systems have protected storage cabinets in retail, healthcare, and finance across America. Senseon is a part of Accuride International, the leading designer and manufacturer of premium movement solutions for over 60 years."
    },
    {
        "title": "SEO Guarantee",
        "internal_link": "https://www.mjbizdirectory.com/company/913371/seo-guarantee",
        "url": null,
        "linkedin": null,
        "description": "Work with the best SEO company by First Page SEO Guarantee. We are a digital marketing agency that specializes in Web Design, CRO, and SEO services."
    },
    {
        "title": "Siebert | Certent",
        "internal_link": "https://www.mjbizdirectory.com/company/913096/siebert-certent",
        "url": null,
        "linkedin": null,
        "description": "A strong portfolio of investment, insurance, and stock plan options, paired with advice from top wealth management and financial planning advisors."
    },
    {
        "title": "SoCal Safe Company",
        "internal_link": "https://www.mjbizdirectory.com/company/913432/socal-safe-company",
        "url": null,
        "linkedin": null,
        "description": "We offer one of the world's largest selections of affordable safes and\nsecurity products. With 100 years in business, we set the standard for\ncustomer care. We have burglary resistant to high security safes of all\nratings ‚Äî TL-15, TL-30, TL-30X6, TRTL-30x6 and more. From cash counters, to\ndepository safes, to automated cash and coin recycling, we're here to serve\nyou. Click or call today."
    },
    {
        "title": "STM Canna",
        "internal_link": "https://www.mjbizdirectory.com/company/913020/stm-canna",
        "url": null,
        "linkedin": null,
        "description": "Shop the Leading Manufacturer of the Industry Leading #1 Selling RocketBox Commercial Pre-Roll Machines, the Revolution Industrial Cannabis Grinders. STM Canna revolutionizes the cannabis industry with advanced, modular pre-roll machines designed to optimize and automate your production workflow. Trusted by top cannabis brands, our cutting-edge solutions like the RocketBox and Atomic Closer deliver unparalleled speed and efficiency, filling and closing up to 72 pre-rolls in just seconds. We pride ourselves on providing scalable and flexible systems that grow with your business, ensuring faster ROI and reduced labor costs. Our comprehensive product range—from grinders to infusers—guarantees premium quality and consistency, elevating your pre-roll production to new heights. Experience the STM Canna advantage and join a growing list of satisfied clients who benefit from our innovative automation solutions."
    },
    {
        "title": "Surfside",
        "internal_link": "https://www.mjbizdirectory.com/company/913227/surfside",
        "url": null,
        "linkedin": null,
        "description": "Turning Customer Data Into Personalized Marketing"
    },
    {
        "title": "The HC Companies",
        "internal_link": "https://www.mjbizdirectory.com/company/913123/the-hc-companies",
        "url": null,
        "linkedin": null,
        "description": "Here at HC, we proudly support professional growers, distributors, retail garden centers, and mass merchandisers with locations throughout North America for quick and easy delivery where your business does business. HC is the culmination of many storied brands in the industry including Dillen, ITML, Kord‚, Amerikan, and Listo all of which helped to create the innovative company we are today. HC utilizes the latest technologies to create our full line of greenhouse and nursery growing containers, whether they are blow mold, thermoform, injection, co-ex, or vacuum formed. Additionally, our sustainable fiber containers are created in a closed-loop water recycling system to eliminate waste and help preserve the environment."
    },
    {
        "title": "Vape-Jet",
        "internal_link": "https://www.mjbizdirectory.com/company/913546/vape-jet",
        "url": null,
        "linkedin": null,
        "description": "Reduce costs and fill variability, while preserving product quality with our state-of-the-art fully-automatic and semi-automatic vape cartridge filling and capping machines. Whether you're a small lab looking to scale or a high-volume enterprise, we have a machine that will fit your needs and help take your business into the stratosphere."
    },
    {
        "title": "Vinculum Group",
        "internal_link": "https://www.mjbizdirectory.com/company/924277/vinculum-group",
        "url": null,
        "linkedin": null,
        "description": "Vinculum is a software company enabling retailing across sales channels. We help Sellers, Online brands, Retailers, Marketplaces & 3PLs with Vin eRetail, a powerful Multi-Channel Order Management Suite with ready integrations to marketplaces, 3PLs and webstores, Vin PIM keeping product information consistent and Vin SIM ensuring real-time store inventory data."
    },
    {
        "title": "Vista IT Systems Inc",
        "internal_link": "https://www.mjbizdirectory.com/company/913181/vista-it-systems-inc",
        "url": null,
        "linkedin": null,
        "description": "Vista provides a full scope of IT offerings to support businesses in the horticultural, manufacturing, distribution, retail, and cannabis markets, as well as government.\n\nOur corporate headquarters are in Medina, Ohio, with easy access to both Cleveland and Akron, and we serve customers across the United States with onsite and virtual support.\n\nOur leadership team possesses decades of proven experience\nacross tech segments, from automatic data identification (auto ID) and programming to equipment, military IT and network solutions."
    },
    {
        "title": "WayvGear Co., Ltd.",
        "internal_link": "https://www.mjbizdirectory.com/company/912750/wayvgear-co-ltd",
        "url": null,
        "linkedin": null,
        "description": "New viewpoint of RF (Radio Frequency)RF as energy sources, RF solid state cooking system, Resonate heating, Plasma lighting"
    },
    {
        "title": "Webscale",
        "internal_link": "https://www.mjbizdirectory.com/company/913069/webscale",
        "url": null,
        "linkedin": null,
        "description": "Whether your storefront is looking to boost its Core Web Vitals performance, improve its security, go fully headless‚ or develop its first progressive web app, you need a cloud hosting and delivery provider with the expertise to get you there. Webscale is the world only cloud platform for the successful delivery of modern commerce applications, and we power the online presence of cannabis brands like Trulieve, PharmaCann, and Airfield Supply Co., as well as Fortune 100 brands including Dollar General, Regal Cinemas, Swarovski, and many more."
    },
    {
        "title": "Woodward Movement",
        "internal_link": "https://www.mjbizdirectory.com/company/912839/woodward-movement",
        "url": null,
        "linkedin": null,
        "description": null
    },
    {
        "title": "WS Hampshire",
        "internal_link": "https://www.mjbizdirectory.com/company/913172/ws-hampshire",
        "url": null,
        "linkedin": null,
        "description": "WS Hampshire is a custom fabricator and producer of aeroponic grow boxes for use in indoor grow facilities. Used by NASA to grow vegetables in space, aeroponic growing requires no soil or other media and nutrients are applied directly to the plants root system. This means plants do not expel energy searching for resources, leading to shorter growth cycles and higher yields. In addition, water and nutrient consumption is reduced by 90% or more. Our grow boxes are made from a highly specialized, opaque material that reflects all light back to the plants and does not allow light penetration into the root zone. This lack of light means algae growth is eliminated, resulting in a clean and healthy root system with easy post-harvest cleanouts."
    },
    {
        "title": "YOOLUX TECHNOLOGY CO,LIMITED",
        "internal_link": "https://www.mjbizdirectory.com/company/912791/yoolux-technology-co-limited",
        "url": null,
        "linkedin": null,
        "description": "YOOLUX always focus on indoor horticultural equipment and plant growth technology, research, development.\nWe are innovators striving to create advanced solutions and technology that will solve the problems from small household set-ups to medium growing operations.\nOur dynamic in-house design & sales team have placed us at the forefront of plant growth field, enabling us to deliver an extensive range of HPS lamp, MH lamp, CMH lamp, HID fixtuers, LED fixtures , from seed stage, germination stage, growth stage, flowering stage and fruiting stage.\nOur fast delivery service to our mainland US customers and our continuous investment in design and technology ensures we can consistently offer excellent stock availability, product reliability and professional after sales technical support.\nWe focus exclusively on OEM & ODM, product quality and reliability, supported by a fast, efficient service to all of our customers."
    }
]